{
  "lastUpdate": 1767164303236,
  "posts": [
    {
      "hn_id": 46423290,
      "title": "Tesla’s 4680 battery supply chain collapses as partner writes down deal by 99%",
      "url": "https://electrek.co/2025/12/29/tesla-4680-battery-supply-chain-collapses-partner-writes-down-dea/",
      "content": null,
      "points": 641,
      "comment_count": 747,
      "author": "coloneltcb",
      "created_at": 1767031023000,
      "title_cn": "特斯拉4680电池供应链崩塌，合作伙伴将交易减记99%",
      "content_cn": null,
      "abstract": "该讨论围绕特斯拉4680电池供应链问题展开，核心是韩国供应商L&F将29亿美元合同减值至约7400美元的事件。社区观点呈现明显分歧：部分用户质疑特斯拉的技术路线，引用路透社报道指出4680电池试产中正极材料损耗率高达70%-80%，远高于行业标准；也有用户认为媒体报道存在偏见，指出Electrek等媒体长期对特斯拉持负面态度，而实际减产可能源于特斯拉转向自主研发干法正极工艺，主动调整供应链。讨论中提到，用户对特斯拉的评价呈现两极分化，社交媒体普遍乐观，而专业论坛则多持批判态度。关于电池形态，有用户质疑圆柱形4680电池是否适合磷酸铁锂化学体系，建议参考比亚迪刀片电池的方形设计。整体来看，社区对特斯拉技术转型的具体进展缺乏共识，但普遍认为媒体报道需要谨慎看待。",
      "comments": [
        {
          "hn_comment_id": 46423846,
          "parent_id": null,
          "author": "fencepost",
          "content": "Doing a quick bit of searching based on the 4680 makes me think that there has been or will be a change from NMC811 to LFP chemistry in the 4680, including one article talking about changing to US and European-based in-house manufacturing and reducing dependence on China.I'm no fan of Tesla, but this looks like the collapse of the contract with the supplier for the battery chemistry they've moved away from, aka \"no [more] big deal.\"2023 article confirming NMC chemistry: https://iopscience.iop.org/article/10.1149/1945-7111/ad14d05/2025 article discussing change to LFP: https://roboticsbiz.com/teslas-4680-lfp-battery-explained-ch...3/2025 article comparing BYD's LFP and Tesla's NMC/NCM: https://www.sciencedirect.com/science/article/pii/S266638642...",
          "created_at": 1767033755000,
          "content_cn": "根据对4680电池的快速搜索，我认为特斯拉的4680电池已经或即将从NMC811化学体系转向LFP（磷酸铁锂）化学体系，其中一篇文章还提到将转向美国和欧洲的本土化生产，以减少对中国的依赖。我并非特斯拉的粉丝，但这看起来像是他们与原有电池化学体系供应商的合约已经瓦解，也就是所谓的“不再是什么大事”。2023年的文章确认了NMC化学体系：https://iopscience.iop.org/article/10.1149/1945-7111/ad14d05/2025年的文章讨论了转向LFP：https://roboticsbiz.com/teslas-4680-lfp-battery-explained-ch...3/2025年的文章比较了比亚迪的LFP和特斯拉的NMC/NCM：https://www.sciencedirect.com/science/article/pii/S266638642..."
        },
        {
          "hn_comment_id": 46424619,
          "parent_id": 46423846,
          "author": "iknowstuff",
          "content": "This makes sense but does it make sense to manufacture LFPs as 4680 cylinders instead of rectangular blocks/blades, given https://en.wikipedia.org/wiki/BYD_Blade_battery ?",
          "created_at": 1767037373000,
          "content_cn": "这说得通，但考虑到比亚迪刀片电池的设计，将磷酸铁锂电池制成4680圆柱形而非矩形块状或片状是否有意义呢？"
        },
        {
          "hn_comment_id": 46432943,
          "parent_id": null,
          "author": "spprashant",
          "content": "I am no big fan of Tesla, but Electrek has a clear bias in their reporting.",
          "created_at": 1767099858000,
          "content_cn": "我并不是特斯拉的狂热粉丝，但Electrek的报道明显带有偏见。"
        },
        {
          "hn_comment_id": 46423498,
          "parent_id": null,
          "author": "thebruce87m",
          "content": "> In a regulatory filing today, L&F revealed that the contract’s value has been written down to just $7,386.> No, that is not a typo. $2.9 billion to roughly $7,400.Ooft. That’s one hell of a write down. Imagine the person that had to do the calculation and report it back.",
          "created_at": 1767032105000,
          "content_cn": "在今天提交的监管文件中，L&F透露该合同价值已减记至仅7,386美元。\n不，这不是笔误。从29亿美元缩水至约7400美元。\n天啊。这简直是史诗级的资产减记。难以想象负责核算并上报此事的人作何感想。"
        },
        {
          "hn_comment_id": 46429645,
          "parent_id": null,
          "author": "omarforgotpwd",
          "content": "Tesla is actually starting to make cathodes in house via a dry process, which is why they are no longer buying cathode material from this supplier. Typical sloppy reporting from Electrek.",
          "created_at": 1767069977000,
          "content_cn": "特斯拉实际上已开始通过干法工艺自行生产阴极材料，因此不再从这家供应商采购阴极材料。Electrek的报道还是一如既往地粗心大意。"
        },
        {
          "hn_comment_id": 46430291,
          "parent_id": null,
          "author": "sidcool",
          "content": "The picture of Tesla across internet is so polarizing.  X and YouTube is full of Tesla is the future vibe.  Electrek and HN is calling it a complete scam.  I am sure it's in the middle, but I can't find a balanced opinion anywhere.But I have seen Electrek being too negative about Tesla always.  And never reporting anything positive as such.",
          "created_at": 1767077337000,
          "content_cn": "特斯拉在互联网上的形象两极分化严重。X和YouTube上充斥着特斯拉代表未来的氛围，而Electrek和HN则直指其完全是场骗局。我确信真相介于两者之间，却找不到任何平衡的观点。但我注意到Electrek对特斯拉总是过于负面，从未报道过任何正面消息。"
        },
        {
          "hn_comment_id": 46423469,
          "parent_id": null,
          "author": "Neil44",
          "content": "Reuters earlier this year - \"The development of the 4680 battery has been facing troubles, with the company losing 70% to 80% of the cathodes in test production compared with conventional battery makers, which lose fewer than 2% of their components to manufacturing defects, the report said.\"The company L&F referenced in this article were supplying said cathode material.ref https://www.reuters.com/technology/tesla-plans-four-new-batt...",
          "created_at": 1767031966000,
          "content_cn": "路透社今年早些时候报道称：“4680电池的开发一直面临困难，该公司在试生产过程中损失了70%至80%的正极材料，而传统电池制造商因制造缺陷损失的组件不到2%。”文中提到的L&F公司正是该正极材料的供应商。"
        },
        {
          "hn_comment_id": 46425967,
          "parent_id": null,
          "author": "nate",
          "content": "I know there’s a lot of Tesla/Elon hate here. I’m not denying any of it. I’m just sharing a genuinely strange experience I wasn’t expecting.We needed a car again. Sold ours a year ago and got by with Uber, rentals, taxis. Life changed a bit and we needed something more predictable. I was planning to buy something used and boring and didn’t really care what.My wife asked, “What about an EV?” We can’t charge in our rental garage, but there’s a Tesla Supercharger literally across the street. Took a Tesla test drive mostly out of curiosity.And… I drove maybe 1% of that drive. The rest was on full self driving (FSD).Fast forward, I now own a Tesla, and about 99% of my driving is on FSD.Important context: when we picked it up, it was still on v13. It immediately made an illegal turn and scared some pedestrians in a crosswalk. So yes, I get the concern and skepticism. I had it too.Then v14.2 landed.Whatever they changed in that release feels real. It’s not just incremental. It feels like a different system. Elon says “we finally cracked it” (and probably says that all the time), so take that with a grain of salt, but with my very small sample size… it kind of looks like they might have.Two moments that really stuck with me:While self-driving, the car clearly anticipated a bus making a massive wide turn into our lane and hung way back until the maneuver was complete. It saw that developing long before I did.At ~70 mph, I was mid lane-change with my blinker on when a driver towing a large trailer decided to drift into the same lane without checking their blind spot. The Tesla instantly aborted the lane change and smoothly moved back, avoiding what would’ve been a nasty accident. No panic, no hard braking, no drama.I know this probably sounds like shilling. I’m not interested in the politics and don’t want to defend any of that. But it genuinely feels like stepping into the future, and honestly a much safer way to drive.I want Rivian, Waymo, whoever to nail this too. I hope they do. But right now, Tesla seems to actually have something that crossed a line from “demo” to “wow, this is real.”I didn’t expect to come away thinking that. But here we are.",
          "created_at": 1767043921000,
          "content_cn": "我知道这里有很多人对特斯拉/埃隆有负面看法。我并非否认这些观点，只是分享一段出乎意料的奇特经历。我们最近又需要一辆车了——一年前卖掉自己的车后，一直靠网约车、租车和出租车度日。生活有些变化，我们需要更稳定的出行方式。原本计划买辆普通二手车，对车型并不在意。\n\n妻子突然问：“要不要试试电动车？”我们租的车库无法充电，但街对面就有一个特斯拉超充站。出于好奇，我们预约了试驾。结果……那段试驾路程中我大概只操控了1%的时间，其余全程都是完全自动驾驶（FSD）在运作。\n\n后来我直接买了辆特斯拉，现在约99%的驾驶都交给FSD。需要说明的是：提车时系统还是v13版本，它曾突然违规转弯，把人行横道上的行人吓得不轻。所以我完全理解大家的担忧和怀疑——当初我也一样。\n\n直到v14.2版本上线。\n\n这次更新带来的改变是实质性的，并非简单优化，整个系统仿佛脱胎换骨。埃隆说“我们终于突破了技术瓶颈”（虽然他可能经常这么说），这话或许要打个折扣，但以我有限的体验来看……他们可能真的做到了。\n\n有两个场景让我印象深刻：自动驾驶时，车辆提前预判到公交车要大幅转弯切入我们的车道，早早减速保持距离，直到对方完成变道——它比我更早察觉这个动态。另一次在时速70英里时，我正打着转向灯准备变道，后方突然出现一辆拖着拖车的汽车……"
        },
        {
          "hn_comment_id": 46423610,
          "parent_id": null,
          "author": "netdur",
          "content": "i don't understand americans, two years ago i wanted a tesla, now i want a byd, you've let down the only american company competing against the chinese, all because of trump and politics",
          "created_at": 1767032666000,
          "content_cn": "我真搞不懂美国人，两年前我还想要特斯拉，现在却想要比亚迪。你们让唯一能与中国人竞争的美国公司失望了，全都是因为特朗普和政治。"
        },
        {
          "hn_comment_id": 46423487,
          "parent_id": null,
          "author": "jack_riminton",
          "content": "Electrek’s ‘reporting’ has proven so one-sided that I take all their stories with a bucket of salt. Even if the truck has been a flop I doubt their whole battery program has been. Perhaps they’re rejigging suppliers and pausing whilst they get ready to ramp up cyber cab production lines",
          "created_at": 1767032064000,
          "content_cn": "Electrek的“报道”已被证明如此片面，以至于我对他们的所有报道都持高度怀疑态度。即便卡车项目遭遇失败，我也不认为他们的整个电池计划都失败了。或许他们正在调整供应商，并在准备提升赛博出租车生产线时暂停了相关计划。"
        },
        {
          "hn_comment_id": 46431007,
          "parent_id": null,
          "author": "MagicMoonlight",
          "content": "Tesla had a ridiculous lead over everyone and they spaffed it.No new features, no HUD, no dashboard. They want 60k for cars which have nothing in them. Other companies have now ripped the software and the iPad, so they have nothing unique.All they had to do was continue to improve the product. They didn’t even try.",
          "created_at": 1767084475000,
          "content_cn": "特斯拉曾拥有令人咋舌的领先优势，却被他们白白浪费了。没有新功能，没有抬头显示，没有仪表盘。他们竟敢为这些空壳车要价六万。其他公司如今已经复制了软件和平板设计，他们再无独特之处。他们本只需持续改进产品，却连尝试都不曾有过。"
        },
        {
          "hn_comment_id": 46424307,
          "parent_id": null,
          "author": "nerdo",
          "content": "What is TSLA's valuation based on anymore? Maybe next week it'll be the moon colony they’ll have up and running in 2028.",
          "created_at": 1767035974000,
          "content_cn": "特斯拉的估值到底基于什么？也许下周他们会说2028年就能建好并运营月球殖民地了。"
        },
        {
          "hn_comment_id": 46423509,
          "parent_id": null,
          "author": "manoDev",
          "content": "The future of electrification is at risk because the market chose to bet on TSLA. Many companies backpedaled on EV and the POTUS is making a major push towards oil (including invading Venezuela). The future looks grim.",
          "created_at": 1767032178000,
          "content_cn": "电气化的未来正面临危机，因为市场选择押注特斯拉。许多公司在电动汽车领域退缩，而美国总统正大力推动石油产业（包括入侵委内瑞拉）。前景看起来十分黯淡。"
        },
        {
          "hn_comment_id": 46430180,
          "parent_id": null,
          "author": "ryukoposting",
          "content": "Is anybody surprised by the cratering demand for the Cybertruck (directly attributable to 4680 troubles)? Tesla sold the idea of a crazy space truck to a bunch of techie dorks, who then pulled out of the deal when faced with the reality of owning a vehicle that they have to clean with Barkeeper's Friend. This was the obvious result.",
          "created_at": 1767075995000,
          "content_cn": "有人对Cybertruck需求暴跌（直接归因于4680电池问题）感到惊讶吗？特斯拉向一群科技宅男兜售了这款疯狂太空卡车的概念，但当他们面对现实——需要购买专用清洁剂来维护这辆车时，便纷纷取消了订单。这显然是意料之中的结果。"
        },
        {
          "hn_comment_id": 46423496,
          "parent_id": null,
          "author": "Veserv",
          "content": "A headline that actually undersells the article. The 2,900,000,000 $ deal to 7,400 $ is not just a 99% reduction, it is actually over a 99.999% reduction. I guess that is one way to get the \"march of nines\" they keep promising.",
          "created_at": 1767032103000,
          "content_cn": "这个标题实际上还低估了文章内容。从29亿美元的交易降到7400美元，这不仅是减少了99%，实际上降幅超过了99.999%。看来这就是他们一直承诺的“九的征程”的实现方式之一。"
        },
        {
          "hn_comment_id": 46424130,
          "parent_id": null,
          "author": "Moto7451",
          "content": "Aren’t shaped prismatic cells the current state of the art anyway? The article mentioned BMW and Rivian using this size of cylindrical cell but I believe the latest from GM, Hyundai, and VW are all prismatic after the earlier designs were either pouch cells or cylindrical.",
          "created_at": 1767035124000,
          "content_cn": "难道异形棱柱电池不是当前最先进的技术吗？文章提到宝马和Rivian在使用这种尺寸的圆柱电池，但我认为通用、现代和大众的最新设计都已采用棱柱电池，而早期设计要么是软包电池要么是圆柱电池。"
        },
        {
          "hn_comment_id": 46424137,
          "parent_id": null,
          "author": "seltzered_",
          "content": "Worth noting this Branden Flasch video from a year ago talking about how the charging speed on the 4680 pack tesla Model Y was uncompetitively slow and arguably shouldn't have been sold: https://youtu.be/eQeziVkRwSA",
          "created_at": 1767035182000,
          "content_cn": "值得关注的是Branden Flasch一年前的这段视频，其中谈到特斯拉Model Y采用的4680电池组充电速度过慢，缺乏竞争力，甚至有人认为本不该上市销售：https://youtu.be/eQeziVkRwSA"
        },
        {
          "hn_comment_id": 46429622,
          "parent_id": null,
          "author": "KnuthIsGod",
          "content": "\"In a regulatory filing today, L&F revealed that the contract’s value has been written down to just $7,386.No, that is not a typo. $2.9 billion to roughly $7,400.\"https://electrek.co/2025/12/29/tesla-4680-battery-supply-cha...",
          "created_at": 1767069791000,
          "content_cn": "在今日提交的监管文件中，L&F披露该合同价值已减记至仅7,386美元。请注意，这不是笔误。金额从29亿美元骤降至约7,400美元。"
        },
        {
          "hn_comment_id": 46426282,
          "parent_id": 46424619,
          "author": "ggreer",
          "content": "Which cell technology to use depends on the application. Tesla actually uses BYD blade batteries in some of their vehicles sold in Europe. The main issue with prismatic cells is that to be safe, they must be made with LFP chemistry, which hurts energy density. LFP is also worse at charging/discharging when cold, though battery management software mostly solves that.Cylindrical cells make sense for higher performance NMC and NCA chemistries, as they can be cooled more easily (coolant lines can run in the voids between cylindrical cells), and any single cell failure is less likely to cascade to other cells. Batteries with cylindrical cells were easier to repair, but nowadays cells are welded together instead of bolted, so that's no longer an advantage.",
          "created_at": 1767045582000,
          "content_cn": "采用何种电池技术取决于具体应用场景。特斯拉在欧洲市场销售的某些车型中实际使用了比亚迪的刀片电池。方形电池的主要问题在于，为确保安全性必须采用磷酸铁锂化学体系，这会降低能量密度。磷酸铁锂电池在低温下的充放电性能也较差，不过电池管理软件基本解决了这个问题。圆柱形电池更适合高性能的镍锰钴和镍钴铝化学体系，因为它们更容易冷却（冷却管路可以布置在圆柱电池间的空隙中），且单个电池故障不易引发连锁反应。采用圆柱形电池的电池组原本更易维修，但如今电池单元采用焊接而非螺栓固定，这一优势已不复存在。"
        },
        {
          "hn_comment_id": 46431549,
          "parent_id": 46429645,
          "author": "RataNova",
          "content": "Vertical integration only makes sense if you're actually ramping output",
          "created_at": 1767089449000,
          "content_cn": "垂直整合只有在真正提高产量时才有意义。"
        },
        {
          "hn_comment_id": 46423567,
          "parent_id": 46423498,
          "author": "AnotherGoodName",
          "content": "$7,386 seems to be roughly one Cybertruck batteries worth (the only vehicle that uses that battery).As in they literally expect to build one more Cybertruck battery and that's it. I'm guessing the excess stock in the Tesla factories covers spares for a few years already.I wonder when the cancellation will be announced by Tesla? It's all but leaked at this point.",
          "created_at": 1767032498000,
          "content_cn": "7386美元大约相当于一块Cybertruck电池的价值（这是唯一使用该电池的车型）。也就是说，他们实际上只打算再生产一块Cybertruck电池就结束了。我猜特斯拉工厂的库存余量已经足够未来几年的备件需求了。不知道特斯拉何时会正式宣布取消计划？目前消息几乎已经算是公开了。"
        },
        {
          "hn_comment_id": 46429810,
          "parent_id": 46429645,
          "author": "mysecretaccount",
          "content": "> Tesla is actually starting to make cathodes in house via a dry process, which is why they are no longer buying cathode material from this supplier.The latter part of this is speculative. Tesla may have begun shipping dry cathodes but it isn't clear that they're capable of matching the former third-party volume. Tesla would absolutely need the additional 4680 volume if Cybertruck sales were meeting their original projections (as opposed to now when they are ~an order of magnitude lower).",
          "created_at": 1767071998000,
          "content_cn": "特斯拉实际上已开始通过干法工艺自行生产阴极材料，因此不再从该供应商处采购。后半部分属于推测。特斯拉可能已开始交付干法阴极，但尚不清楚其产能是否能匹配此前第三方供应商的规模。如果Cybertruck的销量达到最初预期（而非目前低于预期约一个数量级的情况），特斯拉必然需要额外的4680电池产能。"
        },
        {
          "hn_comment_id": 46433136,
          "parent_id": 46430291,
          "author": "jfoster",
          "content": "In many parts of the world, you can walk into a Tesla store and tell them you're not interested in purchasing but would like to try it anyway. More likely than not, they will give you a free test drive. You'll be able to decide for yourself whether it's the future or a scam.",
          "created_at": 1767101314000,
          "content_cn": "在世界许多地方，你可以走进特斯拉门店，告诉他们你无意购买但想试驾。他们多半会提供免费试驾机会。这样你就能自行判断这究竟是未来趋势还是商业骗局。"
        },
        {
          "hn_comment_id": 46432337,
          "parent_id": 46425967,
          "author": "crishoj",
          "content": "This genuine technological breakthrough is real and should be a main topic when discussing Tesla.Admittedly, the road to a working version of FSD has been a bumpy one, with many overly optimistic timelines, but now it's finally here, and it is almost completely ignored.",
          "created_at": 1767095155000,
          "content_cn": "这项真正的技术突破是实实在在的，应当成为讨论特斯拉时的核心议题。诚然，实现完全自动驾驶功能的道路充满波折，期间有过许多过于乐观的时间预测，但如今它终于到来，却几乎被完全忽视了。"
        },
        {
          "hn_comment_id": 46434790,
          "parent_id": 46425967,
          "author": "bicepjai",
          "content": "Tesla drivers, the road is for everyone and the road is not an experiment. Please drive carefully & responsibly as accidents can destroy families.",
          "created_at": 1767111332000,
          "content_cn": "特斯拉车主们，道路属于所有人，道路不是试验场。请谨慎负责地驾驶，因为事故可能毁掉家庭。"
        },
        {
          "hn_comment_id": 46423828,
          "parent_id": 46423610,
          "author": "bdcravens",
          "content": "Elon's personality has been known before he ever came out in support of Trump. Think back to when he called someone trying to rescue kids a \"pedo\" because they ignored his idea of building a submarine. Moreover, his inability to deliver on promises has been a well-known fact for years.",
          "created_at": 1767033659000,
          "content_cn": "在马斯克公开支持特朗普之前，他的个性就已为人所知。回想一下，他曾因为别人无视他建造潜艇的想法，就把试图营救儿童的人称作“恋童癖”。此外，他多年来无法兑现承诺的事实也早已众所周知。"
        },
        {
          "hn_comment_id": 46424535,
          "parent_id": 46423487,
          "author": "youarentrightjr",
          "content": "> get ready to ramp up cyber cab production linesThe word on the street is this is only 2 weeks out.Right after fulfilling the roadster orders.And right before the Dyson sphere that will power Grok AI is deployed.",
          "created_at": 1767036958000,
          "content_cn": "准备好加速网络出租车生产线\n坊间传闻这只需两周时间\n就在完成跑车订单之后\n而在为Grok AI提供动力的戴森球部署之前"
        },
        {
          "hn_comment_id": 46432934,
          "parent_id": 46431007,
          "author": "angott",
          "content": "> They want 60k for cars which have nothing in them. Other companies have now ripped the software and the iPad, so they have nothing uniqueYou are not wrong about Tesla's base models like the 3 and Y being light on traditional 60k car features, but the second part is much more debatable. With the exception of some Chinese car manufacturers, almost no Western car makers have managed to match Tesla's software stack.I can't think of another car brand that makes its own silicon, ships OTA updates weekly, runs an in-house OS that isn't an outdated Android skin, and tightly integrates media, navigation, charging, and energy management all in the same platform. Most legacy automakers still rely on their old infotainment vendors, release update slowly (if at all!), and struggle with fragmented software architectures. Their driver assistance systems are improving very slowly, and they are behind Tesla even for basic features like lane-keep assist. And that's even before getting into self-driving ambitions, where no brand has been able to ship anything similar AFAIK.Rivian and Lucid are closer philosophically and technically, but they're still quite tiny players compared to Tesla, and haven't proven they can execute at Tesla's volume and pricing.",
          "created_at": 1767099789000,
          "content_cn": "他们想为几乎空壳的汽车定价6万美元。其他公司现在已经复制了软件和平板设计，所以特斯拉已无独特之处。关于特斯拉基础款如Model 3和Y在传统6万美元级车型配置上较为精简的说法没错，但后半部分争议较大。除部分中国车企外，几乎没有西方汽车制造商能匹配特斯拉的软件体系。我找不到另一个汽车品牌能自主研发芯片、每周推送OTA更新、运行非老旧安卓改版的自主操作系统，并将媒体、导航、充电和能源管理深度整合在同一平台。多数传统车企仍依赖老牌车载信息娱乐供应商，软件更新缓慢（甚至没有），且受困于碎片化的软件架构。他们的驾驶辅助系统进展迟缓，甚至在车道保持等基础功能上也落后于特斯拉。这还没涉及自动驾驶领域——据我所知尚无品牌能推出类似功能。Rivian和Lucid在理念和技术上更接近，但与特斯拉相比规模仍小，尚未证明能实现特斯拉的量产规模和定价能力。"
        },
        {
          "hn_comment_id": 46423563,
          "parent_id": 46423509,
          "author": "coliveira",
          "content": "They essentially gave away the market to Chinese companies, while at the same time complaining that China is \"stealing\" something.",
          "created_at": 1767032483000,
          "content_cn": "他们实际上是把市场拱手让给了中国公司，同时却抱怨中国在“窃取”什么。"
        },
        {
          "hn_comment_id": 46423703,
          "parent_id": 46423509,
          "author": "gota",
          "content": "> The future of electrification is at risk because the market chose to bet on TSLAIt really isn't. BYD is progressively becoming ubiquitous here (large South America city)",
          "created_at": 1767033062000,
          "content_cn": "电气化的未来岌岌可危，因为市场选择押注特斯拉。事实并非如此。比亚迪正逐渐在这里（南美洲大城市）变得无处不在。"
        },
        {
          "hn_comment_id": 46425386,
          "parent_id": 46424130,
          "author": "bgarbiak",
          "content": "I guess it depends on who you’d ask. BMW made a switch from prismatic cells to cylindrical design only recently, and it looks like the biggest gain was in costs and weight efficiency. The range/capacity ratio didn’t improve that much. Although, to be fair, none of these parameters depend on battery alone.",
          "created_at": 1767041064000,
          "content_cn": "我想这取决于你问谁。宝马最近才从方形电池转向圆柱形设计，看起来最大的收益在于成本和重量效率。续航/容量比并没有太大提升。不过公平地说，这些参数都不完全取决于电池本身。"
        },
        {
          "hn_comment_id": 46429715,
          "parent_id": 46423496,
          "author": "amluto",
          "content": "At some point the question isn’t “how many nines” but “why is the contract worth $7400 and not $0”.",
          "created_at": 1767071007000,
          "content_cn": "在某些时候，问题不在于“有多少个九”，而在于“为什么合同价值7400美元而不是0美元”。"
        },
        {
          "hn_comment_id": 46430238,
          "parent_id": 46430180,
          "author": "IceHegel",
          "content": "I would buy a Cybertruck tomorrow if it had a gas engine. I would buy a $10,000 or $15,000 gas generator add-on if it enabled unlimited range (provided I have gasoline).There are just too many places, even in California, where I have to limit my trip because of electric range.I'm surprised no one has done the generator.",
          "created_at": 1767076698000,
          "content_cn": "如果赛博卡车有燃油发动机，我明天就会买一辆。如果能通过加装一万或一万五千美元的燃油发电机实现无限续航（前提是有汽油），我也会购买。即使在加州，也有太多地方因为电动续航问题不得不限制行程。居然没人尝试发电机方案，这让我很意外。"
        },
        {
          "hn_comment_id": 46435684,
          "parent_id": 46431549,
          "author": "rconti",
          "content": "I think the missing information here is whether there are plans to put the 4680 in vehicles that sell well.",
          "created_at": 1767115808000,
          "content_cn": "我认为这里缺失的信息是是否有计划将4680电池应用于畅销车型中。"
        },
        {
          "hn_comment_id": 46423672,
          "parent_id": 46423567,
          "author": "gota",
          "content": "Maybe they did this to keep the contract with a symbolic value; or to avoid the headlines that Tesla 'cancelled' the contract?A '99% write down' is such an uncommon term that many people might not register it.",
          "created_at": 1767032963000,
          "content_cn": "或许他们这样做是为了让合同保持象征性价值；或者是为了避免出现特斯拉“取消”合同的头条新闻？“99%的减值”这种说法并不常见，很多人可能不会注意到。"
        },
        {
          "hn_comment_id": 46430072,
          "parent_id": 46429810,
          "author": "DustinBrett",
          "content": "The entire article is speculative.",
          "created_at": 1767074771000,
          "content_cn": "整篇文章都是推测性的。"
        },
        {
          "hn_comment_id": 46433376,
          "parent_id": 46432337,
          "author": "soared",
          "content": "It’s been “here” or “almost here” for a decade according to Elon. The world and media are sleeping the hype because they ate up the hype for so long and never saw results.",
          "created_at": 1767103139000,
          "content_cn": "按照埃隆的说法，这项技术已经“即将到来”或“几乎到来”了十年。世界和媒体对此已不再热衷，因为他们曾长期追捧炒作，却始终未见成果。"
        },
        {
          "hn_comment_id": 46436040,
          "parent_id": 46434790,
          "author": "HDThoreaun",
          "content": "The sad reality is that tons of people are terrible drivers. I’d much rather have Tesla self driving over a significant portion of the population.",
          "created_at": 1767117649000,
          "content_cn": "可悲的现实是，有大量的人驾驶技术极差。我宁愿让特斯拉自动驾驶，也不愿让相当一部分人来开车。"
        },
        {
          "hn_comment_id": 46430271,
          "parent_id": 46423828,
          "author": "modeless",
          "content": "He regularly delivers on promises. What he consistently fails to deliver on is timelines.",
          "created_at": 1767077098000,
          "content_cn": "他总能兑现承诺，但总在时间上失信。"
        },
        {
          "hn_comment_id": 46433189,
          "parent_id": 46423828,
          "author": "jfoster",
          "content": "Since when is someone trying to build a difficult thing on a tight timeline referred to as a \"promise\"?He sets extremely ambitious goals and usually/often misses them, but the end result is that despite missing the ambitious goal, something amazing is delivered still much faster than anyone else could do it.",
          "created_at": 1767101714000,
          "content_cn": "从何时起，有人试图在紧迫时间内完成艰巨任务会被称作\"承诺\"？他设定了极其宏大的目标，通常/经常无法如期达成，但最终结果是：即便错过了雄心勃勃的期限，他交付的成果依然惊人，且远比其他人所能达到的速度更快。"
        },
        {
          "hn_comment_id": 46433787,
          "parent_id": 46424535,
          "author": "Loughla",
          "content": "If we build a Dyson sphere just to power chat bots, I'm turning into an eco-terrorist.",
          "created_at": 1767105888000,
          "content_cn": "如果我们建造戴森球只是为了给聊天机器人供电，那我就要变成生态恐怖分子了。"
        },
        {
          "hn_comment_id": 46437853,
          "parent_id": 46432934,
          "author": "celticninja",
          "content": "Seriously, I don't need my car to get weekly OTA updates. And my 8yr old nissan qashqai had lane assist, it's hardly revolutionary. Tesla is pretty much dead in Europe, mainly due to Musks personality, but the quality of its product is also poor.",
          "created_at": 1767127918000,
          "content_cn": "说真的，我的车根本不需要每周进行OTA升级。而且我那辆8年车龄的日产逍客早就配备了车道辅助功能，这根本算不上什么革新。特斯拉在欧洲市场基本已经凉了，主要因为马斯克的个人作风，但产品质量也确实不怎么样。"
        },
        {
          "hn_comment_id": 46423623,
          "parent_id": 46423563,
          "author": "nxm",
          "content": "Why didn’t the Europeans come out on top?",
          "created_at": 1767032718000,
          "content_cn": "为什么欧洲人没有占据上风？"
        },
        {
          "hn_comment_id": 46433807,
          "parent_id": 46432934,
          "author": "audunw",
          "content": "Some other brands rely on Mobileye for driver assistance. It’s clear from demos that Mobileye is on the same level as Tesla, the difference is that the don’t use end users as beta testers. I suspect that when actual full self driving is possible, other car companies won’t be as far behind as you’d think based on the features Tesla has in their cars now.",
          "created_at": 1767106022000,
          "content_cn": "其他一些品牌依赖Mobileye提供驾驶辅助功能。从演示来看，Mobileye显然与特斯拉处于同一水平，区别在于他们不会将终端用户当作测试版试用者。我怀疑当真正的全自动驾驶成为可能时，其他汽车公司并不会像你根据特斯拉现有功能所设想的那样落后太多。"
        },
        {
          "hn_comment_id": 46438035,
          "parent_id": 46432934,
          "author": "8note",
          "content": "why are they making cars at all of the software is what they are good at?",
          "created_at": 1767129036000,
          "content_cn": "既然他们擅长的是软件，为什么还要造车呢？"
        },
        {
          "hn_comment_id": 46425464,
          "parent_id": 46423703,
          "author": "rasz",
          "content": "Thats why Potus is planning to liberate you guys.",
          "created_at": 1767041378000,
          "content_cn": "这就是为什么总统计划解放你们。"
        },
        {
          "hn_comment_id": 46432128,
          "parent_id": 46429715,
          "author": "Hamuko",
          "content": "Maybe they can still invoice Tesla for some office stationary or something.",
          "created_at": 1767093672000,
          "content_cn": "也许他们还能给特斯拉开些办公用品之类的发票。"
        },
        {
          "hn_comment_id": 46431962,
          "parent_id": 46429715,
          "author": "taurath",
          "content": "It was on some very nice letterhead and quite tastefully bound in a bespoke leather case!",
          "created_at": 1767092327000,
          "content_cn": "它印在非常精美的信纸上，并且用定制的皮革盒装订得相当雅致！"
        },
        {
          "hn_comment_id": 46437116,
          "parent_id": 46432934,
          "author": "Alconicon",
          "content": "My personal bet is on nvidia. They always show advanced selfdriving capabilities based on ML.They are also forefront of ml simulation. 3D, weather pattern etc.Tesla also had plenty of missshapes like Dojo or cybertruck and the sitll not finished FSD.My Car OS from Ford Mustang Mach-e works completly fine. No clue why this is some advantage Tesla should have? BMW just launched their new Gen 6 incl. their new os.All the advantages of that fully integrated 'platform' also just works in my car?BMW is very good in lane keeping, Mercedes can drive more km in germany autonomes than BMW and BMW can drive more km than Tesla.I of course focus on german brands because i'm from germany. But XPeng and others working on all of that too.",
          "created_at": 1767123716000,
          "content_cn": "我个人更看好英伟达。他们总能展示基于机器学习的先进自动驾驶能力，同时也是机器学习模拟领域的先驱，比如3D建模和天气模式模拟等方面。特斯拉也出现过不少失误，比如Dojo项目和Cybertruck，其完全自动驾驶功能至今仍未完善。我的福特野马Mach-e车载系统运行非常顺畅，不明白这为何会成为特斯拉的所谓优势？宝马刚刚推出了第六代车型，搭载全新操作系统。那些所谓完全集成“平台”的所有优势，在我的车上同样能完美实现。宝马的车道保持功能很出色，梅赛德斯在德国的自动驾驶里程超过宝马，而宝马又比特斯拉行驶得更远。我自然更关注德国品牌，毕竟我来自德国。但小鹏等公司也在这些领域全力推进。"
        },
        {
          "hn_comment_id": 46430766,
          "parent_id": 46430238,
          "author": "marticode",
          "content": "It's ugly, poorly built, expensive and not very good as a truck. A gas engine will not fix all these flaws.",
          "created_at": 1767082346000,
          "content_cn": "它外观丑陋，做工粗糙，价格昂贵，作为卡车性能也不怎么样。汽油发动机无法弥补所有这些缺陷。"
        },
        {
          "hn_comment_id": 46423459,
          "parent_id": null,
          "author": "jqpabc123",
          "content": "For years, we’ve been told that the 4680 cell was the “holy grail” that would allow Tesla to produce a $25,000 electric car.For years, we've been told a lot of things that have never come to fruition.Just 6 months ago, we were told that Robotaxi would be available to half the US population by the end of the year.https://electrek.co/2025/07/23/elon-musk-with-straight-face-...",
          "created_at": 1767031893000,
          "content_cn": "多年来，我们一直被告知4680电池是能让特斯拉生产2.5万美元电动车的“圣杯”。多年来，我们听过太多从未实现的承诺。就在六个月前，还有人声称到今年年底全美将有一半人口能用上Robotaxi自动驾驶出租车。"
        },
        {
          "hn_comment_id": 46427088,
          "parent_id": null,
          "author": "elif",
          "content": "There's a lot of speculation here.The actual facts of this reporting could just as likely be explained by vertical integration, very typical of Tesla, or of a supplier shift due to absurdly high tariffs.",
          "created_at": 1767049422000,
          "content_cn": "这里有很多猜测。报道中的实际情况同样可能源于特斯拉典型的垂直整合模式，或是因关税过高导致的供应商调整。"
        },
        {
          "hn_comment_id": 46437028,
          "parent_id": null,
          "author": "phtrivier",
          "content": "> Despite a production capacity of 250,000 units per year at Giga Texas, the Cybertruck is currently selling at a run rate of roughly 20,000 to 25,000 units annually.How can such an overcapacity be possible ? Is that a massive failure of market analysis ?On the other hand, is the factory building the cybertruck easy to modify to build other, most successful models ? I hear there is demand for billions of autonomous robotaxis.",
          "created_at": 1767123304000,
          "content_cn": "尽管得州超级工厂的年产能可达25万辆，但Cybertruck目前的年销量仅在2万至2.5万辆左右。如此严重的产能过剩是如何产生的？这是否意味着市场分析出现了重大失误？另一方面，生产Cybertruck的工厂是否易于改造，以制造其他更成功的车型？我听说市场对数十亿辆自动驾驶出租车的需求正在增长。"
        },
        {
          "hn_comment_id": 46435672,
          "parent_id": 46423846,
          "author": "itsamario",
          "content": "This is more recent and informative.https://youtu.be/-sN2_Lp10lw?si=blBPFQ9jy2L8rCNp",
          "created_at": 1767115752000,
          "content_cn": "这是最新且信息量丰富的。"
        },
        {
          "hn_comment_id": 46433642,
          "parent_id": 46423846,
          "author": "t1234s",
          "content": "Does having larger LFP cells, like the 4680 format, allow this chemistry to be used in higher-performance models? Right now it looks like only the RWD basic models use LFP cells everything else uses NMC.",
          "created_at": 1767104926000,
          "content_cn": "采用更大尺寸的LFP电池（例如4680规格）是否能让这种化学体系应用于更高性能的车型？目前看来，似乎只有后驱基础车型在使用LFP电池，其他车型均采用NMC电池。"
        },
        {
          "hn_comment_id": 46430473,
          "parent_id": 46423846,
          "author": "red75prime",
          "content": "Yeah, it's typical of Elektrec to interpret anything Tesla-related in the worst light.I personally fact checked articles about \"Autopilot disengages milliseconds before collision\" and the one related to Benavides v. Tesla case.In the first case they jumped to conclusions. In the second case they \"forgot\" to mention any details that contradict their narrative: that there were two cases separated by years, that the police has received all the information they needed in the first case, that the driver was pressing the accelerator.",
          "created_at": 1767079289000,
          "content_cn": "是的，Electrek一贯如此，总把特斯拉相关的事情往最坏的方向解读。我亲自核实过关于“自动驾驶在碰撞前毫秒级退出”的文章，以及Benavides诉特斯拉案的相关报道。在前一个案例中，他们草率得出了结论；在后一个案例中，他们“忘记”提及任何与其说法相悖的细节：比如两起事件相隔数年，警方已在第一起事件中获得所需全部信息，以及驾驶员当时踩下了加速踏板。"
        },
        {
          "hn_comment_id": 46423892,
          "parent_id": 46423459,
          "author": "PunchyHamster",
          "content": "Tesla fans have no ability to learn from past lies.",
          "created_at": 1767033958000,
          "content_cn": "特斯拉粉丝没有能力从过去的谎言中吸取教训。"
        },
        {
          "hn_comment_id": 46424090,
          "parent_id": 46423459,
          "author": "TheAlchemist",
          "content": "It's really amazing. Anyone still remembers Dojo ? 2 years ago or so they stated that they start to mass produce Dojo and it was supposed to be a top 5 supercomputer in the world by the end of 2024...https://thedriven.io/2023/06/22/tesla-to-start-building-its-...",
          "created_at": 1767034951000,
          "content_cn": "这真是太神奇了。还有人记得Dojo吗？大约两年前，他们宣布开始大规模生产Dojo，并预计到2024年底将成为全球前五的超级计算机……https://thedriven.io/2023/06/22/tesla-to-start-building-its-..."
        },
        {
          "hn_comment_id": 46424004,
          "parent_id": 46423459,
          "author": "tclancy",
          "content": "2026 is the Year of Tesla on the Desktop.",
          "created_at": 1767034535000,
          "content_cn": "2026年是特斯拉在桌面领域的元年。"
        },
        {
          "hn_comment_id": 46423734,
          "parent_id": 46423459,
          "author": "bdcravens",
          "content": "The full Robotaxi rollout is going to happen as soon as they finish fulfilling the Roadster preorders.",
          "created_at": 1767033217000,
          "content_cn": "全面推出Robotaxi将在他们完成Roadster预订单后立即进行。"
        },
        {
          "hn_comment_id": 46423945,
          "parent_id": 46423459,
          "author": "mr_mitm",
          "content": "There is an entire Wikipedia article about Musk's (mostly) failed predictions: https://en.wikipedia.org/wiki/List_of_predictions_for_autono...",
          "created_at": 1767034184000,
          "content_cn": "维基百科上有一篇专门记录马斯克（多数）失败预测的文章：https://en.wikipedia.org/wiki/List_of_predictions_for_autono..."
        },
        {
          "hn_comment_id": 46437319,
          "parent_id": 46437028,
          "author": "danans",
          "content": "> How can such an overcapacity be possible ? Is that a massive failure of market analysis ?Partially.  Turns out that the cost, size, impracticality, and look turn off most people who would buy an EV.But then there is also the active brand sabotage by the CEO, whose state of mind the Cybertruck seems to originate from and embody.",
          "created_at": 1767124791000,
          "content_cn": "如此严重的产能过剩怎么可能出现？这是市场分析的重大失误吗？部分原因确实如此。事实证明，成本、尺寸、不实用性以及外观让大多数有意购买电动车的人望而却步。但此外，还有首席执行官对品牌的主动破坏，赛博卡车的设计理念似乎正是源自并体现了他的精神状态。"
        },
        {
          "hn_comment_id": 46429838,
          "parent_id": 46424619,
          "author": "cyberax",
          "content": "Yep. Prismatic cells have poorer packaging-to-material ratio (circles are optimal). They offer better thermal properties, but thermals are not the main limiting factor anymore.And the US automakers tried prismatic cells before. Chevy Volt used them in 2012!",
          "created_at": 1767072201000,
          "content_cn": "确实。棱柱形电池的封装材料利用率较低（圆形才是最优选择）。它们具备更好的热管理性能，但散热已不再是主要限制因素。而且美国汽车制造商之前尝试过棱柱形电池，雪佛兰沃蓝达在2012年就曾使用过！"
        },
        {
          "hn_comment_id": 46431774,
          "parent_id": 46430473,
          "author": "fartfeatures",
          "content": "My understanding is Fred (Electrek) has been nothing but negative about Tesla since he got upset that they haven't released the roadster yet. Something to do with having enough referral points to get one. It has become his whole identity and it is sad to see.",
          "created_at": 1767090970000,
          "content_cn": "据我所知，自从弗雷德（Electrek）因为特斯拉尚未发布Roadster而感到不满后，他对特斯拉的评价就只剩下负面了。这似乎与他有足够的推荐积分可以兑换一辆有关。这已经成了他的全部身份标识，看着真让人难过。"
        },
        {
          "hn_comment_id": 46432114,
          "parent_id": 46430291,
          "author": "fedeb95",
          "content": "research what's in the product if you're interested in buying, and then take your risk as a consumer as with any new product one buys. Or research into the company if you want to buy shares.",
          "created_at": 1767093590000,
          "content_cn": "若有意购买产品，请先研究其成分，然后像购买任何新产品一样承担作为消费者的风险。若想购买股票，则需对该公司进行调研。"
        },
        {
          "hn_comment_id": 46424138,
          "parent_id": 46423610,
          "author": "slashdave",
          "content": "You had the opportunity to blame one person or an entire country. Which did you choose?",
          "created_at": 1767035187000,
          "content_cn": "你本有机会指责一个人或整个国家。你选择了哪个？"
        },
        {
          "hn_comment_id": 46430005,
          "parent_id": 46423487,
          "author": "jsight",
          "content": "Yeah, I'm getting the same feeling. They've announced that semi will use 4680 and Cyber Cab as well, right? If that's the case, this would point to a specific supplier issue rather than something more general.It isn't something that I've looked into in depth, but it feels like a lot of the discussion isn't hitting the mark here.",
          "created_at": 1767074041000,
          "content_cn": "是啊，我也有同感。他们不是宣布了半挂卡车和Cyber Cab也会用4680电池吗？如果真是这样，那问题可能出在特定供应商身上，而不是普遍性的。虽然我没深入研究过，但感觉很多讨论都没说到点子上。"
        },
        {
          "hn_comment_id": 46424070,
          "parent_id": 46423487,
          "author": "epistasis",
          "content": "When somebody is siding with reality, especially a media source, that's a reason to listen to them more not less.And when it's straight up facts easily verifiable from others sources, pretending that it's not based in reality is just sticking your fingers in your ears and screaming \"la la la la\" which is something that even very few 12 year olds do.",
          "created_at": 1767034836000,
          "content_cn": "当有人站在现实一边时，尤其是媒体来源，这反而是更应该倾听他们的理由。当那些直白的事实能轻易从其他渠道核实时，假装其不基于现实就如同捂住耳朵大喊\"啦啦啦啦\"，这种行为甚至连十二岁的孩子都很少会做。"
        },
        {
          "hn_comment_id": 46434423,
          "parent_id": 46425967,
          "author": "tencentshill",
          "content": "Why did you choose to run this through an LLM?",
          "created_at": 1767109372000,
          "content_cn": "你为什么要通过大语言模型来运行这个？"
        },
        {
          "hn_comment_id": 46435126,
          "parent_id": 46425967,
          "author": "Rumudiez",
          "content": "This reads like “ChatGPT is a better programmer than me, so I let it do all the work”You have a real obligation to learn how to drive. Your examples indicate neglect to take the safety of your family and others’ seriously",
          "created_at": 1767113189000,
          "content_cn": "这听起来像是“ChatGPT编程比我强，所以我让它包揽所有工作”。你确实有责任学会如何驾驶。你的例子表明你忽视了家人和他人的安全。"
        },
        {
          "hn_comment_id": 46424271,
          "parent_id": 46423487,
          "author": "narrator",
          "content": "The haters on here are ridiculous.  If everyone who ever had a product that failed in the market was called a fraud on HN then probably almost everyone would be.  SpaceX failed on their first three launches.  All the haters here would have voted to shut it all down.  Glad Elon's able to recover from business failures without going to the HN comments section to find out what he should do next.",
          "created_at": 1767035828000,
          "content_cn": "这里的批评者真是荒谬。如果每个曾在市场上遭遇产品失败的人都被HN称为骗子，那恐怕几乎所有人都难逃此标签。SpaceX的前三次发射都失败了，这里的批评者们大概都会投票要求关停整个项目。幸好埃隆能够从商业失败中恢复过来，而不需要来HN评论区寻找下一步该怎么做。"
        },
        {
          "hn_comment_id": 46426467,
          "parent_id": 46423496,
          "author": "wayeq",
          "content": "we humans aren't really good after the first couple 9's",
          "created_at": 1767046771000,
          "content_cn": "我们人类在达到几个九之后就不太行了。"
        },
        {
          "hn_comment_id": 46423960,
          "parent_id": 46423892,
          "author": "RobotToaster",
          "content": "Fool me once, shame on you, fool me 65535 times...",
          "created_at": 1767034270000,
          "content_cn": "骗我一次，是你的耻辱；骗我六万五千五百三十五回……"
        },
        {
          "hn_comment_id": 46423538,
          "parent_id": 46423487,
          "author": "malfist",
          "content": "And what evidence do you base those assumptions on? According to the journalists at electrek despite Tesla having capacity to manufacture 250k cybertrucks per year, they're only selling 20-25k per year",
          "created_at": 1767032341000,
          "content_cn": "你这些假设的依据是什么？据electrek的记者报道，尽管特斯拉每年有能力生产25万辆Cybertruck，但实际年销量仅为2万至2.5万辆。"
        },
        {
          "hn_comment_id": 46424118,
          "parent_id": 46424090,
          "author": "zitterbewegung",
          "content": "The Dojo team left tesla to do their own ASIC.\nhttps://www.theverge.com/news/756706/tesla-dojo-team-shut-do...",
          "created_at": 1767035070000,
          "content_cn": "Dojo团队离开特斯拉自主开发专用集成电路。"
        },
        {
          "hn_comment_id": 46424103,
          "parent_id": 46423509,
          "author": "epistasis",
          "content": "Only investor's share prices at risk, there's no risk to the future of electrification.Look at solar, an industry that has continual bankruptcies, yet is eating the world. New players grow, die, and get replaced all the time, in a continual churn of new technology.That Tesla would die a death was not inevitable, merely a choice due to recent years of extremely poor leadership and terrible mismanagment. Even now, Tesla may pull out of the slump and recover! It's doubtful it will ever justify its share price, but it's likely that if it ever gets fairly priced as a company, it could be sold to a US auto major that is regretting it's failure to produce EVs for the international market, and wants to try to catch up. Maybe. That time might have passed too...",
          "created_at": 1767034996000,
          "content_cn": "只有投资者的股价面临风险，电气化的未来并无风险。看看太阳能行业，尽管企业破产不断，却正在席卷全球。新参与者不断涌现、消亡、被取代，新技术持续更迭。特斯拉的衰败并非必然，只是近年来领导层极度无能和管理严重失误所致的选择。即便现在，特斯拉仍可能走出低谷、重振旗鼓！虽然其股价合理性存疑，但如果公司估值回归合理水平，或许会被某家美国汽车巨头收购——这些巨头正为未能为国际市场生产电动汽车而懊悔，并渴望迎头赶上。当然，这样的时机可能也已错过……"
        },
        {
          "hn_comment_id": 46423552,
          "parent_id": 46423509,
          "author": "rayiner",
          "content": "The market didn’t choose to bet on Tesla. It was the only game in town for years.",
          "created_at": 1767032409000,
          "content_cn": "市场并非选择押注特斯拉，而是多年来它是唯一的选择。"
        },
        {
          "hn_comment_id": 46424486,
          "parent_id": 46423945,
          "author": "qoez",
          "content": "The best counter argument to that is that he did manage to predict/make into reality electric vehicles (when going into that industry was crazy) and reusable rockets. If someone makes a thousand moonshot attempts but still succeeds with two that's impressive.",
          "created_at": 1767036739000,
          "content_cn": "对此最有力的反驳是，他确实成功预测并实现了电动汽车（当时进入这个行业简直是疯狂之举）和可重复使用火箭的构想。如果有人尝试了上千次看似遥不可及的创新，最终仍能成功实现其中两项，这本身就令人印象深刻。"
        },
        {
          "hn_comment_id": 46431270,
          "parent_id": 46423945,
          "author": "haritha-j",
          "content": "The only one that actually came true out of the long list was a 'prediction' he made about something happening in the same month.",
          "created_at": 1767086915000,
          "content_cn": "在那一长串预言中，唯一真正应验的是他关于某件事会在同一个月发生的“预测”。"
        },
        {
          "hn_comment_id": 46430765,
          "parent_id": 46423945,
          "author": "szszrk",
          "content": "Neat.It's a bummer though that it's limited to Telsa. Would love to see a fuller one of his all bold statements about robotics, tunnel transportation, space travel, and AI.",
          "created_at": 1767082325000,
          "content_cn": "简洁明了。可惜仅限于特斯拉。真希望能看到他关于机器人技术、隧道交通、太空旅行和人工智能等所有大胆主张的更完整版本。"
        },
        {
          "hn_comment_id": 46423956,
          "parent_id": 46423734,
          "author": "bdangubic",
          "content": "so like 2080 or thereabouts?",
          "created_at": 1767034230000,
          "content_cn": "大概是2080年左右？"
        },
        {
          "hn_comment_id": 46423932,
          "parent_id": 46423892,
          "author": "lossolo",
          "content": "Maybe \"cultists\" is a better word than fans, with Musk as their guru.",
          "created_at": 1767034106000,
          "content_cn": "或许用“狂热信徒”来形容马斯克的追随者比“粉丝”更贴切，而马斯克就是他们的精神导师。"
        },
        {
          "hn_comment_id": 46424089,
          "parent_id": 46423945,
          "author": "1121redblackgo",
          "content": "At what point is it fair to call the list something other than ‘predictions’",
          "created_at": 1767034946000,
          "content_cn": "什么时候才能公平地将这份清单称为“预测”之外的东西"
        },
        {
          "hn_comment_id": 46424529,
          "parent_id": 46423945,
          "author": "silisili",
          "content": "I had no idea this existed, that's pretty damning.The question - is Musk lying on purpose, or is this more 90-90 rule where he made (obviously wrong) assumptions based on current progress?",
          "created_at": 1767036933000,
          "content_cn": "我完全不知道这回事，这太糟糕了。问题是——马斯克是故意撒谎，还是这更像90-90法则，他根据当前进展做出了（明显错误的）假设？"
        },
        {
          "hn_comment_id": 46433774,
          "parent_id": 46430291,
          "author": "anthonybsd",
          "content": "Elektrek was one of the biggest Tesla cheerleaders until 2023 or so. Founder promoting neonazi and fascist ideas kinda made them sour on the brand, can you blame them?",
          "created_at": 1767105762000,
          "content_cn": "在2023年之前，Elektrek曾是特斯拉最狂热的支持者之一。但创始人宣扬新纳粹和法西斯思想的行为让他们对这个品牌产生了反感，这能怪他们吗？"
        },
        {
          "hn_comment_id": 46434338,
          "parent_id": 46430291,
          "author": "miltonlost",
          "content": "> X and YouTube is full of Tesla is the future vibe.X is owned by Musk and has their algorithm tuned to boost his posts. What makes you think he also isn't artificially boosting Tesla is the future vibe? X is a pure propaganda spigot right now.",
          "created_at": 1767109010000,
          "content_cn": "X和YouTube上充斥着特斯拉代表未来的氛围。X由马斯克所有，其算法被调整为推广他的帖子。你怎么知道他也没有人为地助推特斯拉代表未来的氛围呢？X现在纯粹是一个宣传工具。"
        },
        {
          "hn_comment_id": 46423716,
          "parent_id": 46423610,
          "author": "malshe",
          "content": "Americans? Elon Musk is one person. He might be the richest person in the world but he doesn't represent us.",
          "created_at": 1767033124000,
          "content_cn": "美国人？埃隆·马斯克只是一个人。他或许是世界上最富有的人，但他并不能代表我们。"
        },
        {
          "hn_comment_id": 46438451,
          "parent_id": 46425967,
          "author": "culi",
          "content": "What percent of your driving is on highways vs urban? Almost all car brands today have incredible ADAS systems for highway driving. When Consumer Reports compared ADAS systems in 2023 Tesla was ranked 8thhttps://www.consumerreports.org/-a2103632203/If almost all of your driving is on highways then you could probably rely on ADAS for 99% of your driving with almost any other car brand as well",
          "created_at": 1767131508000,
          "content_cn": "您的高速公路驾驶与城市驾驶各占多大比例？如今几乎所有汽车品牌都配备了出色的高速公路驾驶辅助系统。在《消费者报告》2023年对驾驶辅助系统的评测中，特斯拉仅排名第八位。如果您绝大部分时间都在高速公路上行驶，那么几乎任何其他汽车品牌的驾驶辅助系统也足以覆盖您99%的驾驶场景。"
        },
        {
          "hn_comment_id": 46423933,
          "parent_id": 46423610,
          "author": "dyauspitr",
          "content": "Being a Nazi is a huge red line",
          "created_at": 1767034119000,
          "content_cn": "成为纳粹分子是一条巨大的红线"
        },
        {
          "hn_comment_id": 46433418,
          "parent_id": 46431007,
          "author": "joshribakoff",
          "content": "This is purely anecdotal but at the local mall (Stonetown in SF) they are giving out free rides.To me, it looks desperate, and poorly executed. I was even waiting outside shake shack for my order, and the sales person approached me to offer me a test drive unsolicited. While I was waiting, I saw groups of people flicking them off and trolling them.The irony to me - they have paid me $250,000 back for vehicles under lemon law instead of acknowledging and fixing a safety issue in the software, instead labeling it from “bug” to “characteristic”.Now, they’re approaching me outside a shake shack begging me to accept a test drive, and i bet the issue is still not fixed. BMW driver assistance pro may be more limited but it is boring in the ways you want.I was really intent on supporting Tesla, but they refused to work with me when I repeatedly raised the safety issue. They just repeatedly returned the car and said it was an expected characteristic for the car to turn left when I’m turning the wheel right.I suspect they don’t wanna fix the false positive lane departure avoidance because they probably know they would be even more cases of accidental FSD engagement that do result in a collision where it needs to kick in. At the time I was reporting the issue they did not disclose the hidden disabled lane departure state, either.",
          "created_at": 1767103497000,
          "content_cn": "这纯属个人见闻，但在本地商场（旧金山石镇）他们正在提供免费试驾。在我看来，这显得很绝望，且执行得很糟糕。我甚至在Shake Shack外面等餐时，销售人员主动凑过来推销试驾。等待期间，我看到成群的人对他们嗤之以鼻、故意戏弄。讽刺的是——根据柠檬法，他们曾退还我25万美元车辆赔款，却不愿承认并修复软件中的安全隐患，反而将问题从“故障”重新定义为“车辆特性”。如今，他们竟在Shake Shack门外近乎哀求地让我接受试驾，我敢打赌那个问题压根没解决。宝马的驾驶辅助系统或许功能更有限，但至少在你需要的时候稳定可靠。我原本真心想支持特斯拉，可当我多次提出安全问题时他们拒绝配合。他们只是一次次归还车辆，并坚称方向盘右转时车辆左偏是正常特性。我怀疑他们不愿修复误报的车道偏离预警，大概是因为他们心知肚明：若修正这个问题，可能会暴露出更多因意外启动全自动驾驶而导致碰撞的案例——而系统本应在此类情况下及时介入。当初我反馈问题时，他们也从未披露过隐藏的车道偏离辅助关闭状态。"
        },
        {
          "hn_comment_id": 46423766,
          "parent_id": 46423610,
          "author": "anderber",
          "content": "I think you're underselling what Trump and Musk has done to the stability of Democracy in the US. Aside from all that, there are other American car manufacturers with great EVs: Mustang Mach-E, Chevy Equinox/Bolt/Blazer, etc. Not saying that BYD isn't better, but comparing to Tesla, there is plenty of US competition.",
          "created_at": 1767033391000,
          "content_cn": "我认为你低估了特朗普和马斯克对美国民主稳定性造成的影响。除此之外，美国还有其他优秀的电动汽车制造商：比如野马Mach-E、雪佛兰Equinox/Bolt/Blazer等。并不是说比亚迪不够好，但相比特斯拉，美国本土的竞争其实相当激烈。"
        },
        {
          "hn_comment_id": 46423534,
          "parent_id": 46423509,
          "author": "tartuffe78",
          "content": "The future looks Chinese.",
          "created_at": 1767032332000,
          "content_cn": "未来属于中国。"
        },
        {
          "hn_comment_id": 46437316,
          "parent_id": 46431007,
          "author": "elif",
          "content": "No one is within a decade of Tesla.There are no other vehicles that can take you as easily to the grocery store as they can across the country.Buying another brand for me at this point would be like picking up a part time job as a driver. No thank you lol. FSD is all the mote that they need.",
          "created_at": 1767124778000,
          "content_cn": "十年内无人能及特斯拉。没有其他车辆能像它一样，既能轻松载你去杂货店购物，又能带你横穿全国。现阶段选择其他品牌对我来说，就像找了一份兼职司机的工作。不了，谢谢。全自动驾驶系统才是他们真正需要的。"
        },
        {
          "hn_comment_id": 46434247,
          "parent_id": 46431007,
          "author": "steeve",
          "content": "Yes but have you heard of the Somali daycare in Minnesota? Also, something something great replacement.",
          "created_at": 1767108564000,
          "content_cn": "是的，但你知道明尼苏达州的索马里日托中心吗？还有那个什么大替代理论。"
        },
        {
          "hn_comment_id": 46425083,
          "parent_id": 46424138,
          "author": "onraglanroad",
          "content": "The country that chose the one person?",
          "created_at": 1767039551000,
          "content_cn": "那个选择了一个人的国家？"
        },
        {
          "hn_comment_id": 46424183,
          "parent_id": 46424138,
          "author": "epistasis",
          "content": "There's both collective blame for the US, and also individual blame for the idiocy of Musk. No choice necessary.",
          "created_at": 1767035415000,
          "content_cn": "这既是对美国的集体指责，也是对马斯克个人愚蠢行为的单独指责。无需做出选择。"
        },
        {
          "hn_comment_id": 46430105,
          "parent_id": 46424070,
          "author": "DustinBrett",
          "content": "The only fact was about the contract which is like a sentence of the article. Then it goes into a guessing game on what it could mean, with the most negative spin possible.",
          "created_at": 1767075045000,
          "content_cn": "唯一确凿的事实是关于合同的部分，这就像是文章中的一句话。随后便陷入了一场对其可能含义的猜测游戏，且尽可能地从最负面的角度进行解读。"
        },
        {
          "hn_comment_id": 46423798,
          "parent_id": 46423538,
          "author": "SonOfKyuss",
          "content": "I actually get a kick out of Eletrek’s roasting of Elon and Tesla, but if you read a few of their articles, it’s clear they don’t like him. Lots of opinions and editorializing in the articles. I have no problem with that, you just have to realize where they are coming from and base your interpretation accordingly",
          "created_at": 1767033537000,
          "content_cn": "我其实挺喜欢看Eletrek对埃隆和特斯拉的犀利批评，但如果你读过他们的几篇文章，就会发现他们显然不喜欢他。文章里充满了各种观点和主观评论。我对此没有意见，只是你得明白他们的立场，并据此来理解文章内容。"
        },
        {
          "hn_comment_id": 46424001,
          "parent_id": 46423563,
          "author": "cmrdporcupine",
          "content": "The \"theft\" they are really worried about is the loss of oil industry profits.That's who is sock-puppeting all these misanthropes.US capitalism was fine with a few wealthy people driving around some novelty luxury cars with EV motors in them. China turned it into an actual mass market product.",
          "created_at": 1767034512000,
          "content_cn": "他们真正担心的\"盗窃\"是石油行业利润的流失。正是这些利益集团在背后操纵着所有反人类的言论。美国资本主义原本只满足于少数富人开着装有电动马达的新奇豪华车兜风。而中国却将其变成了真正的大众市场产品。"
        },
        {
          "hn_comment_id": 46438497,
          "parent_id": 46435126,
          "author": "fragmede",
          "content": "Other than yelling at people, how are you getting drunk drivers off the road? Even though it's not perfect this shit works better than those assholes. Don't let perfect be the enemy of the good. Unless you're volunteering to drive Uber for free for everybody everywhere, telling people to just be more responsible hasn't worked in the whole history of humanity.",
          "created_at": 1767131803000,
          "content_cn": "除了对人吼叫之外，你们还有什么办法让酒驾者远离道路？尽管不完美，但这东西总比那些混蛋强。别让完美成为优秀的敌人。除非你愿意免费为所有人提供随叫随到的接送服务，否则光靠告诫人们要更负责任，这在人类历史上从未奏效过。"
        },
        {
          "hn_comment_id": 46435937,
          "parent_id": 46435126,
          "author": "AppleBananaPie",
          "content": "I stopped at \"this reads like ChatGPT\" but maybe I'm old and cynical :/Agree with your take 100%.",
          "created_at": 1767117070000,
          "content_cn": "看到“这读起来像ChatGPT写的”我就没往下看了，可能是我年纪大了爱挑刺吧：/完全同意你的看法。"
        },
        {
          "hn_comment_id": 46432063,
          "parent_id": 46431007,
          "author": "mft_",
          "content": "I' m not defending Tesla for a moment, but I disagree with your take...1) Wasn't it always inevitable that, once tha large established car manufacturers really started to knuckle down to creating EVs, that Tesla's lead and 'moat' would mostly vanish?  They still have some of the most efficient EVs available, and their UI/UX is still one of the best, but of course they'll face compeition, and of course their competitors will try to differentiate in all directions, and especially those that are superficially attractive (and less expensive to deliver) like interior design.2) Back in his earlier, pre-crazy days, Musk suggested (something along the lines of) that Tesla's goal wasn't to be a huge successful car company, so much as to prove that EVs were viable as everyday cars, and drive a revolution in the car industry.  By this measure, they've mostly succeeded.---Big picture, totally agree that Tesla seems to have lost its way over the past few years, which unsurprisingly correlates (to an outside observer) with Musk's apparent changes in judgement and behaviour, with its consequent impact on Tesla's image and desirability amongst consumers.  The Cybertruck turns out to have been a huge misstep, and not having delivered a 'model 2' - i.e. a small mid-sized option - (maybe instead?) is a huge miss.",
          "created_at": 1767093242000,
          "content_cn": "我并非要为特斯拉辩护，但不同意你的观点……1）一旦大型传统汽车制造商真正开始全力投入电动汽车制造，特斯拉的领先地位和“护城河”大部分消失难道不是必然的吗？他们仍拥有部分最高效的电动汽车，用户界面体验也依然位居前列，但竞争本就不可避免，竞争对手自然会在各方面寻求差异化，尤其是那些表面吸引力强（且实现成本更低）的领域，比如内饰设计。2）早在马斯克尚未陷入疯狂的那些年，他曾提出（大致意思是）特斯拉的目标并非成为一家庞大的成功车企，而是要证明电动汽车能够作为日常用车，并推动汽车行业变革。从这个标准看，他们已基本成功了。\n\n宏观来看，我完全同意特斯拉过去几年似乎迷失了方向——在外界观察者看来，这显然与马斯克判断力和行为的显著变化相关，进而影响了特斯拉的品牌形象和消费者青睐度。Cybertruck已被证明是重大战略失误，而未能推出“Model 2”这类中小型车型（或许本应优先开发？）更是巨大的市场缺位。"
        },
        {
          "hn_comment_id": 46423721,
          "parent_id": 46423538,
          "author": "mxschumacher",
          "content": "and SpaceX has been a major buyer of Cybertrucks",
          "created_at": 1767033158000,
          "content_cn": "SpaceX一直是Cybertruck的主要买家。"
        },
        {
          "hn_comment_id": 46436433,
          "parent_id": 46433774,
          "author": "sidibe",
          "content": "I think that's probably the main reason but also Fred Lambert \"earned\" a free roadster through referrals gassing up Elon and Tesla and as always with Elons promises it has not materialized.",
          "created_at": 1767119925000,
          "content_cn": "我认为这可能是主要原因，但弗雷德·兰伯特也通过推荐为埃隆和特斯拉造势而\"赢得\"了一辆免费跑车，然而和埃隆的承诺一样，这并未兑现。"
        },
        {
          "hn_comment_id": 46435520,
          "parent_id": 46432934,
          "author": "formerly_proven",
          "content": "> I can't think of another car brand that makes its own silicon, ships OTA updates weekly, runs an in-house OS that isn't an outdated Android skin, and tightly integrates media, navigation, charging, and energy management all in the same platform.VW (ID software 3/4/5), Mercedes (MBUX).They don't update weekly (I don't think so, anyway), but I don't see how that would be inherently positive. They should be able to update weekly (e.g. security patches), sure, but car software should probably not be changing week-to-week for years on end.That being said, since the US is basically a captive and stagnating market for EVs now, it seems most models from European makers are not available in the US anyway.",
          "created_at": 1767115083000,
          "content_cn": "我想不出还有哪个汽车品牌能自己制造芯片、每周推送OTA更新、运行非过时安卓套壳的自研操作系统，并将媒体、导航、充电和能源管理紧密整合在同一平台上。大众（ID软件3/4/5）和奔驰（MBUX）虽然不每周更新（至少我认为没有），但我不认为这本身是优点。它们当然应该具备每周更新的能力（比如安全补丁），但汽车软件或许不该长年累月地每周变动。话说回来，由于美国目前基本是一个封闭且停滞的电动汽车市场，欧洲制造商的多数车型反正也不在美国销售。"
        },
        {
          "hn_comment_id": 46424520,
          "parent_id": 46423766,
          "author": "csa",
          "content": "> Aside from all that, there are other American car manufacturers with great EVs: Mustang Mach-E, Chevy Equinox/Bolt/Blazer, etc.Teslas aren’t perfect, and they are definitely starting to get a bit dated, but the list you made has precisely zero “great EVs” imho.",
          "created_at": 1767036870000,
          "content_cn": "除此之外，还有其他美国汽车制造商生产出色的电动汽车：野马Mach-E、雪佛兰Equinox/Bolt/Blazer等。特斯拉并非完美，而且它们的设计确实开始显得有些过时，但在我看来，你列出的清单里完全没有所谓的“优秀电动汽车”。"
        },
        {
          "hn_comment_id": 46423919,
          "parent_id": 46423534,
          "author": "dyauspitr",
          "content": "And electric",
          "created_at": 1767034069000,
          "content_cn": "而且是电动的"
        },
        {
          "hn_comment_id": 46424085,
          "parent_id": 46423534,
          "author": "mindslight",
          "content": "Trump is going to be lauded in the history books for sure. The Chinese history books, that is. Before this massive self-own, we at least had a chance.",
          "created_at": 1767034891000,
          "content_cn": "特朗普肯定会被载入史册。当然，是中国历史教科书。在这次重大自我毁灭之前，我们至少还有机会。"
        },
        {
          "hn_comment_id": 46435935,
          "parent_id": 46423534,
          "author": "misiti3780",
          "content": "China's future looks very grim.China has all sorts of demographic and debt problems no one is talking about:https://open.substack.com/pub/crosscurrents28/p/chinas-broke...",
          "created_at": 1767117063000,
          "content_cn": "中国的未来看起来非常黯淡。中国存在各种人口和债务问题，却无人提及：https://open.substack.com/pub/crosscurrents28/p/chinas-broke..."
        },
        {
          "hn_comment_id": 46438068,
          "parent_id": 46437316,
          "author": "GeorgeTirebiter",
          "content": "I can't tell if you're joking or serious.  I recently rented a tesla on a vacation back east, and the nightmare that is charging cannot be erased.   And FSD of course does not work (yet... they've been at it for 10+ years, maybe someday, who knows?).  My rented 2025 MY with full self driving could barely keep itself between 2 white-painted lines!I assume this post is a troll, 'no one is within a decade of Tesla' -- are you serious ?   Have a look at Rivian, which is preparing to make the Cybertruck even more of a laughing stock.",
          "created_at": 1767129239000,
          "content_cn": "我分不清你是在开玩笑还是认真的。最近我在东部度假时租了一辆特斯拉，充电的噩梦简直难以抹去。当然，全自动驾驶功能也完全不行（毕竟他们搞了十多年，也许有一天能成？谁知道呢）。我租的这辆2025年款Model Y号称具备全自动驾驶，却连两条白线之间的车道都保持不好！我猜这帖子是来钓鱼的吧，“十年内没人能追上特斯拉”——你是认真的吗？看看Rivian吧，他们正准备让Cybertruck更加沦为笑柄。"
        },
        {
          "hn_comment_id": 46437183,
          "parent_id": 46432063,
          "author": "Alconicon",
          "content": "I would argue that Tesla didn't lose its way, it used it way to get were they are and now you see the deficits of it.They started without all the legacy and worries. Like existing suppliers, existing things, existing image. Fresh market, modern software development etc. brought them a proper market share.Now the olds had to update themselves, which they did and now they are stuck with tesla.But thats it. Tesla doesn't has that much innovation. Plenty of things did not materialize at all.",
          "created_at": 1767124096000,
          "content_cn": "我认为特斯拉并没有迷失方向，它正是凭借自身的方式才达到今天的地位，而现在人们看到了这种方式带来的不足。他们起步时没有历史包袱和顾虑，比如现成的供应商、既有的事物和固有形象。新兴市场、现代软件开发等让他们占据了可观的市场份额。如今传统车企不得不自我革新，它们确实这样做了，但现在却被特斯拉牵制。但仅此而已。特斯拉的创新其实有限，许多承诺都未能兑现。"
        },
        {
          "hn_comment_id": 46433220,
          "parent_id": 46432063,
          "author": "trollbridge",
          "content": "Advantage for Tesla is that the rest of the auto industry has lost their way, too. For example, the infotainment in a brand new, expensive vehicle like a new GM is atrociously bad, unreliable, and slow/clunky to use.",
          "created_at": 1767101953000,
          "content_cn": "特斯拉的优势在于，整个汽车行业的其他公司也迷失了方向。例如，像通用汽车新款这样的昂贵新车，其信息娱乐系统糟糕透顶，不可靠，使用起来缓慢且笨拙。"
        }
      ]
    },
    {
      "hn_id": 46427586,
      "title": "Stranger Things creator says turn off “garbage” settings",
      "url": "https://screenrant.com/stranger-things-creator-turn-off-settings-premiere/",
      "content": null,
      "points": 416,
      "comment_count": 736,
      "author": "1970-01-01",
      "created_at": 1767052234000,
      "title_cn": "《怪奇物语》创作者建议关闭“垃圾”设置",
      "content_cn": null,
      "abstract": "该讨论围绕电视图像设置对影视内容创作者意图的影响展开。核心争议在于电视厂商默认开启的图像增强功能（如动态平滑、鲜艳模式）是否破坏了作品原貌。有人认为这些功能通过不透明的命名和模糊描述误导用户，导致非专业观众难以关闭；也有用户指出“电影制作人模式”是行业解决尝试，但对其可信度存疑，担心厂商会为竞争而篡改该模式。讨论中提到，部分用户选择手动关闭所有增强功能以保持内容原貌，而另一些用户则认为画面设置不会改变故事本质。普遍共识是电视厂商应提供更清晰的功能说明和标准化命名。分歧点在于是否应依赖行业标准模式，以及高帧率拍摄能否从根本上解决动态插值问题。",
      "comments": [
        {
          "hn_comment_id": 46431084,
          "parent_id": null,
          "author": "omnicognate",
          "content": "It would help if TV manufacturers would clearly document what these features do, and use consistent names that reflect that.It seems they want to make these settings usable without specialist knowledge, but the end result of their opaque naming and vague descriptions is that anybody who actually cares about what they see and thinks they might benefit from some of the features has to either systematically try every possible combination of options or teach themselves video engineering and try to figure out for themselves what each one actually does.This isn't unique to TVs. It's amazing really how much effort a company will put into adding a feature to a product only to completely negate any value it might have by assuming any attempt at clearly documenting it, even if buried deep in a manual, will cause their customers' brains to explode.",
          "created_at": 1767085121000,
          "content_cn": "如果电视制造商能清晰记录这些功能的具体作用，并采用统一准确的命名会更有帮助。他们似乎希望这些设置无需专业知识即可操作，但由于名称晦涩、描述模糊，最终导致任何真正在意画质、并认为某些功能可能有益的用户，要么不得不系统尝试所有选项组合，要么自学视频工程技术来逐一摸索实际功能。这种现象并非电视独有。令人惊讶的是，企业投入大量精力为产品添加新功能，却因担心清晰说明（哪怕深藏说明书）会导致用户难以理解，反而完全抹杀了功能本可带来的价值。"
        },
        {
          "hn_comment_id": 46434005,
          "parent_id": 46431084,
          "author": "robhlt",
          "content": "\"Filmmaker mode\" is the industry's attempt at this. On supported TVs it's just another picture mode (like vivid or standard), but it disables all the junk the other modes have enabled by default without wading though all the individual settings. I don't know how widely adopted it is though, but my LG OLED from 2020 has it.",
          "created_at": 1767107205000,
          "content_cn": "\"电影制作人模式\"是行业对此的尝试。在支持的电视上，它只是另一种图像模式（如鲜艳或标准模式），但无需逐一调整所有单独设置，就能默认关闭其他模式开启的所有冗余功能。不过我不清楚它的普及程度如何，但我2020年购买的LG OLED电视确实具备这一模式。"
        },
        {
          "hn_comment_id": 46434773,
          "parent_id": 46434005,
          "author": "burnte",
          "content": "The problem with filmmaker mode is I don't trust it more than other modes. It would take no effort at all for a TV maker to start fiddling whit \"filmmaker mode\" to boost colors or something to \"get an edge\", then everyone does it, and we're back to where we started. I just turn them off and leave it that way. Companies have already proven time and again they'll make changes we don't like just because they can, so it's important to take every opportunity to prevent them even getting a chance.",
          "created_at": 1767111232000,
          "content_cn": "电影制作人模式的问题在于，我并不比其他模式更信任它。电视制造商完全可以轻易开始调整“电影制作人模式”，通过提升色彩或其他手段来“获得优势”，一旦大家都这样做，我们就又回到了原点。我干脆直接关闭这些模式并保持关闭。企业已经一再证明，仅仅因为他们有能力，就会做出我们不喜欢的改变，因此抓住每个机会阻止他们得逞至关重要。"
        },
        {
          "hn_comment_id": 46428205,
          "parent_id": null,
          "author": "kevinlearynet",
          "content": "All the settings in the world won't change the story.",
          "created_at": 1767056385000,
          "content_cn": "世间万般设定，难改故事本真。"
        },
        {
          "hn_comment_id": 46432349,
          "parent_id": null,
          "author": "MarkusWandel",
          "content": "My main computer monitor, ancient now (a Dell U2711), was a calibrated SRGB display when new and still gives very good colour rendition.Are movies produced in this colour space?  No idea.  But they all look great in SRGB.A work colleague got himself a 40\" HD TV as a big computer monitor.  This is a few years ago.  I was shocked at the overamped colour and contrast.  Went through all the settings and with everything turned to minimum - every colour saturation slider, everything that could be found - it was almost realistic but still garish compared to SRGB.But that's what people want, right?  Overamped everything is how those demo loops at Costco are set up, that's what sells, that's what people want in their living rooms, right?",
          "created_at": 1767095222000,
          "content_cn": "我的主显示器如今已算古董（戴尔U2711），出厂时是经过校色的sRGB屏幕，现在色彩表现依然出色。电影是用这种色彩空间制作的吗？不清楚。但它们在sRGB模式下看起来都很棒。有位同事几年前买了台40英寸高清电视当电脑显示器用，我当时被那过度饱和的色彩和对比度震惊了。调遍了所有设置——把每个色彩饱和度滑块、能找到的所有选项都调到最低——虽然接近真实了，但比起sRGB还是显得艳俗。不过这不正是人们想要的吗？好市多里演示片那种过度渲染的效果，才是吸引顾客的卖点，才是大家想在客厅里看到的，对吧？"
        },
        {
          "hn_comment_id": 46430272,
          "parent_id": null,
          "author": "eviks",
          "content": "Are there any creators that evolved and shoot at high frame rates that eliminate the need for motion interpolation and its artifacts or is the grip of the bad old film culture still too strong? (there are at least some 48fps films)",
          "created_at": 1767077111000,
          "content_cn": "是否有创作者已经发展到采用高帧率拍摄，从而无需运动插补及其带来的瑕疵，还是糟糕的旧电影文化影响依然过于强大？（至少已有一些48帧率的电影）"
        },
        {
          "hn_comment_id": 46434036,
          "parent_id": null,
          "author": "randerson",
          "content": "I'd pay good money for a dumb 4K OLED TV that does nothing but show whatever is coming in through the HDMI port.I use a Playstation 5 for everything including Netflix, Apple TV and so on. But every time I turn on the PS5, my TV detects the Playstation and automatically changes the TV's Sound and Video modes to \"Gaming\", which makes dialog difficult to hear on TV. So I change the setting manually using its horrible remote control, only for it to change back to Gaming the next time I use it.",
          "created_at": 1767107378000,
          "content_cn": "我愿意花大价钱买一台纯粹的4K OLED电视，它只需显示HDMI端口输入的内容即可。我用Playstation 5处理所有事务，包括观看Netflix和Apple TV等。但每次打开PS5，电视就会检测到游戏机并自动将音视频模式切换为“游戏模式”，这导致电视对话难以听清。于是我不得不使用那糟糕的遥控器手动调整设置，结果下次使用时它又自动切回了游戏模式。"
        },
        {
          "hn_comment_id": 46435171,
          "parent_id": null,
          "author": "mat0",
          "content": "I don’t follow Stranger Things, so I cannot speak about the quality of the show, but I clicked on the link to see which settings the guy was talking about and I was surprised about how awful the CGI of that shot looks like. It’s hideous. Looks worse than 10 year old video games. What is that about? Am I going crazy?",
          "created_at": 1767113439000,
          "content_cn": "我没看过《怪奇物语》，所以没法评价这部剧的质量，但我点开链接想看看这家伙说的场景设置是什么，结果被那个镜头的CGI效果震惊了——简直糟糕透顶。丑得离谱，看起来比十年前的电子游戏画面还差。这到底是怎么回事？是我眼花了吗？"
        },
        {
          "hn_comment_id": 46430293,
          "parent_id": null,
          "author": "bob1029",
          "content": "> Whatever you do, do not switch anything on ‘vivid’ because it’s gonna turn on all the worst offenders. It’s gonna destroy the color, and it’s not the filmmaker’s intent.To be fair, \"vivid\" mode on my old Panasonic plasma was actually an impressive option compared to how an LCD would typically implement it. It didn't change the color profile. It mostly changed how much wattage the panel was allowed to consume. Upward of 800w IIRC. I called it \"light cannon\" mode. In a dark room, it makes black levels look like they have their own gravitational field despite being fairly bright in absolute terms.",
          "created_at": 1767077357000,
          "content_cn": "无论你做什么，千万别把任何设置调到“鲜艳”模式，因为这会开启所有最糟糕的功能。它会毁掉色彩，而且这并非电影制作人的本意。公平地说，我旧款松下等离子电视的“鲜艳”模式相比液晶电视通常的实现方式，其实是个令人印象深刻的选项。它不会改变色彩配置，主要是调整面板允许消耗的功率——我记得最高能到800瓦以上。我称之为“光炮”模式。在暗室里，尽管绝对亮度相当高，它却能让黑色层次看起来仿佛拥有自己的引力场。"
        },
        {
          "hn_comment_id": 46430425,
          "parent_id": null,
          "author": "beloch",
          "content": "\"Duffer’s advice highlights a conflict between technological advances and creators' goals. Features like the ones he mentioned are designed to appeal to casual viewers by making images appear sharper or more colorful, but they alter the original look of the content.\"------------------------Settings that make the image look less like how the material is supposed to look are not \"advances\".Q: So why do manufacturers create them?A: They sell TV's.Assume that every manufacturer out there is equally capable of creating a screen that faithfully reproduces the content to the best ability of current technology.  If every manufacturer does just that, then their screens will all look extremely similar.If your TV looks like everybody else's, how do you get people strolling through an electronics store to say, \"Wow!  I want that one!\"?  You add gimmicky settings that make the image look super saturated, bizarrely smooth, free of grain etc..  Settings that make the image look less like the source, but which grab eyes in a store.  You make those settings the default too, so that people don't feel ripped off when they take the TV out of the store.If you take a typical TV set home and don't change the settings from default, you're typically not going to see a very faithful reproduction of the director's vision.  You're seeing what somebody thought would make that screen sell well in a store. If you go to the trouble of setting your screen up properly, your initial reaction may be that it looks worse.  However, once you get used to it, you'll probably find the resulting image to be more natural, more enjoyable, and easier on the eyes.",
          "created_at": 1767078824000,
          "content_cn": "达弗的建议凸显了技术进步与创作者意图之间的冲突。他所提及的那些功能旨在通过让画面显得更锐利或色彩更鲜艳来吸引普通观众，但这些功能改变了内容的原始面貌。\n\n那些让画面看起来与素材应有样貌相去甚远的设置并非\"进步\"。\n\n问：那制造商为何要创造这些功能？\n答：为了卖电视。\n\n假设所有制造商都有能力在现有技术条件下打造出能忠实还原内容的屏幕。如果每家制造商都只这么做，那么他们的屏幕看起来会极其相似。\n\n如果你的电视看起来和别人家的没什么两样，你如何让逛电器商店的顾客惊叹：\"哇！我就要这台！\"？你会添加一些花哨的设置，让画面看起来色彩超级饱和、异常平滑、毫无颗粒感等等。这些设置虽然让画面偏离片源本质，却能在商店里吸引眼球。你还会把这些设置设为默认选项，这样人们把电视买回家时才不会觉得上当受骗。\n\n如果你把一台普通电视带回家，且不更改默认设置，通常你将无法看到对导演创作意图的忠实还原。你看到的只是某些人认为能让这台电视在商店里畅销的效果。如果你不嫌麻烦地正确设置屏幕，最初的反应可能会觉得它看起来……"
        },
        {
          "hn_comment_id": 46430852,
          "parent_id": 46430272,
          "author": "eterevsky",
          "content": "James Cameron is one of the few who do this.",
          "created_at": 1767083113000,
          "content_cn": "詹姆斯·卡梅隆是少数能做到这一点的人之一。"
        },
        {
          "hn_comment_id": 46431351,
          "parent_id": 46431084,
          "author": "nevon",
          "content": "I'm sure part of it is so that marketing can say that their TV has new putz-tech smooth vibes AI 2.0, but honestly I also see this same thing happen with products aimed at technical people who would benefit from actually knowing what a particular feature or setting really is. Even in my own work on tools aimed at developers, non-technical stakeholders push really hard to dumb down and hide what things really are, believing that makes the tools easier to use, when really it just makes it more confusing for the users.",
          "created_at": 1767087654000,
          "content_cn": "我确信部分原因是为了让营销部门能宣传他们的电视拥有全新的“傻瓜科技”顺滑AI 2.0体验，但说实话，我也看到同样的情况发生在面向技术人群的产品上——这些人本应真正了解某个功能或设置的实质。即使在我自己为开发者设计的工具工作中，非技术背景的利益相关者也极力要求简化并隐藏事物的本质，他们相信这样能让工具更易用，但实际上只会让用户更加困惑。"
        },
        {
          "hn_comment_id": 46428235,
          "parent_id": 46428205,
          "author": "epistasis",
          "content": "Careful what you wish for, or we might get AI-powered \"Vibrant Story\" filters that reduce 62 minutes of plot-less filler to a 5 minute summary of the only relevant points. Or that try to generate some logic to make the magic in the story make narrative sense.",
          "created_at": 1767056652000,
          "content_cn": "小心你的愿望，否则我们可能会得到人工智能驱动的“生动故事”滤镜，将62分钟毫无情节的填充内容缩减为仅5分钟的相关要点总结。或者它会试图生成某种逻辑，让故事中的魔法在叙事上显得合理。"
        },
        {
          "hn_comment_id": 46430388,
          "parent_id": 46430272,
          "author": "DoctorWhoof",
          "content": "Most of the issues (like \"judder\") that people have with 24fps are due to viewing it on 60 fps screens, which will sometimes double a frame, sometimes triple it, creating uneven motion. Viewing a well shot film with perfect, expressive motion blur on a proper film screen is surprisingly smooth.The \"soap opera\" feel is NOT from bad interpolation that can somehow be done right. It's inherent from the high frame rate. It has nothing to do with \"video cameras\", and a lot to do with being simply too real, like watching a scene through a window. There's no magic in it.Films are more like dreams than like real life. That frame rate is essential to them, and its choice, driven by technical constraints of the time when films added sound, was one of happiest accidents in the history of Arts.",
          "created_at": 1767078478000,
          "content_cn": "人们对24帧率的大部分问题（如\"卡顿感\"）源于在60帧屏幕上观看时，系统会时而重复两帧、时而重复三帧，导致运动不连贯。在专业电影屏幕上观看一部精心拍摄、带有完美表现力动态模糊的影片时，其流畅度反而令人惊讶。所谓的\"肥皂剧效果\"并非源于某种可以修正的糟糕插帧技术，而是高帧率与生俱来的特性。这与\"摄像机类型\"无关，更多是因为画面过于真实，犹如透过窗户观看实景，并无神奇之处。电影更像梦境而非现实生活。24帧率对电影至关重要，这个因有声电影时代技术限制而偶然确立的标准，堪称艺术史上最美丽的意外之一。"
        },
        {
          "hn_comment_id": 46433346,
          "parent_id": 46432349,
          "author": "callc",
          "content": "> But that's what people want, right? Overamped everything is how those demo loops at Costco are set up, that's what sells, that's what people want in their living rooms, right?I just want accurate colors to the artists intent, and a brightness nob. No other image “enhancement” features",
          "created_at": 1767102891000,
          "content_cn": "但人们要的不就是这个吗？就像好市多演示循环里那样，把所有参数都调得夸张——这样才能卖出去，这才是人们想在客厅里看到的，对吧？我只想要准确还原艺术家意图的色彩，再加个亮度调节钮。其他任何图像“增强”功能都不需要。"
        },
        {
          "hn_comment_id": 46432358,
          "parent_id": 46431084,
          "author": "TeMPOraL",
          "content": "> It would help if TV manufacturers would clearly document what these features do, and use consistent names that reflect that.It would also help if there was a common, universal, perfect \"reference TV\" to aim for (or multiple such references for different use cases), with the job of the TV being to approximate this reference as closely as possible.Alas, much like documenting the features, this would turn TVs into commodities, which is what consumers want, but TV vendors very much don't.",
          "created_at": 1767095330000,
          "content_cn": "如果电视制造商能清晰记录这些功能的作用，并使用反映功能的一致命名，将会很有帮助。如果有一个通用、完美、可供参考的“标准电视”作为目标（或针对不同使用场景的多个参考标准），让电视的工作是尽可能接近这个参考标准，也会很有帮助。可惜，就像记录功能一样，这会让电视变成普通商品，这是消费者想要的，但电视厂商却非常不愿意。"
        },
        {
          "hn_comment_id": 46435658,
          "parent_id": 46434036,
          "author": "pwdisswordfishy",
          "content": "Isn't the \"Gaming\" setting doing exactly that (giving you \"whatever is coming in through the HDMI port\")?What you describe about it being hard to hear dialog is exactly what I'd expect from someone who has their TV turned down as a result of using the score/soundtrack and loud sound effects as a reference point, which consequently is too low a volume to hear the dialog.I wouldn't be surprised if you're actually experiencing what your TV's processing turned off is like and sound balancing is actually what you (as in you, personally) _want_ it to be doing.",
          "created_at": 1767115663000,
          "content_cn": "\"游戏\"模式不正是这样运作的吗（直接输出HDMI端口的原始信号）？您描述的对话听不清的情况，完全符合以配乐/音效为音量基准导致电视音量过低的结果。您很可能正在体验关闭电视音效处理后的真实状态，而声音平衡效果或许正是您个人所期望的。"
        },
        {
          "hn_comment_id": 46435299,
          "parent_id": 46435171,
          "author": "MadameMinty",
          "content": "I see it. Overworked special effects artists, I suppose. It's funny how well some movie CGI from the 90s holds up in comparison.",
          "created_at": 1767114088000,
          "content_cn": "我明白了。大概是特效师们工作过度了吧。有趣的是，相比之下，90年代的一些电影CGI效果至今依然出色。"
        },
        {
          "hn_comment_id": 46428248,
          "parent_id": null,
          "author": "minimaxir",
          "content": "Game of Thrones Season 8 was lambasted for having an episode that was mostly in darkness...in 2019.You'd think television production would be calibrated for the median watcher's TV settings by now.",
          "created_at": 1767056754000,
          "content_cn": "《权力的游戏》第八季曾因一集画面过于昏暗而广受批评……那是在2019年。人们本以为电视制作到现在应该已经根据普通观众的电视设置进行校准了。"
        },
        {
          "hn_comment_id": 46430333,
          "parent_id": null,
          "author": "larusso",
          "content": "I setup my TV (LG OLED CX) with filmmaker mode in all relevant places and turned off a lot of nubs based on HDTVs [1] recommendations. LG has definitely better ways of tuning the picture just right than my old Samsung had. For this TV I had to manual calibrate the settings.The interesting thing when turning on filmmaker mode is the feeling of too warm and dark colors. It will go away when the eyes get used to it. But it then lets the image pop when it’s meant to pop etc. \nI also turned off this auto brightness [2] feature that is supposed to guard the panel from burn it but just fails in prolonged dark scenes like in Netflix Ozark.[1] https://youtu.be/uGFt746TJu0?si=iCOVk3_3FCUAX-ye\n[2] https://youtu.be/E5qXj-vpX5Q?si=HkGXFQPyo6aN7T72",
          "created_at": 1767077703000,
          "content_cn": "我按照HDTV[1]的建议，在LG OLED CX电视的所有相关设置中启用了电影制作人模式，并关闭了许多不必要的功能。相比旧款三星电视，LG在画面调校方面确实有更出色的方法。这款电视需要进行手动校准设置。开启电影制作人模式时有趣的一点是，画面会显得色调偏暖偏暗，但随着眼睛逐渐适应，这种感觉会消失。之后画面该亮的地方自然会亮起来，效果很突出。\n我还关闭了自动亮度[2]功能，这个功能本意是防止屏幕烧屏，但在观看类似《黑钱胜地》这类长时间暗场场景时效果并不理想。"
        },
        {
          "hn_comment_id": 46429193,
          "parent_id": null,
          "author": "freitasm",
          "content": "If only the directors didn't make everything so dark and hard to see. Also stopped messing with sound, making it impossible to hear dialogues.",
          "created_at": 1767065155000,
          "content_cn": "要是导演们别把画面弄得那么暗、让人看不清就好了。还有别再捣鼓声音，搞得对白都听不清。"
        },
        {
          "hn_comment_id": 46431445,
          "parent_id": null,
          "author": "pelorat",
          "content": "If your TV supports a \"gaming\" mode, I always recommend enabling that, because it usually turns off all the \"enhancements\".TV's should not try to be anything more than a large monitor.",
          "created_at": 1767088521000,
          "content_cn": "如果你的电视支持“游戏”模式，我建议总是开启它，因为这通常会关闭所有“增强”功能。电视不应该试图成为比大型显示器更多的东西。"
        },
        {
          "hn_comment_id": 46429977,
          "parent_id": null,
          "author": "nwellinghoff",
          "content": "He is absolutely right. The soap opera effect totally ruins the look of most movies. I still use a good old 1080p plasma on default. It always looks good",
          "created_at": 1767073760000,
          "content_cn": "他说得完全正确。肥皂剧效果确实毁掉了大多数电影的观感。我至今仍在使用一台老旧的1080p等离子电视，保持默认设置，画面效果始终出色。"
        },
        {
          "hn_comment_id": 46431567,
          "parent_id": null,
          "author": "nelox",
          "content": "Christopher Nolan and Paul Thomas Anderson made a similar appeal a few years ago. The soap opera effect is my pet bugbear and is the first to go.https://www.indiewire.com/features/general/christopher-nolan...",
          "created_at": 1767089553000,
          "content_cn": "克里斯托弗·诺兰和保罗·托马斯·安德森几年前也发出过类似的呼吁。肥皂剧效应是我最讨厌的问题，也是首先要消除的。"
        },
        {
          "hn_comment_id": 46428196,
          "parent_id": null,
          "author": "avazhi",
          "content": "Thanks for the thought but from what I’ve heard from friends I’ll be keeping the final season unwatched just like I did with the last 2 episodes of GoT.",
          "created_at": 1767056342000,
          "content_cn": "谢谢你的想法，但根据我从朋友那里听到的，我会像对待《权力的游戏》最后两集一样，不去看最终季。"
        },
        {
          "hn_comment_id": 46434239,
          "parent_id": null,
          "author": "neom",
          "content": "I know this sounds extreme but I get actually angry/frustrated and often just can't watch peoples TVs. I don't watch TV myself but if I go to someones house and they have the TV on and it's one of those \"enhanced\" TVs, it boils my blood. I went to film school, I have emmy's, I've watched hours long conversations about frame rates and dynamic range choices and so many aspects of the creative process that the TV then...removes, heck sometimes I see these smart TVs playing something and I can't even tell what framerate it might even be in, sometimes it looks like in one scene it's 60p and in another is like 300p, then back to 24p? it's so jarring. I'm really surprised people even like these features/manufacturers think they're good defaults. Really grinds my gears!!! </rant>",
          "created_at": 1767108514000,
          "content_cn": "我知道这听起来很极端，但我真的会感到愤怒和沮丧，常常无法忍受别人家的电视。我自己不看电视，但如果去别人家做客，他们开着电视，而且恰好是那种“增强型”电视，简直让我火冒三丈。我上过电影学院，拿过艾美奖，参与过无数关于帧率、动态范围选择等创作细节的长时间讨论，而这些电视却把这些都抹杀了——有时我看到这些智能电视播放的内容，甚至无法分辨帧率是多少，有时一个场景像是60帧，另一个又像是300帧，然后又跳回24帧？太刺眼了。我真的很惊讶人们居然喜欢这些功能，厂商还把它们设为默认选项。这实在让我恼火至极！"
        },
        {
          "hn_comment_id": 46429597,
          "parent_id": null,
          "author": "pupppet",
          "content": "The fact that I have to turn on closed captioning to understand anything tells me these producers have no idea what we want and shouldn’t be telling us what settings to use.",
          "created_at": 1767069507000,
          "content_cn": "我必须打开字幕才能听懂任何内容，这足以说明这些制作人根本不知道我们想要什么，也不该由他们来告诉我们该用什么设置。"
        },
        {
          "hn_comment_id": 46433887,
          "parent_id": null,
          "author": "ilamont",
          "content": "Regarding the darkness trend, a great HN comment from a few years ago by @atoav  who worked as a director of photography:Movies have dark scenes nowadays mainly because it is a trend. On top of that dark scenes can have practical advantages (set building, VFX, lighting, etc. can be reduced or become much simpler to do which directly translates into money saved during shooting).If I had to guess, the trend of dark scenes are a direct result of the fact that in the past two decades we our digital sensors got good enough to actually shoot in such low-light environments.https://news.ycombinator.com/item?id=35398576",
          "created_at": 1767106517000,
          "content_cn": "关于暗黑风格趋势，几年前曾担任摄影指导的@atoav在HN上有一段精彩评论：如今电影偏爱暗黑场景主要是因为这是一种潮流。此外，暗黑场景在实际制作中具有优势（布景搭建、视觉特效、灯光等工作量可减少或大幅简化，这直接转化为拍摄阶段的成本节约）。若要我推测，暗黑场景的流行趋势直接源于过去二十年数字传感器技术的进步——它们已经足够先进，能够在如此低光照环境下进行实际拍摄。"
        },
        {
          "hn_comment_id": 46430326,
          "parent_id": 46430293,
          "author": "boilerupnc",
          "content": "I miss my old Panasonic Plasma.  I chose to leave it with my old home because of its size and its age.  It was rock solid after 10+ years with many cycles to go.  Solid gear! Sigh…",
          "created_at": 1767077625000,
          "content_cn": "我怀念我的旧松下等离子电视。因为它的尺寸和年代，我选择把它留在了旧居。它历经十多年依然坚如磐石，本还能再用很久。真是可靠的设备！唉……"
        },
        {
          "hn_comment_id": 46436466,
          "parent_id": null,
          "author": "iknowstuff",
          "content": "The 120Hz / \"soap opera effect\" is a matter of perspective. I hate the judder and blur during 30Hz camera pans. Love interpolated smoothness.",
          "created_at": 1767120132000,
          "content_cn": "120Hz刷新率带来的\"肥皂剧效应\"因人而异。我讨厌30Hz拍摄时画面平移产生的抖动和模糊，非常喜欢插帧技术带来的流畅感。"
        },
        {
          "hn_comment_id": 46428201,
          "parent_id": null,
          "author": "ycombinatrix",
          "content": "The \"soap opera\" effect is real, I don't enjoy it.",
          "created_at": 1767056354000,
          "content_cn": "“肥皂剧效应”确实存在，我并不喜欢它。"
        },
        {
          "hn_comment_id": 46430474,
          "parent_id": 46430425,
          "author": "thfuran",
          "content": ">Assume that every manufacturer out there is equally capable of creating a screen that faithfully reproduces the content to the best ability of current technology.That basically isn’t true. Or rather, there are real engineering tradeoffs required to make an actual consumer good that has to be manufactured and sold at some price. And, especially considering that TVs exist at different price points, there are going to be different tradeoffs made.",
          "created_at": 1767079292000,
          "content_cn": "假设每家制造商都有同等能力，能基于当前技术极限制造出精准还原内容的屏幕。这种想法基本不符合事实。更准确地说，制造实际消费品时必然涉及真正的工程权衡，毕竟产品需要以特定价格制造和销售。尤其考虑到电视存在不同价位区间，必然会做出不同的权衡取舍。"
        },
        {
          "hn_comment_id": 46430894,
          "parent_id": 46430852,
          "author": "0-_-0",
          "content": "But the high FPS version is only in cinemas",
          "created_at": 1767083595000,
          "content_cn": "但高帧率版本仅在影院上映"
        },
        {
          "hn_comment_id": 46431485,
          "parent_id": 46428235,
          "author": "MasterScrat",
          "content": "Just so you know, this is already very much a thing on TikTok: AI-generated movie summaries with narrator voice explaining the plot while showing only major beats, reducing movie from 2h to shorts totaling 10min.It’s honestly not the worse AI content out there! Lots of movies I wouldn’t consider watching but that I’m curious enough to see summarized (eg a movie where only the first title was good but two more were still published)",
          "created_at": 1767088881000,
          "content_cn": "需要说明的是，这已经是TikTok上非常流行的形式：由AI生成电影摘要，通过旁白解说剧情，只展示关键情节，将两小时的电影压缩成总计十分钟的短片。说实话，这还算不上最糟糕的AI内容！很多电影我本来没打算看，但又好奇到想了解剧情概要（比如那种只有第一部好看却硬出了续集的系列电影）。"
        },
        {
          "hn_comment_id": 46431100,
          "parent_id": 46430388,
          "author": "JetSetIlly",
          "content": "> Films are more like dreams than like real life.Yes! The other happy accident of movies that contribute to the dream-like quality, besides the lower frame rate, is the edit. As Walter Murch says in \"In the Blink of an Eye\", we don't object to jumps in time or location when we watch a film. As humans we understand what has happened, despite such a thing being impossible in reality. The only time we ever experience jumps in time and location is when we dream.I would go further and say that a really good film, well edited, induces a dreamlike state in the viewer.And going even further than that, a popular film being viewed by thousands of people at once is as though those people are dreaming the same dream.",
          "created_at": 1767085259000,
          "content_cn": "电影更像是梦境而非现实生活。确实！除了较低的帧率外，剪辑是赋予电影梦幻感的另一个幸运巧合。正如沃尔特·默奇在《眨眼之间》中所说，我们在观看电影时不会对时间或地点的跳跃感到不适。作为人类，我们理解发生了什么，尽管这在现实中是不可能的。我们唯一经历时间和地点跳跃的时刻就是在梦中。我更进一步认为，一部剪辑精良的优秀电影能引导观众进入一种梦幻状态。再进一步说，一部热门电影被成千上万人同时观看，就好像这些人正在做同一个梦。"
        },
        {
          "hn_comment_id": 46432632,
          "parent_id": 46432358,
          "author": "Avery3R",
          "content": "\"reference TVs\" exist, they're what movies/tv shows are mastered on, e.g. https://flandersscientific.com/XMP551/",
          "created_at": 1767097643000,
          "content_cn": "“参考级电视”确实存在，它们是电影/电视节目进行母带制作的基准显示器，例如https://flandersscientific.com/XMP551/。"
        },
        {
          "hn_comment_id": 46435087,
          "parent_id": 46432358,
          "author": "BikiniPrince",
          "content": "I disable all video processing features and calibrate my sets. Bought a meter years ago and it’s given me endless value.",
          "created_at": 1767113016000,
          "content_cn": "我关闭了所有视频处理功能并校准了我的设备。多年前买了个校准仪，它给我带来了无尽的价值。"
        },
        {
          "hn_comment_id": 46441742,
          "parent_id": 46431084,
          "author": "KronisLV",
          "content": "The whole comment 100% matches my experience with any and every BIOS setup out there.",
          "created_at": 1767159839000,
          "content_cn": "这条评论完全符合我对所有BIOS设置的体验。"
        },
        {
          "hn_comment_id": 46431641,
          "parent_id": 46428248,
          "author": "vanviegen",
          "content": "But that would mean that everybody is experiencing a quality level based on the least common denominator.I think TV filters (vivid, dynamic brightness, speech lifting, etc) are actually a pretty decent solution to less-than-ideal (bright and noisy environment, subpar screen and audio) viewing conditions.",
          "created_at": 1767090021000,
          "content_cn": "但这意味着每个人的体验质量都将取决于最低标准。我认为电视滤镜（鲜艳模式、动态亮度、语音增强等）实际上是对不理想观看环境（明亮嘈杂、屏幕和音响效果欠佳）相当不错的解决方案。"
        },
        {
          "hn_comment_id": 46432702,
          "parent_id": 46431084,
          "author": "pmontra",
          "content": "They will setup their TVs with whatever setting makes them sell better than the other TVs in the shop.",
          "created_at": 1767098217000,
          "content_cn": "他们会根据能让电视在店里比其他电视更好卖的设置来调整电视。"
        },
        {
          "hn_comment_id": 46430832,
          "parent_id": 46429193,
          "author": "EbNar",
          "content": "Incidentally, that's the reason why I love photography in Nolan's movies: he seems to love scenes with bright light in which you can actually see what's going on.Most other movies/series instead are so dark that make my mid-range TV look like crap. And no, it's not an HW fault, as 500 nits should be enough to watch a movie.",
          "created_at": 1767082957000,
          "content_cn": "顺便一提，这也是我钟爱诺兰电影中摄影风格的原因：他似乎偏爱明亮光线下的场景，让人能真切看清画面细节。而大多数其他影视作品色调过于昏暗，让我这台中等档次的电视显得画质糟糕。不，这并非硬件问题，毕竟500尼特的亮度本应足够观影。"
        },
        {
          "hn_comment_id": 46432426,
          "parent_id": 46431445,
          "author": "theshrike79",
          "content": "Filmmaker Mode is the one you want. It's specifically set up to disable all \"enhancements\".",
          "created_at": 1767095863000,
          "content_cn": "电影制作人模式是你想要的。它专门设置为禁用所有“增强功能”。"
        },
        {
          "hn_comment_id": 46429503,
          "parent_id": 46429193,
          "author": "jerlam",
          "content": "I'm surprised they didn't mention turning off closed captioning, because understanding the dialog is less important than experiencing the creator's intent.",
          "created_at": 1767068485000,
          "content_cn": "他们居然没提到关闭字幕功能，因为理解对话远不如体验创作者的意图重要。"
        },
        {
          "hn_comment_id": 46432758,
          "parent_id": 46429977,
          "author": "Sateeshm",
          "content": "Drives me insane when people say they can't tell the difference while watching with motion smoothing on. I feel for the filmmakers.",
          "created_at": 1767098610000,
          "content_cn": "当人们说开着运动平滑功能看片时看不出区别，简直让我抓狂。我真为电影制作人感到难过。"
        },
        {
          "hn_comment_id": 46429789,
          "parent_id": 46428196,
          "author": "romanhn",
          "content": "I don't understand this at all. The episode 4 ending was up there with Dear Billy for me.",
          "created_at": 1767071771000,
          "content_cn": "我完全无法理解。第四集的结局对我来说和《亲爱的比利》一样震撼。"
        },
        {
          "hn_comment_id": 46430111,
          "parent_id": 46428196,
          "author": "layer8",
          "content": "The first season was the only really good one.",
          "created_at": 1767075092000,
          "content_cn": "第一季是唯一真正精彩的一季。"
        },
        {
          "hn_comment_id": 46430172,
          "parent_id": 46429193,
          "author": "mystifyingpoi",
          "content": "I've watched Silo season 2 and it is basically impossible to watch it during the day. Only at night, with brightness cranked up to 100%.",
          "created_at": 1767075926000,
          "content_cn": "我看了《羊毛战记》第二季，白天基本没法看。只能晚上看，还得把亮度调到最高。"
        },
        {
          "hn_comment_id": 46437782,
          "parent_id": 46434239,
          "author": "throwforfeds",
          "content": "I'm the same, I haven't lived in a house with a TV since I left my parent's house at 18 (I'm in my 40s now) and whenever I'm in someones house with one on I'm just flabbergasted that people watch things that look like they do on their TVs.I was at my parent's house the other day for Christmas and tried to start watching Wong Kar-wai's Blossoms Shanghai, but the TV made everything look so terrible that I couldn't continue with it. I was having a hard time figuring out what was just from his style and what was whatever crap the TV was trying to do to it on it's own. I'm amazed people don't realize things just look like shit on their TVs now?",
          "created_at": 1767127515000,
          "content_cn": "我也是如此，自从18岁离开父母家后就没在配有电视的房子里住过（现在已四十多岁）。每当去别人家看到电视开着，我都震惊于人们竟能忍受电视呈现的那种画质。前几天圣诞节回父母家，本想看王家卫的《繁花》，但电视把画面弄得一团糟，根本看不下去。我很难分辨哪些是导演的风格，哪些是电视自作主张的劣化处理。现在电视画质这么差，大家居然都没察觉，这让我很惊讶。"
        },
        {
          "hn_comment_id": 46433386,
          "parent_id": 46429193,
          "author": "y-curious",
          "content": "See the color palettes of any 2015+ blockbuster[1] to validate your belief (save for Wes Anderson, maybe).1: https://i.redd.it/nyrs8vsil6m41.jpg",
          "created_at": 1767103212000,
          "content_cn": "看看2015年后任何一部大片[1]的调色板就能验证你的想法（也许韦斯·安德森的作品除外）。1: https://i.redd.it/nyrs8vsil6m41.jpg"
        },
        {
          "hn_comment_id": 46430027,
          "parent_id": 46429597,
          "author": "joquarky",
          "content": "One problem is that the people mixing the audio already know what is being said:Top-down processing(or more specifically, top-down auditory perception)This refers to perception being driven by prior knowledge, expectations, and context rather than purely by sensory input. When you already know the dialog, your brain projects that knowledge onto the sound and experiences it as “clear.”",
          "created_at": 1767074291000,
          "content_cn": "问题在于，混音人员已经知道台词内容：自上而下的处理（更具体地说是自上而下的听觉感知）指的是感知由先验知识、预期和语境驱动，而非纯粹由感官输入决定。当你已经知晓对话内容时，大脑会将这种认知投射到声音上，从而产生“清晰”的听感。"
        },
        {
          "hn_comment_id": 46430720,
          "parent_id": 46430326,
          "author": "UltraSane",
          "content": "Plasma displays died because they couldn't be made in 4k resolution at an affordable price and they use 10 times as much power as LCD or OLED.",
          "created_at": 1767081861000,
          "content_cn": "等离子显示器之所以被淘汰，是因为它们无法以可承受的成本实现4K分辨率，并且其耗电量是液晶或OLED显示器的十倍。"
        },
        {
          "hn_comment_id": 46435120,
          "parent_id": 46433887,
          "author": "BonoboIO",
          "content": "Next optimization: Black screen",
          "created_at": 1767113164000,
          "content_cn": "下次优化：黑屏问题"
        },
        {
          "hn_comment_id": 46430514,
          "parent_id": 46430474,
          "author": "beloch",
          "content": "Yes, there are tradeoffs, but LCD, etc. technology is now sufficiently good that displays in the same general price category tend to look quite similar once calibrated.  The differences are much more noticeable when they're using their default \"gimmick\" settings, and that's by design.",
          "created_at": 1767079710000,
          "content_cn": "确实存在权衡，但LCD等技术现已足够成熟，使得同价位区间的显示器在校准后往往看起来相当接近。差异在它们使用默认的“花哨”设置时更为明显，而这正是有意为之的设计。"
        },
        {
          "hn_comment_id": 46436485,
          "parent_id": 46436466,
          "author": "pitched",
          "content": "I was a huge fan of the high-framerate Hobbit films. It made the huge battles much easier to follow and I felt like I picked up a lot more of the details. Such a shame it never had a retail release.",
          "created_at": 1767120245000,
          "content_cn": "我曾是《霍比特人》高帧率电影的狂热粉丝。它让宏大的战斗场面更易于追踪，我感觉自己捕捉到了更多细节。遗憾的是它从未推出零售版。"
        },
        {
          "hn_comment_id": 46428465,
          "parent_id": 46428201,
          "author": "laweijfmvo",
          "content": "christmas day, walked into a relative’s living room to watch football and the players were literally gliding across the screen. lol",
          "created_at": 1767058549000,
          "content_cn": "圣诞节那天，走进亲戚家的客厅看足球赛，球员们简直像在屏幕上滑行一样。哈哈"
        },
        {
          "hn_comment_id": 46433682,
          "parent_id": 46432702,
          "author": "vladvasiliu",
          "content": "I don't particularly like that, but even so, it doesn't preclude having a \"standard\" or \"no enhancement\" option, even if it's not the default.On my TCL TV I can turn off \"smart\" image and a bunch of other crap, and there's a \"standard\" image mode. But I'm not convinced that's actually \"as close to reference as the panel can get\". One reason is that there is noticeable input lag when connected to a pc, whereas if I switch it to \"pc\", the lag is basically gone, but the image looks different. So I have no idea which is the \"standard\" one.Ironically, when I first turned it on, all the \"smart\" things were off.",
          "created_at": 1767105252000,
          "content_cn": "我并不是特别喜欢这一点，但即便如此，这并不妨碍设置一个“标准”或“无增强”选项，即使它不是默认设置。在我的TCL电视上，我可以关闭“智能”图像和一堆其他多余功能，并且有一个“标准”图像模式。但我并不确信那真的是“面板能达到的最接近参考标准的状态”。一个原因是连接到电脑时会有明显的输入延迟，而如果我切换到“电脑”模式，延迟基本消失，但图像看起来有所不同。所以我也不知道哪个才是“标准”模式。讽刺的是，当我第一次打开电视时，所有“智能”功能都是关闭的。"
        },
        {
          "hn_comment_id": 46434048,
          "parent_id": 46430832,
          "author": "wil421",
          "content": "Mentioned this elsewhere but The Dark Knight Rises is one of the worst dark movie offenders. When someone says dark movie scenes it’s what comes to my mind. That one confusing backwards movie has terrible audio he did on purpose.Oppenheimer didnt suffer from either of those issues but I’ve only watched it once on a good TV.",
          "created_at": 1767107463000,
          "content_cn": "我在别处也提过，《黑暗骑士崛起》是最糟糕的暗黑电影之一。每当有人提到暗黑电影场景，我首先想到的就是它。那部令人困惑的倒叙电影音效极差，是他故意为之。《奥本海默》则没有这些问题，但我只在好电视上看过一次。"
        },
        {
          "hn_comment_id": 46434168,
          "parent_id": 46432702,
          "author": "thesuitonym",
          "content": "I'm not certain this is true. TVs have become so ludicrously inexpensive that it seems the only criteria consumers shop for is bigger screen and lower price.",
          "created_at": 1767108132000,
          "content_cn": "我不太确定这是否属实。电视已经变得异常便宜，以至于消费者似乎只追求更大的屏幕和更低的价格。"
        },
        {
          "hn_comment_id": 46432111,
          "parent_id": 46430832,
          "author": "machomaster",
          "content": "Very ironic that it is Nolan who is widely known for consiously making movies with incomprehensible dialogue.",
          "created_at": 1767093579000,
          "content_cn": "颇具讽刺意味的是，诺兰正是以刻意制作对话晦涩难懂的电影而广为人知。"
        },
        {
          "hn_comment_id": 46435983,
          "parent_id": 46434005,
          "author": "squeaky-clean",
          "content": "On my Samsung film mode has an insane amount of processing. Game Mode is the setting where the display is most true to what's being sent to it.",
          "created_at": 1767117338000,
          "content_cn": "在我的三星电视上，电影模式有大量的图像处理。游戏模式是显示效果最接近输入信号的设置。"
        },
        {
          "hn_comment_id": 46429814,
          "parent_id": 46429503,
          "author": "etempleton",
          "content": "I haven’t experienced issues understanding dialogue in Stranger Things, for what it’s worth.",
          "created_at": 1767072028000,
          "content_cn": "就我个人而言，观看《怪奇物语》时理解对话没有遇到困难。"
        },
        {
          "hn_comment_id": 46434272,
          "parent_id": 46434005,
          "author": "jbaiter",
          "content": "Yup, it's great, at least for live action content. I've found that for Anime, a small amount of motion interpolation is absolutely needed on my OLED, otherwise the content has horrible judder.",
          "created_at": 1767108656000,
          "content_cn": "是的，这很棒，至少对于真人实景内容来说。我发现对于动漫，在我的OLED电视上绝对需要少量的动态插帧，否则画面会有严重的抖动问题。"
        },
        {
          "hn_comment_id": 46435956,
          "parent_id": 46432758,
          "author": "4star3star",
          "content": "The soap opera effect drives me nuts. I just about can't watch something when it's on. It makes a multimillion dollar movie look like it was slapped together in an afternoon.",
          "created_at": 1767117210000,
          "content_cn": "肥皂剧效应简直让我抓狂。一旦开启这个模式，我几乎没法看任何节目。它让耗资数百万美元的电影看起来像是下午匆忙拼凑出来的东西。"
        },
        {
          "hn_comment_id": 46432195,
          "parent_id": 46430111,
          "author": "dontlaugh",
          "content": "Exactly, even the second one was a poor caricature.",
          "created_at": 1767094078000,
          "content_cn": "确实，连第二个都画得很拙劣。"
        },
        {
          "hn_comment_id": 46430261,
          "parent_id": 46430172,
          "author": "Nursie",
          "content": "Game of Thrones S8E3.Could barely tell what was going on, everything was so dark, and black crush killed it completely, making it look blocky and janky.I watched it again a few years later, on max brightness, sitting in the dark, and I got more of what was going on, but it still looked terrible. One day I'll watch the 'UHD' 4k HDR version and maybe I'll be able to see what it was supposed to look like.",
          "created_at": 1767076907000,
          "content_cn": "《权力的游戏》第八季第三集。画面暗得几乎看不清发生了什么，黑色区域完全糊成一片，导致画面显得粗糙且不流畅。几年后，我在黑暗环境中以最高亮度重新观看，虽然能多看出一些细节，但视觉效果依然糟糕。希望有一天能观看“超高清”4K HDR版本，或许那时才能领略到它本该呈现的效果。"
        },
        {
          "hn_comment_id": 46431840,
          "parent_id": 46430172,
          "author": "Hikikomori",
          "content": "My LG oled will go darker by itself during prolonged dark scenes, its not noticeable (other than that you can't see anything and you're not sure if its correct or not) until you get to a slightly brighter scene, can get it to stop for a bit by opening a menu.",
          "created_at": 1767091409000,
          "content_cn": "我的LG OLED电视在长时间播放暗场景时会自动变暗，这并不明显（除了你什么都看不见，也不确定这是否正常），直到切换到稍亮的场景才会察觉。打开菜单可以让它暂时停止变暗。"
        },
        {
          "hn_comment_id": 46430751,
          "parent_id": 46430027,
          "author": "snakeboy",
          "content": "Makes sense, but how does this explain the fact that this problem seems recent, or at least to have worsened recently ?",
          "created_at": 1767082131000,
          "content_cn": "有道理，但这如何解释这个问题似乎是最近才出现的，或者至少是最近才恶化的事实呢？"
        },
        {
          "hn_comment_id": 46438053,
          "parent_id": 46430027,
          "author": "olyjohn",
          "content": "That may be a part of it, but I think for a lot of people the problem is how surround sound movies are processed.Voice comes through the center channel. Music tends to come out of multiple speakers, and so do a lot of explosions and sound effects.Most people don't have multi-channel setups at home. So you get everything coming out of 2 speakers or a sound bar.What that means, is that you get 4+ channels of music and sound effects mixed into 2 channels. So it ends up drowning out the single voice channel.When I play movies through Kodi, I generally go into the audio settings and turn up the center channel. This fixes the issue every time for me.",
          "created_at": 1767129141000,
          "content_cn": "这可能是一部分原因，但我认为对很多人来说，问题在于环绕声电影的处理方式。人声通常通过中置声道输出，而音乐往往从多个扬声器发出，许多爆炸声和音效也是如此。大多数人在家中并没有多声道音响系统，所以所有声音都只能通过两个扬声器或一个回音壁输出。这意味着原本4个以上声道的音乐和音效被混合到两个声道中，最终导致单一的人声频道被淹没。当我在Kodi上播放电影时，通常会进入音频设置调高中置声道。每次这样做都能完美解决问题。"
        },
        {
          "hn_comment_id": 46432598,
          "parent_id": 46430172,
          "author": "suncore",
          "content": "I turned off HDR. Much happier now that I can see what's going on on the screen.",
          "created_at": 1767097353000,
          "content_cn": "我关闭了HDR功能。现在能看清屏幕上的内容，感觉好多了。"
        },
        {
          "hn_comment_id": 46433229,
          "parent_id": 46430027,
          "author": "wil421",
          "content": "It was garbage before streaming services took off. Dark Knight Rises is one example. I can remember renting DVDs in the mid to late 2000s from Netflix and they had a similar issues.",
          "created_at": 1767102010000,
          "content_cn": "在流媒体服务兴起之前，那简直是垃圾。《黑暗骑士崛起》就是个例子。我记得2000年代中后期从Netflix租DVD时，它们也存在类似问题。"
        },
        {
          "hn_comment_id": 46433936,
          "parent_id": 46430027,
          "author": "dylan604",
          "content": "Look at any setup audio is being mixed on and tell me how many sound bars do you see there? How many flat panels with nothing more than the built in speakers being used? None. The speakers being used and the tricks the equipment do to make multichannel audio work with fewer speakers plays havoc on well mixed audio. Down mixing on consumer device is just never going to sound great",
          "created_at": 1767106836000,
          "content_cn": "看看任何专业音频混音设备，告诉我你看到多少台回音壁？有多少台仅使用内置扬声器的平板电视？一台都没有。专业设备使用的扬声器以及为让多声道音频在较少扬声器上工作而采用的技术，都会严重干扰精心混音的音频效果。在消费级设备上进行下混音，音质永远无法达到理想水平。"
        },
        {
          "hn_comment_id": 46435357,
          "parent_id": 46430027,
          "author": "killerstorm",
          "content": "Well, somehow, most of short-form content on YouTube doesn't have this problem. Perfectly clear dialogs.I think the main problem is that producers and audio people are stupid, pompous wankers. And I guess it doesn't help that some people go to cinema for vibrations and don't care about the content.",
          "created_at": 1767114334000,
          "content_cn": "嗯，不知为何，YouTube上的大部分短视频内容都没有这个问题，对话清晰明了。我认为主要问题在于制片人和音频人员都是些愚蠢自负的混蛋。而且，有些人去电影院只是为了感受震动，根本不在乎内容，这大概也无济于事。"
        },
        {
          "hn_comment_id": 46434794,
          "parent_id": 46434005,
          "author": "gchamonlive",
          "content": "On my LG OLED I think it looks bad. Whites are off and I feel like the colours are squashed. Might be more accurate, but it's bad for me. I prefer to use standard, disable everything and put the white balance on neutral, neither cold nor warm.",
          "created_at": 1767111354000,
          "content_cn": "在我的LG OLED电视上，我觉得画面效果不佳。白色显示不准确，颜色也显得压缩失真。或许技术上更精确，但对我来说观感很差。我更喜欢使用标准模式，关闭所有增强功能，并将白平衡设置为中性，既不偏冷也不偏暖。"
        },
        {
          "hn_comment_id": 46440834,
          "parent_id": 46434036,
          "author": "esalman",
          "content": "I bought a not too expensive TCL qm6k with game master mode. Whenever it detects Xbox series S input, it turns on the mode by default. On menu it stays at 1440p but when I start a game, it switches to 4k 120hz- and the input lag becomes horrible!Turns out it does not even care if I set lower resolution in Xbox display settings. So I had to just disable game master mode. And I don't miss anything.",
          "created_at": 1767150375000,
          "content_cn": "我买了一台价格不太贵的TCL qm6k，它带有游戏大师模式。每当检测到Xbox Series S输入时，它就会默认开启该模式。在菜单界面它保持在1440p分辨率，但当我启动游戏时，它会切换到4K 120Hz——输入延迟变得非常糟糕！结果发现，即使我在Xbox显示设置中调低分辨率，它也不理会。所以我只能关闭游戏大师模式。而且我并没有因此错过任何功能。"
        },
        {
          "hn_comment_id": 46434695,
          "parent_id": 46430272,
          "author": "MarkLowenstein",
          "content": "It's unbelievable that we try so hard to solve this problem even after CRTs are extinct. Every LCD-type screen is easily made to refresh at any rate below its max. If we can't show a 24fps movie at 24fps on our TVs (or smoothly smoothed at 48fps)...what are we doing as a society? It's not like people think TV is an unimportant corner of their lives.",
          "created_at": 1767110806000,
          "content_cn": "难以置信的是，即便在CRT显示器早已绝迹的今天，我们仍在如此费力地解决这个问题。任何液晶类屏幕都能轻松实现低于其最大值的任意刷新率。如果我们连在电视上以24帧播放24帧电影（或通过48帧流畅插帧）都做不到……我们这个社会到底在做什么？电视在人们生活中并非无足轻重的角落。"
        },
        {
          "hn_comment_id": 46436632,
          "parent_id": 46436485,
          "author": "nosianu",
          "content": "Never mind the battles and action scenes, just any scenes with normal movement of the camera.There is a lot of panning in the initial scenes of The Hobbit (opening scene is the fall of Erebor). I watched that movie initially with the new higher frequency, and everything was soooo smooth. When I rewatched it, every single time I have to experience the terrible, terrible choppy, hard-to-see-anything lower frequency transformations and I cry. This is the 12st century, and the movies can't even pan across some landscape smoothly?In that first viewing I saw everything in those caves, it was so easy. Oh how I miss that.",
          "created_at": 1767120945000,
          "content_cn": "别管那些战斗和动作场面，就说说那些镜头正常移动的场景。《霍比特人》开场的镜头里有很多平移（开场就是埃瑞博陷落）。我第一次看这部电影时用了新的高刷新率，一切都那么流畅。后来重看时，每次都要忍受糟糕透顶、卡顿严重、难以看清的低刷新率转换，简直让人崩溃。这都21世纪了，电影连平移风景都做不到流畅吗？第一次观看时，我连洞穴里的每个细节都看得清清楚楚，多么轻松。唉，我多怀念那种体验啊。"
        },
        {
          "hn_comment_id": 46434107,
          "parent_id": 46434036,
          "author": "thesuitonym",
          "content": "Sceptre makes them, and they're not terribly expensive, although in the US the price has gone up significantly for some strange, remote reason.",
          "created_at": 1767107766000,
          "content_cn": "Sceptre生产这些产品，虽然在美国由于某种奇怪而遥远的原因价格大幅上涨，但它们并不算特别昂贵。"
        },
        {
          "hn_comment_id": 46435461,
          "parent_id": 46435171,
          "author": "speedgoose",
          "content": "I didn’t watch the show too, and I agree. Though I’m not convinced that excellent CGI would significantly improve the scene.",
          "created_at": 1767114858000,
          "content_cn": "我也没看这部剧，而且我同意。不过我不太相信出色的CGI能显著改善这个场景。"
        },
        {
          "hn_comment_id": 46435976,
          "parent_id": 46435171,
          "author": "y-c-o-m-b",
          "content": "It does look terrible in that video, but I watch on a projector and it actually looks good on it, so I think this is simply an artifact of watching a phone recording of a TV.",
          "created_at": 1767117314000,
          "content_cn": "那段视频里看起来确实很糟糕，但我在投影仪上观看时效果其实不错，所以我认为这只是用手机拍摄电视屏幕导致的失真现象。"
        },
        {
          "hn_comment_id": 46435180,
          "parent_id": 46434036,
          "author": "naberhausj",
          "content": "Don't have personal experience with these devices, but a passthrough EDID emulator might solve this. I expect it would make the TV unable to recognize the specific device you have plugged in.Something like this:https://a.co/d/4pVIpRVI think you just find one with the same output specs as your PS5.",
          "created_at": 1767113499000,
          "content_cn": "虽然没有亲自使用过这类设备，但直通式EDID模拟器或许能解决这个问题。我估计它会让电视无法识别你接入的具体设备。类似这样的产品：https://a.co/d/4pVIpRV  \n我认为你只需要找一个输出规格和PS5相同的设备就行。"
        },
        {
          "hn_comment_id": 46431885,
          "parent_id": 46431351,
          "author": "consp",
          "content": "I don't think you are the target audience of the dumbed down part but the people paying them for it. They don't need the detailed documentation on those thing, so why make it?",
          "created_at": 1767091680000,
          "content_cn": "我认为那些简化内容的目标受众不是你，而是为此付费的人。他们不需要那些东西的详细文档，那又何必制作呢？"
        },
        {
          "hn_comment_id": 46430456,
          "parent_id": 46430425,
          "author": "beeflet",
          "content": "why even bother with \"TV Screens\"? Why not just get a big computer monitor instead, like 27\" or something",
          "created_at": 1767079131000,
          "content_cn": "何必费心考虑\"电视屏幕\"？不如直接买个大的电脑显示器，比如27英寸那种。"
        },
        {
          "hn_comment_id": 46434785,
          "parent_id": 46434695,
          "author": "easterncalculus",
          "content": "Considering that practically the only metric of economic success in the US oligarchy is the price of the flat-screen TV you'd imagine they'd at least work by now. At at least one price range.",
          "created_at": 1767111300000,
          "content_cn": "考虑到美国寡头集团衡量经济成功的实际唯一标准就是平板电视的价格，你会以为他们至少现在也该让电视正常工作了。至少在某一个价格区间内应该如此。"
        },
        {
          "hn_comment_id": 46435369,
          "parent_id": 46434107,
          "author": "dpark",
          "content": "Do they actually make OLEDs? I haven’t bought a tv in quite a while but last I looked dumb OLED TVs didn’t exist.",
          "created_at": 1767114387000,
          "content_cn": "他们真的生产OLED电视吗？我已经很久没买电视了，但上次我留意时，市面上还没有非智能的OLED电视。"
        },
        {
          "hn_comment_id": 46430758,
          "parent_id": 46430388,
          "author": "_flux",
          "content": "> Most of the issues (like \"judder\") that people have with 24fps are due to viewing it on 60 fps screensThat can be a factor, but I think this effect can be so jarring that many would realize that there's a technical problem behind it.For me 24 fps is usually just fine, but then if I find myself tracking something with my eyes that wasn't intended to be tracked, then it can look jumpy/snappy. Like watching fast flowing end credits but instead of following the text, keeping the eyes fixed at some point.> Films are more like dreams than like real life. That frame rate is essential to them, and its choice, driven by technical constraints of the time when films added sound, was one of happiest accidents in the history of Arts.I wonder though, had the industry started with 60 fps, would people now applaud the 24/30 fps as a nice dream-like effect everyone should incorporate into movies and series alike?",
          "created_at": 1767082231000,
          "content_cn": "大多数人对24帧率的抱怨（比如“卡顿”）其实是因为在60帧屏幕上观看造成的。这确实是个因素，但我认为这种效果可能过于突兀，以至于很多人会意识到背后存在技术问题。对我来说24帧通常没问题，但当我无意中用视线追踪某些本不该被追踪的物体时，画面就会显得跳跃/急促。就像观看快速滚动的片尾字幕时，如果不跟随文字移动而是固定视线在某一点。\n\n电影更像梦境而非现实生活。这种帧率对电影至关重要，它的选择源于电影加入声音时代的技术限制，却成为艺术史上最美丽的意外之一。不过我在想，如果行业最初从60帧起步，现在人们会不会反而称赞24/30帧是种美妙的梦幻效果，认为所有电影剧集都应该采用呢？"
        },
        {
          "hn_comment_id": 46431240,
          "parent_id": 46430388,
          "author": "arnaudsm",
          "content": "Variable refresh rate displays are becoming popular in smartphones and PCs, hopefully this won't be a technical issue soon.",
          "created_at": 1767086524000,
          "content_cn": "可变刷新率显示屏在智能手机和个人电脑中越来越受欢迎，希望这不会很快成为技术难题。"
        },
        {
          "hn_comment_id": 46430185,
          "parent_id": 46428235,
          "author": "01100011",
          "content": "I just said to a friend that the season 5 writing is so bad that I think AI would have done a better job.  I hope someone tries that out once we get the final episode: Give an LLM the scripts for the first 4 seasons, the outcome frome the finale, and let it have a go and drafting a better season 5.And no, I'm not talking about the gay thing. The writing is simply atrocious. Numerous plot holes, leaps of reasoning, and terrible character interactions.",
          "created_at": 1767076022000,
          "content_cn": "我刚跟朋友说，第五季的剧本实在太差了，感觉AI写出来的可能都比这强。真希望等大结局播出后，有人能试试看：把前四季的剧本和最终结局交给大语言模型，让它试着构思一个更好的第五季。顺便说一句，我指的不是同性恋情节的问题。纯粹是剧本质量糟糕透顶——漏洞百出、逻辑跳跃、角色互动也写得一塌糊涂。"
        },
        {
          "hn_comment_id": 46428249,
          "parent_id": 46428235,
          "author": "tguvot",
          "content": "as opposite to  AI-powered \"Hyper Vibrant Story\" filters that increase 5 minute of plot to 62 minutes of slop",
          "created_at": 1767056763000,
          "content_cn": "与那些将5分钟剧情拉长至62分钟拖沓内容的AI驱动“超生动故事”滤镜截然相反。"
        },
        {
          "hn_comment_id": 46431436,
          "parent_id": 46430388,
          "author": "Sammi",
          "content": "24 fps looks like terrible judder to me in the cinema too. I'm not afraid to admit it even if it will ruffle the feathers of the old 24 fps purists. It was always just a compromise between film cost and smoothness. A compromise that isn't relevant any longer with digital medium. But we can't have nice things it seems, because some people can't get over what they're used to.",
          "created_at": 1767088458000,
          "content_cn": "在我看来，24帧每秒在影院里也显得抖动严重。即便这会惹恼那些坚守24帧传统的老派纯粹主义者，我也毫不避讳地承认这一点。这从来只是胶片成本与流畅度之间的折衷方案。在数字媒介时代，这种折衷已不再必要。但我们似乎无法享受更好的体验，只因有些人无法摆脱固有的习惯。"
        },
        {
          "hn_comment_id": 46437587,
          "parent_id": 46432358,
          "author": "rsanheim",
          "content": "These exist, typically made by Panasonic or Sony, and cost upwards of 20k USD. HDTVtest has compared them to the top OLED consumer tvs in the past. Film studios use the reference models for their editing and mastering work.Sony specifically targets the reference with their final calibration on their top TVs, assuming you are in Cinema or Dolby Vision mode, or whatever they call it this year.",
          "created_at": 1767126485000,
          "content_cn": "这类产品确实存在，通常由松下或索尼制造，价格在2万美元以上。HDTVtest曾将它们与顶级的OLED消费级电视进行过对比。电影工作室在编辑和母带制作时使用这些参考型号。索尼特别在其高端电视的最终校准中以这些参考型号为目标，前提是您处于影院模式或杜比视界模式（或他们今年的命名方式）。"
        },
        {
          "hn_comment_id": 46435119,
          "parent_id": 46434036,
          "author": "bootlooped",
          "content": "I used to feel this way, at least about having the TV do zero processing.Something that recently changed my viewpoint a little bit was that I was noticing that 24-30 fps content was appearing very choppy. I couldn't figure out why it looked like that. It turns out it's because modern OLED TVs can switch frames very cleanly and rapidly, CRTs or older LCDs were not like that, and their relative slowness in switching frames created a smoothing or blending effect.Now I'm considering turning back on my TVs motion smoothing. I'm just hoping it doesn't do full-blown frame interpolation that makes everything look like a Mexican soap opera.",
          "created_at": 1767113163000,
          "content_cn": "我曾经也有同感，至少对于电视不做任何处理这一点。最近有个现象稍微改变了我的看法：我注意到24-30帧的内容播放起来非常卡顿。我一直没想明白为什么看起来会这样。结果发现，这是因为现代OLED电视能够非常清晰快速地切换帧，而CRT或老式LCD并非如此，它们切换帧的速度相对较慢，反而产生了一种平滑或混合的效果。现在我正考虑重新开启电视的运动平滑功能。只是希望它不会进行完整的帧插值，让所有画面看起来都像墨西哥肥皂剧那样。"
        },
        {
          "hn_comment_id": 46434747,
          "parent_id": 46434107,
          "author": "warmwaffles",
          "content": "Absolutely love my dumb Sceptre TV. Colors aren't super fantastic, but for the casual observer, it is just fine and gets the job done.",
          "created_at": 1767111044000,
          "content_cn": "我真是太爱我这台笨笨的Sceptre电视了。色彩算不上特别惊艳，但对于普通观众来说完全够用，效果也令人满意。"
        },
        {
          "hn_comment_id": 46430965,
          "parent_id": 46430388,
          "author": "dontlaugh",
          "content": "I have a 120 fps TV. Panning shots at 24 fps still give me an instant headache.Real is good, it’s ergonomic and accessible. Until filmmakers understand that, I’ll have to keep interpolation on at the lowest setting.",
          "created_at": 1767084188000,
          "content_cn": "我有一台120帧的电视，但24帧的平移镜头依然让我立刻感到头痛。真实感固然重要，但舒适度和易用性同样关键。在电影制作人明白这一点之前，我只能继续将插帧功能保持在最低档位。"
        },
        {
          "hn_comment_id": 46428498,
          "parent_id": 46428235,
          "author": "citizenkeen",
          "content": "I would use this for most reality TV shows.",
          "created_at": 1767058868000,
          "content_cn": "大多数真人秀节目我都会用它。"
        },
        {
          "hn_comment_id": 46437177,
          "parent_id": 46429977,
          "author": "ceejayoz",
          "content": "My parents’ new TV adds a Snapchat like filter to everything. Made Glenn Close look young instead of the old woman she’s supposed to be in Knives Out.Turning it off was shocking. So much better. And it was buried several levels deep in a weirdly named setting.",
          "created_at": 1767124065000,
          "content_cn": "我父母的新电视给所有画面都加了类似Snapchat的滤镜。让格伦·克洛斯在《利刃出鞘》里看起来年轻了许多，完全不像她本该呈现的老妇人形象。关掉滤镜时简直吓一跳，画面质感提升太多了。而且这个功能居然藏在某个名称古怪的设置菜单深处，得翻好几层才能找到。"
        },
        {
          "hn_comment_id": 46436532,
          "parent_id": 46429977,
          "author": "iknowstuff",
          "content": "Nope, nope, I can't watch 24-30hz without my eyes bleeding during camera pans.",
          "created_at": 1767120500000,
          "content_cn": "不行不行，看24-30赫兹的画面，镜头平移时简直要闪瞎我的眼睛。"
        },
        {
          "hn_comment_id": 46433546,
          "parent_id": 46431445,
          "author": "ubermonkey",
          "content": "\"Game mode\" on my Samsung absolutely does some goofy vibrancy thing to the color balance that is, at least to me, antithetical to watching well-created film and TV.",
          "created_at": 1767104398000,
          "content_cn": "我的三星电视上的“游戏模式”确实会对色彩平衡做出某种古怪的鲜艳度调整，至少在我看来，这与欣赏精心制作的影视作品完全背道而驰。"
        },
        {
          "hn_comment_id": 46430026,
          "parent_id": 46429977,
          "author": "SOLAR_FIELDS",
          "content": "I watched the most recent avatar and it was some HDR variant that had this effect turned up. It definitely dampens the experience. There’s something about that slightly fuzzed movement that just makes things on screen look better",
          "created_at": 1767074274000,
          "content_cn": "我看了最新的阿凡达，它采用了某种HDR版本，这种效果被调得很明显。这确实影响了观影体验。那种略带模糊的动态效果，反而让屏幕上的画面看起来更舒服。"
        },
        {
          "hn_comment_id": 46429957,
          "parent_id": 46428196,
          "author": "vunderba",
          "content": "It's been a while - I remember liking the first two seasons. Season three felt a bit silly to me without going into much detail (we need a spoiler text wrapper for HN). Season four has a lot of \"zombie-esque\" stuff which just doesn't have near the dread horror that the first two seasons did IMHO. Haven't seen any of the final season.",
          "created_at": 1767073496000,
          "content_cn": "已经有一段时间了——我记得很喜欢前两季。第三季在我看来有点傻，不过就不详细展开了（HN需要个剧透屏蔽功能）。第四季有很多“类僵尸”内容，但我觉得远没有前两季那种令人毛骨悚然的恐怖感。最终季还没看过。"
        },
        {
          "hn_comment_id": 46435775,
          "parent_id": 46434239,
          "author": "bcrosby95",
          "content": "Like people putting ketchup on a steak, eating pizza with a fork, putting chili in a hand baked loaf of sourdough,  using a garbage disposal as another trash can, or generally using the thing someone is knowledgeable about \"wrong\".For you it's film, but most people have their thing, and you're probably doing the same thing to something else in your household.",
          "created_at": 1767116237000,
          "content_cn": "就像有人在牛排上挤番茄酱、用叉子吃披萨、把辣椒塞进手工烤制的酸面包里、把垃圾处理器当另一个垃圾桶用，或者总的来说，就是以一种行家眼中“错误”的方式使用某样东西。对你来说是胶片，但大多数人都有自己执着的事物，而你在家里其他方面可能也做着同样的事。"
        },
        {
          "hn_comment_id": 46431800,
          "parent_id": 46431445,
          "author": "sspiff",
          "content": "It turns of any features that introduce latency - it will still mess up the colour space/brightness/saturation/... on most TVs.",
          "created_at": 1767091155000,
          "content_cn": "它会关闭所有可能引入延迟的功能——但在大多数电视上，这仍然会搞乱色彩空间/亮度/饱和度等参数。"
        },
        {
          "hn_comment_id": 46435259,
          "parent_id": 46434239,
          "author": "asimovDev",
          "content": "I often catch myself in the same feeling and now I am wondering if other stuff I am doing pisses someone else off. Like having plastic strips on my monitor I bought a year ago or the fact that the motor cable of my standing desk is not managed in any way (the clips detached over half a year ago and I haven't bothered routing it again) and just dangles there",
          "created_at": 1767113858000,
          "content_cn": "我常常发现自己也有同样的感受，现在不禁在想我做的其他事情是否也会惹恼别人。比如我一年前买的显示器上还贴着塑料条，或者我的升降桌电机线完全没有整理（半年前夹子就掉了，我也懒得重新布线），就那么随意地垂在那里。"
        },
        {
          "hn_comment_id": 46431739,
          "parent_id": 46429597,
          "author": "accidentallfact",
          "content": "I think it isn't a mixing issue, it's an acting issue.It's the obsession with accents, mixed with the native speakers' conviction that vowels are the most important part.Older movies tended to use some kind of unplaceable (\"mid atlantic\") accent, that could be easily understood.But modern actors try to imitate accents and almost always focus on the vowels. Most native speakers seem to be convinced that vowels are the most important part of English, but I think it isn't true.  Sure, English has a huge number of vowels, but they are almost completely redundant. It's hard to find cases where vowels really matter for comprehension, which is why they may vary so much across accents without impeding communication. So what the actors do is that they focus on the vowels, but slur the consonants, and you are pretty much completely lost without the consonants.",
          "created_at": 1767090770000,
          "content_cn": "我认为这不是混音问题，而是表演问题。根源在于对口音的过度执着，加上母语者坚信元音才是关键。老电影常采用某种难以定位的“大西洋中部口音”，这种发音清晰易懂。但现代演员总试图模仿特定口音，且几乎都把重点放在元音上。多数母语者似乎认定元音是英语最重要的部分，但我认为并非如此。诚然英语元音数量庞大，但它们几乎全是冗余信息。很难找到元音真正影响理解的案例，这也解释了为何不同口音中元音千差万别却不妨碍交流。演员们过度关注元音却模糊辅音的处理方式，导致观众在缺失辅音的情况下几乎完全无法理解台词。"
        },
        {
          "hn_comment_id": 46428313,
          "parent_id": 46428196,
          "author": "xenospn",
          "content": "It’s very bad.",
          "created_at": 1767057228000,
          "content_cn": "这非常糟糕。"
        },
        {
          "hn_comment_id": 46429893,
          "parent_id": 46429597,
          "author": "rtpg",
          "content": "I have the same sound issues with a lot of stuff, my current theory at this point is that TVs have gotten bigger and we're further away from them but speakers have stayed kinda shitty... but things are being mixed by people using headphones or otherwise good sound equipmentit's very funny how when watching a movie on my macbook pro it's better for me to just use HDMI for the video to my TV but keep on using my MBP speaker for the audio, since the speakers are just much better.",
          "created_at": 1767072768000,
          "content_cn": "我遇到很多设备都有同样的声音问题，目前我的推测是电视屏幕越来越大，我们离电视的距离变远，但扬声器却一直很糟糕……然而音频制作人员都是用耳机或其他优质音响设备进行混音的。有趣的是，我在MacBook Pro上看电影时，更倾向于用HDMI连接电视播放视频，但继续用MacBook Pro的扬声器播放音频，因为它的扬声器效果要好得多。"
        },
        {
          "hn_comment_id": 46439507,
          "parent_id": 46434239,
          "author": "episode404",
          "content": "Thank you. I didn't go to film school but I still can easily tell if a TV has those \"enhancements\" turned on. It's horrible and quite weird to me that most people don't seem to realize that something is off when watching movies.",
          "created_at": 1767137686000,
          "content_cn": "谢谢。我虽未上过电影学院，但仍能轻易分辨出电视是否开启了那些“增强功能”。让我感到既可怕又奇怪的是，大多数人在看电影时似乎并未察觉到画面有什么不对劲。"
        },
        {
          "hn_comment_id": 46429584,
          "parent_id": 46429193,
          "author": "pupppet",
          "content": "Netflix shows in particular are ridiculously dark.",
          "created_at": 1767069322000,
          "content_cn": "尤其是Netflix的剧集，暗得离谱。"
        },
        {
          "hn_comment_id": 46431223,
          "parent_id": 46428196,
          "author": "giorgioz",
          "content": "Yes I also let my girlfriend skip the last two episodes. Tyrion Lannister did say \"if you think this has a happy ending, you haven't been paying attention\".",
          "created_at": 1767086397000,
          "content_cn": "是的，我也没让我女朋友看最后两集。提利昂·兰尼斯特确实说过：“如果你以为这会是个美满结局，那你肯定没认真看”。"
        },
        {
          "hn_comment_id": 46429746,
          "parent_id": 46429597,
          "author": "retrac",
          "content": "Perhaps a mixing issue on your end?  Multi-channel audio has the dialog track separated.  So you can increase the volume of the dialog if you want.  Unfortunately I think there is variability in hardware (and software players) in how to down-mix, which sometimes results in background music in the surround channels drowning out the dialog in the centre channel.",
          "created_at": 1767071392000,
          "content_cn": "可能是您那边的混音问题？多声道音频中的对话轨道是独立的，所以您可以根据需要提高对话音量。但遗憾的是，我认为不同硬件（以及软件播放器）在降混处理方式上存在差异，这有时会导致环绕声道中的背景音乐盖过人声的中置声道。"
        },
        {
          "hn_comment_id": 46431163,
          "parent_id": 46430456,
          "author": "pvdebbe",
          "content": "I don't know what kind of a joke you tried here, but I think a vast majority of TV screens can be put in game or PC mode, and all the input lag and stupid picture processing goes away. I run a 43\" LG 4K TV as a PC monitor and never have I had a (flat screen) monitor with a faster response rate! My cinema TV is an old FullHD 42\" Philips that has laughably bad black levels. I run it also in PC mode but the real beauty of this TV is that without further picture processing it produces nice and cinemalike flat color that is true to the input material that I feed it. Flashy capeshit will be flashy and bright, and a muted period drama will stay muted.",
          "created_at": 1767085775000,
          "content_cn": "我不知道你在这里开什么玩笑，但我觉得绝大多数电视屏幕都能切换到游戏或PC模式，这样所有输入延迟和糟糕的图像处理问题都会消失。我用一台43英寸的LG 4K电视当电脑显示器，从没见过响应速度更快的（平板）显示器！我的影院电视是一台老旧的42英寸飞利浦全高清电视，黑色表现差到可笑。我也把它调在PC模式，但这台电视真正的好处在于，关闭额外图像处理后，它能呈现出漂亮且具有电影感的平实色彩，忠实还原我输入的内容。炫目的超英大片会保持鲜艳亮丽，而色调沉静的历史剧则依然保持其含蓄质感。"
        },
        {
          "hn_comment_id": 46439977,
          "parent_id": 46436466,
          "author": "samiwami",
          "content": "wouldn’t something like Black Frame Insertion also fix that?",
          "created_at": 1767141232000,
          "content_cn": "类似黑帧插入技术不也能解决这个问题吗？"
        },
        {
          "hn_comment_id": 46429792,
          "parent_id": 46428201,
          "author": "emkoemko",
          "content": "for me it ruins cinematic content, for sports i don't mind",
          "created_at": 1767071839000,
          "content_cn": "对我来说它破坏了电影内容的观感，但体育节目我倒不介意。"
        },
        {
          "hn_comment_id": 46437803,
          "parent_id": 46436466,
          "author": "scuff3d",
          "content": "It seems to be different for everyone. My wife and her Dad don't even notice the smoothing affect. It drives me and my brother absolutely fucking nuts on the other hand. It makes things basically unwatchable for me, it's so distracting.",
          "created_at": 1767127629000,
          "content_cn": "这似乎是因人而异的。我妻子和她父亲甚至注意不到那种平滑效果。但另一方面，我和我兄弟简直要被它逼疯了。对我来说这基本上让影片没法看，太分神了。"
        },
        {
          "hn_comment_id": 46437592,
          "parent_id": 46436466,
          "author": "zaptheimpaler",
          "content": "Same. I actually was fine watching 24/30FPS on an older TV, but on the 120Hz screen it just looks incredibly juddery without a little motion smoothing.",
          "created_at": 1767126493000,
          "content_cn": "同感。以前在老电视上看24/30帧其实没问题，但在120Hz屏幕上，如果不加点动态补偿，画面抖动感就特别明显。"
        },
        {
          "hn_comment_id": 46429996,
          "parent_id": 46428201,
          "author": "vunderba",
          "content": "The TrueMotion stuff drives me crazy. Chalk it up to being raised on movies filmed at 24fps, plus a heavy dose of FPS games (Wolf, Doom, Quake) as a kid, but frame rate interpolation instantly makes it feel less like a movie and more like I’m watching a weird “Let’s Play.”",
          "created_at": 1767073961000,
          "content_cn": "TrueMotion技术简直让我抓狂。可能因为我从小看惯了24帧的电影，再加上玩过大量FPS游戏（比如《德军总部》《毁灭战士》《雷神之锤》），帧率插值技术总让我感觉不像在看电影，倒像是在看某个诡异的“游戏实况视频”。"
        },
        {
          "hn_comment_id": 46440023,
          "parent_id": 46436466,
          "author": "ranger207",
          "content": "I don't mind natively high framerate, but I can't stand interpolation",
          "created_at": 1767141626000,
          "content_cn": "我不介意原生高帧率，但无法忍受插帧效果。"
        },
        {
          "hn_comment_id": 46433212,
          "parent_id": 46432358,
          "author": "mjklin",
          "content": "My local hummus factory puts the product destined for Costco into a different sized tub than the one destined for Walmart. Companies want to make it hard for the consumer to compare.",
          "created_at": 1767101870000,
          "content_cn": "我本地的鹰嘴豆泥厂为Costco和沃尔玛生产的产品使用了不同尺寸的包装盒。商家就是不想让消费者轻易比较。"
        },
        {
          "hn_comment_id": 46429797,
          "parent_id": 46428235,
          "author": "mikepurvis",
          "content": "Feed the five minute summary back in again to get a one minute summary:https://www.smbc-comics.com/comic/summary",
          "created_at": 1767071871000,
          "content_cn": "将五分钟摘要再次输入以获得一分钟摘要：https://www.smbc-comics.com/comic/summary"
        },
        {
          "hn_comment_id": 46436800,
          "parent_id": 46432358,
          "author": "mkozlows",
          "content": "There is! That is precisely how TVs work! Specs like BT.2020 and BT.2100 define the color primaries, white point, and how colors and brightness levels should be represented. Other specs define other elements of the signal. SMPTE ST 2080 defines what the mastering environment should be, which is where you get the recommendations for bias lighting.This is all out there -- but consumers DO NOT want it, because in a back-to-back comparison, they believe they want (as you'll see in other messages in this thread) displays that are over-bright, over-blue, over-saturated, and over-contrasty. And so that's what they get.But if you want a perfect reference TV, that's what Filmmaker Mode is for, if you've got a TV maker that's even trying.",
          "created_at": 1767121924000,
          "content_cn": "确实如此！这正是电视机的工作原理！像BT.2020和BT.2100这样的标准定义了原色、白点以及色彩和亮度级别的呈现方式。其他标准则规定了信号的其他要素。SMPTE ST 2080定义了母带制作环境的标准，其中就包含了关于偏置照明的建议。这些标准都已存在——但消费者并不想要，因为在直接对比中，他们往往认为（正如您在本帖其他留言中会看到的）自己更喜欢亮度过高、偏蓝、过度饱和且对比度过强的显示效果。于是市场就提供了这样的产品。但如果您想要一台完美的参考级电视，这就是“电影制作人模式”存在的意义——前提是您选择的电视制造商确实在朝这个方向努力。"
        },
        {
          "hn_comment_id": 46439665,
          "parent_id": 46435119,
          "author": "scilro",
          "content": "All you need to fix that is 3:2 pulldown, which all modern TVs should be able to do.Unfortunately this is another basic feature that tends to be \"branded\" on TVs. On my Sony Bravia it's split into a combination of features called Cinemotion and Motionflow.",
          "created_at": 1767138770000,
          "content_cn": "要解决这个问题只需要3:2下拉变换功能，所有现代电视都应该具备这个能力。遗憾的是这又是个常被电视厂商\"贴牌\"的基础功能。在我的索尼Bravia电视上，这个功能被拆分成了名为\"电影模式\"和\"动态流畅\"的组合功能。"
        },
        {
          "hn_comment_id": 46437567,
          "parent_id": 46434239,
          "author": "zaptheimpaler",
          "content": "My TV is mostly calibrated to turning off all the processing and D65 white point (Warm 2 on Samsungs) but I can't watch unsmoothed 24p content on the 120Hz screen anymore - it looks incredibly juddery and sort of nausea-inducing. I don't recall having this issue on an older cheap Hisense TV, maybe there's something about higher refresh rate that makes the 24FPS really look bad.",
          "created_at": 1767126364000,
          "content_cn": "我的电视基本都校准为关闭所有处理功能并设定D65白点（三星电视上对应暖色温2档），但我现在完全无法在120Hz屏幕上观看未经平滑处理的24帧内容——画面会出现令人难以置信的卡顿感，甚至有些引发眩晕。我记得以前在老旧廉价的海信电视上没遇到过这种问题，或许高刷新率屏幕确实会让24帧率内容显得格外糟糕。"
        },
        {
          "hn_comment_id": 46436707,
          "parent_id": 46435775,
          "author": "nosianu",
          "content": "I would buy that argument if it was deliberate, but the consumers in this case are passive and just have to endure whatever is set before them. Few even try changing the available settings, possibly apart from the most basic ones.In a Greek restaurant I sometimes eat at there's a TV set to some absurdly high color saturation, colors are at 180%. It's been like that for years. Nobody ever even commented on it, even though it is so very very clearly uncomfortably extreme.",
          "created_at": 1767121341000,
          "content_cn": "如果这是有意为之，我或许会接受这种说法，但这里的消费者是被动的，只能被动接受摆在眼前的一切。几乎没人尝试调整可用的设置，可能除了最基本的选项。在我常去的一家希腊餐厅，电视的色彩饱和度被调得极高，色彩浓度达到了180%。多年来一直如此。尽管画面明显极端到令人不适，却从未有人对此提出过意见。"
        },
        {
          "hn_comment_id": 46437348,
          "parent_id": 46435775,
          "author": "pwdisswordfishy",
          "content": "At least when people think that ketchup belongs on steak, that's a choice they're making that only affects themselves.  They don't insist on squirting it on your side of the table because you happen to be sharing a meal.",
          "created_at": 1767124946000,
          "content_cn": "至少当人们认为牛排应该配番茄酱时，那是他们自己的选择，只影响他们自己。他们不会因为碰巧和你共进晚餐，就坚持要把番茄酱挤到你那边。"
        },
        {
          "hn_comment_id": 46438207,
          "parent_id": 46435775,
          "author": "driverdan",
          "content": "> eating pizza with a forkThat's a weird one to include. It doesn't impact the pizza at all, it still tastes the same. Plus it's common to eat pizza with a fork in Italy.",
          "created_at": 1767130011000,
          "content_cn": "用叉子吃披萨，这个选项有点奇怪。这根本不影响披萨的口感，味道还是一样。而且在意大利用叉子吃披萨其实挺常见的。"
        },
        {
          "hn_comment_id": 46435269,
          "parent_id": 46430026,
          "author": "asimovDev",
          "content": "from what I heard, the actions scenes are shot in 48 fps and others are in 24 fps or something along those lines. You might be talking about that ?",
          "created_at": 1767113915000,
          "content_cn": "据我所知，动作场景是以48帧每秒拍摄的，其他部分则是24帧每秒左右。你指的是这个吗？"
        },
        {
          "hn_comment_id": 46435412,
          "parent_id": 46435259,
          "author": "neom",
          "content": "I'm guessing you've never had a good friend or relative come over and then rearrange something in your house because how it's done bothers them? That's a thing that happens.",
          "created_at": 1767114573000,
          "content_cn": "我猜你从没遇到过好朋友或亲戚来家里，然后因为看不惯某样东西的摆放方式就动手重新整理的情况吧？这种事确实会发生。"
        },
        {
          "hn_comment_id": 46432285,
          "parent_id": 46431739,
          "author": "YmiYugy",
          "content": "The Mid-Atlantic accent has fallen out of favor since at least the latter part of the 50s.\nThe issue with hard to understand dialog is a much more recent phenomenon.",
          "created_at": 1767094766000,
          "content_cn": "中大西洋口音至少从50年代后期开始就不再流行。\n难以理解的对话问题则是近年才出现的现象。"
        },
        {
          "hn_comment_id": 46430210,
          "parent_id": 46428313,
          "author": "01100011",
          "content": "All of the characters are constantly arguing with each other. The story line requires constant suspension of belief based on the endless succession of improbable events and improbable character behaviors. Contradictions with earlier episodes and even details within the same episode.  It's really bad.  I hope the final episode redeems it but I have my doubts.  I want to have an LLM rewrite season 5 and see how much it improves.",
          "created_at": 1767076311000,
          "content_cn": "所有角色都在不停地互相争吵。剧情需要观众不断放弃逻辑，因为接连发生的事件和角色行为都极不合理。与之前剧集甚至同一集内的细节都存在矛盾。实在太糟糕了。希望最后一集能挽回局面，但我对此表示怀疑。真想让大型语言模型重写第五季，看看能改进多少。"
        },
        {
          "hn_comment_id": 46430024,
          "parent_id": 46429893,
          "author": "mhitza",
          "content": "Sure, but it's the job of whoever is mastering the audio to take such constraints into account.",
          "created_at": 1767074250000,
          "content_cn": "当然，但考虑这些限制条件是音频母带处理人员的职责。"
        },
        {
          "hn_comment_id": 46428359,
          "parent_id": 46428313,
          "author": "redundantly",
          "content": "It really isn't. I keep seeing comparisons to the last seasons of Game of Thrones, but while there is a dip in quality this season, it is no where near as bad as what happened to GoT.",
          "created_at": 1767057624000,
          "content_cn": "事实并非如此。我总看到有人拿它和《权力的游戏》最后几季比较，虽然本季质量确实有所下滑，但远不及《权游》崩坏的程度。"
        },
        {
          "hn_comment_id": 46430314,
          "parent_id": 46429893,
          "author": "array_key_first",
          "content": "If anything I'd say speakers have only gotten shittier as screens have thinned out. And it used to be fairly common for people to have dedicated speakers, but not anymore.Just anecdotally, I can tell speaker tech has progressed slowly. Stepping in a car from 20 years ago sound... pretty good, actually.",
          "created_at": 1767077542000,
          "content_cn": "如果非要我说的话，随着屏幕变薄，扬声器反而越来越差了。过去人们普遍会配备专用扬声器，但现在已不常见。仅凭个人经验，我就能断定扬声器技术进展缓慢。坐进20年前的汽车里，音效其实……相当不错。"
        },
        {
          "hn_comment_id": 46429942,
          "parent_id": 46429893,
          "author": "greatgib",
          "content": "It is a well known issue:\nhttps://zvox.com/blogs/news/why-can-t-i-hear-dialogue-on-tv-...I don't find the source anymore but I think that I saw that it was even a kind of small conspiracy on tv streaming so that you set your speakers louder and then the advertisement time arrive you will hear them louder than your movie.Officially it is just that they switch to a better encoding for ads (like mpeg2 to MPEG-4 for DVB) but unofficially for the money as always...",
          "created_at": 1767073327000,
          "content_cn": "这是一个众所周知的问题：\nhttps://zvox.com/blogs/news/why-can-t-i-hear-dialogue-on-tv-...\n我找不到原始出处了，但记得曾看到过一种说法：这甚至是电视流媒体领域的小型阴谋——他们故意让你调高扬声器音量，这样广告时段来临时，广告声音就会比电影内容更响亮。官方解释是他们为广告切换了更好的编码格式（比如DVB从MPEG-2转为MPEG-4），但非正式地说，终究还是为了利益……"
        },
        {
          "hn_comment_id": 46429819,
          "parent_id": 46429584,
          "author": "etempleton",
          "content": "Heavily compressed.",
          "created_at": 1767072051000,
          "content_cn": "压缩得非常厉害。"
        },
        {
          "hn_comment_id": 46433169,
          "parent_id": 46429893,
          "author": "mancerayder",
          "content": "I have a relatively high end speaker setup (Focal Chora bookshelves and a Rotel stereo receiver all connected to the PC and AppleTV via optical cable) and I suffer from the muffled dialogue situation.   I end up with subtitles, and I thought I was going deaf.",
          "created_at": 1767101539000,
          "content_cn": "我有一套相对高端的音响设备（Focal Chora书架箱和Rotel立体声接收器，全部通过光纤线连接到电脑和AppleTV），但一直饱受对话声音沉闷的困扰。最终我只能依赖字幕，甚至一度怀疑自己是不是听力下降了。"
        },
        {
          "hn_comment_id": 46431508,
          "parent_id": 46431223,
          "author": "dark-star",
          "content": "As someone who hasn't watched GoT, only heard of it from others, let me guess: In those two episodes everyone dies a very cruel and painful death, except for one or two main characters?",
          "created_at": 1767089120000,
          "content_cn": "作为一个没看过《权力的游戏》、只是听别人提起过的人，让我猜猜：是不是在那两集里，除了少数一两个主角，其他人都死得特别惨烈痛苦？"
        },
        {
          "hn_comment_id": 46432170,
          "parent_id": 46431223,
          "author": "squigz",
          "content": "That was Ramsay Bolton who said that, I believe.",
          "created_at": 1767093946000,
          "content_cn": "我记得那是拉姆斯·波顿说的。"
        },
        {
          "hn_comment_id": 46430792,
          "parent_id": 46429746,
          "author": "deelowe",
          "content": "Sometimes it's because the original mix was for theater surround sound and lower mixes were generated via software.",
          "created_at": 1767082556000,
          "content_cn": "有时是因为原混音是为影院环绕声设计的，而较低质量的混音是通过软件生成的。"
        },
        {
          "hn_comment_id": 46430190,
          "parent_id": 46429746,
          "author": "ludicrousdispla",
          "content": "It's an issue even in theaters and is the main reason I prefer to watch new releases at home on DVD (Dune I saw in the theater, Dune 2 I watched at home.)",
          "created_at": 1767076163000,
          "content_cn": "这个问题在影院里也存在，这也是我更喜欢在家看DVD新片的主要原因（《沙丘1》我是在影院看的，《沙丘2》则是在家看的）。"
        },
        {
          "hn_comment_id": 46430239,
          "parent_id": 46429746,
          "author": "josephg",
          "content": "Is there a way to do this in vlc? I run into this problem constantly - especially when 5.1 audio gets down mixed to my stereo setup.",
          "created_at": 1767076700000,
          "content_cn": "在VLC中有办法解决这个问题吗？我经常遇到这个问题——特别是当5.1声道音频被降混到我的立体声设备时。"
        },
        {
          "hn_comment_id": 46429787,
          "parent_id": 46429746,
          "author": "mikepurvis",
          "content": "It's reasonable for the 5.1 mix to have louder atmosphere and be more dependent on directionality for the viewer to pick the dialog out of the center channel. However, all media should also be supplying a stereo mix where the dialog is appropriately boosted.",
          "created_at": 1767071763000,
          "content_cn": "5.1声道混音中环境音效更响亮、更依赖方向性让观众从中央声道辨识对话是合理的。但所有媒体内容也应提供立体声混音版本，其中对话音量需得到适当提升。"
        },
        {
          "hn_comment_id": 46430597,
          "parent_id": 46429746,
          "author": "aidenn0",
          "content": "> Multi-channel audio has the dialog track separated. So you can increase the volume of the dialog if you wantAre you talking about the center channel on an X.1 setup or something else?  My Denon AVR certainly doesn't have a dedicated setting for dialog, but I can turn up the center channel which yields variable results for improved audio clarity.  Note that DVDs and Blurays from 10+ years ago are easily intelligible without any of this futzing.",
          "created_at": 1767080532000,
          "content_cn": "多声道音频已将对话音轨分离，因此您可以根据需要提高对话音量。您指的是X.1设置中的中置声道还是其他配置？我的天龙功放确实没有专门的对话设置，但我可以调高中置声道，这对提升音频清晰度的效果参差不齐。需要注意的是，十多年前的DVD和蓝光碟片即使不进行这些调整，其对话也通常清晰可辨。"
        },
        {
          "hn_comment_id": 46429973,
          "parent_id": 46429792,
          "author": "tartoran",
          "content": "It ruins it for me as well but from my understanding many people can't tell the difference.",
          "created_at": 1767073676000,
          "content_cn": "这对我来说也毁了体验，但据我了解，很多人分辨不出区别。"
        },
        {
          "hn_comment_id": 46438247,
          "parent_id": 46437803,
          "author": "driverdan",
          "content": "If they don't notice then they won't notice when you turn it off.",
          "created_at": 1767130212000,
          "content_cn": "如果他们没注意到，那么关掉时他们也不会察觉。"
        },
        {
          "hn_comment_id": 46429833,
          "parent_id": 46429597,
          "author": "pezezin",
          "content": "English is my second language and I always though my lack of understanding was a skill issue.Then I noticed that native speakers also complain.Then I started to watch YouTube channels, live TV and old movies, and I found out I could understand almost everything! (depending on the dialect)When even native speakers can't properly enjoy modern movies and TV shows, you know that something is very wrong...",
          "created_at": 1767072140000,
          "content_cn": "英语是我的第二语言，我一直以为听不懂是自己的水平问题。后来我发现母语者也在抱怨。于是我开始看YouTube频道、直播电视和老电影，发现自己几乎全能听懂！（取决于方言）当连母语者都无法好好欣赏现代影视作品时，你就知道问题很严重了……"
        },
        {
          "hn_comment_id": 46431193,
          "parent_id": 46429833,
          "author": "NewEntryHN",
          "content": "To be fair, the diction in modern movies is different than the diction in all other examples you mentioned. YouTube and live TV is very articulate, and old movies are theater-like in style.",
          "created_at": 1767086063000,
          "content_cn": "平心而论，现代电影的台词风格与你提到的其他例子都不同。YouTube和电视直播的表述非常清晰，而老电影则带有戏剧化的风格。"
        },
        {
          "hn_comment_id": 46430532,
          "parent_id": 46429833,
          "author": "bee_rider",
          "content": "The sound mixing does seem to have gotten much worse over time.But also, people in old movies often enunciated very clearly as a stylistic choice. The Transatlantic accent—sounds a bit unnatural but you can follow the plot.",
          "created_at": 1767079913000,
          "content_cn": "随着时间的推移，声音混音确实似乎变得更糟了。但另一方面，老电影中的人物常常为了风格选择而发音非常清晰。那种跨大西洋口音——听起来有点不自然，但你能跟上剧情。"
        },
        {
          "hn_comment_id": 46430157,
          "parent_id": 46429833,
          "author": "UberFly",
          "content": "I \"upgraded\" from a 10 year old 1080p Vizio to a 4K LG and the sound is the worst part of the experience. It was very basic and consistent with our old TV but now it's all over the place. It's now a mangled mess of audio that's hard to understand.",
          "created_at": 1767075626000,
          "content_cn": "我从用了十年的1080p Vizio电视“升级”到4K LG电视，音效成了最糟糕的部分。以前虽然基础但稳定，现在却杂乱无章，声音混成一团难以听清。"
        },
        {
          "hn_comment_id": 46433574,
          "parent_id": 46429833,
          "author": "lanyard-textile",
          "content": "English is my native language and I always watch with captions on. It is ridiculous :)",
          "created_at": 1767104575000,
          "content_cn": "英语是我的母语，但我看视频时总是开着字幕。这真是太可笑了 :)"
        },
        {
          "hn_comment_id": 46433823,
          "parent_id": 46429833,
          "author": "gwbas1c",
          "content": "The problem is that a lot of content today is mixed so that effects like explosions and gunshots are LOUD, whispers are quiet, and dialog is normal.It only works if you're watching in a room that's acoustically quiet, like a professional recording studio. Once your heater / air conditioner or other appliance turns on, it drowns out everything but the loudest parts of the mix.Otherwise, the problem is that you probably don't want to listen to ear-splitting gunshots and explosions, then turn it down to a normal volume, only to make the dialog and whispers unintelligible. I hit this problem a lot watching TV after the kids go to bed.",
          "created_at": 1767106128000,
          "content_cn": "问题在于如今许多影视内容的音效混合方式导致爆炸和枪声震耳欲聋，耳语轻不可闻，对白则保持正常音量。这种设计只有在声学环境安静的空间（如专业录音室）才能正常呈现。一旦室内暖气、空调或其他电器启动，除了混音中最响亮的片段外，其余声音都会被噪音淹没。更麻烦的是，观众通常不愿忍受刺耳的枪战爆炸声，调低音量后却又发现对白和耳语变得模糊不清。我在孩子睡觉后看电视时经常遇到这种困扰。"
        },
        {
          "hn_comment_id": 46434023,
          "parent_id": 46431739,
          "author": "drdec",
          "content": ">Most native speakers seem to be convinced that vowels are the most important part of EnglishAs a native English speaker studying Spanish, my impression is that English cares about the consonants and Spanish is way more about the vowels.\nYMMV",
          "created_at": 1767107312000,
          "content_cn": "大多数英语母语者似乎都坚信元音是英语最重要的部分。作为一名学习西班牙语的英语母语者，我的印象是英语更注重辅音，而西班牙语则更侧重于元音。个人体验可能有所不同。"
        }
      ]
    },
    {
      "hn_id": 46395714,
      "title": "Karpathy on Programming: “I've never felt this much behind”",
      "url": "https://twitter.com/karpathy/status/2004607146781278521",
      "content": null,
      "points": 511,
      "comment_count": 569,
      "author": "rishabhaiover",
      "created_at": 1766779929000,
      "title_cn": "卡帕西谈编程：“我从未感到如此落后”",
      "content_cn": null,
      "abstract": "讨论要点：I admit to pangs of this, but it's really never made any sense because the implication is that the profession is now magically closed off to newcomers.Imagine someone in the 90s saying \"if you don't m...",
      "comments": [
        {
          "hn_comment_id": 46425598,
          "parent_id": null,
          "author": "brandonmenc",
          "content": "I admit to pangs of this, but it's really never made any sense because the implication is that the profession is now magically closed off to newcomers.Imagine someone in the 90s saying \"if you don't master the web NOW you will be forever behind!\" and yet 20 years later kids who weren't even born then are building web apps and frameworks.Waiting for it to all shake out and \"mastering\" it then is still a strategy. The only thing you'll sacrifice is an AI funding lottery ticket.",
          "created_at": 1767041942000,
          "content_cn": "我承认对此有过一阵焦虑，但这其实毫无道理，因为这种想法暗示着这个行业现在神奇地对新人关闭了。想象一下90年代有人说“如果你现在不掌握网络技术，你将永远落后！”然而20年后，那些当时甚至还没出生的孩子们正在构建网络应用和框架。等待一切尘埃落定再去“掌握”它，这依然是一种策略。你唯一可能牺牲的，只是一张人工智能领域的投资彩票。"
        },
        {
          "hn_comment_id": 46426472,
          "parent_id": 46425598,
          "author": "yoyohello13",
          "content": "Finally a voice of reason. The tools will just get better and easier to use. I use LLMs now, but I'm not going to dump a bunch of time learning the new hotness. I'll let other people do that and pickup the useful pieces later.Unless your gunning for a top position as a vibe coder, this whole concept of \"falling behind\" is just pure FOMO.",
          "created_at": 1767046793000,
          "content_cn": "终于有人说了句公道话。这些工具只会越来越好用、越来越容易上手。我现在也在用大语言模型，但不会花大把时间去追新潮技术。让别人去折腾吧，等有用的功能成熟了我再捡现成的。除非你立志要当顶尖的氛围程序员，否则这种“落后就要挨打”的说法纯粹是贩卖焦虑。"
        },
        {
          "hn_comment_id": 46435630,
          "parent_id": 46426472,
          "author": "estimator7292",
          "content": "Same. I only just started using agents a few months ago.Earlier this year the ecosystem was still a mess I didn't have time to untangle. Now things are relatively streamlined and simple. Arguably stable, even.I feel behind, sure, but I also don't think people on the bleeding edge are getting that much more utility that it's worth sinking dozens or hundreds of my very limited hours into understanding.Besides, I'm a C programmer. I'll always be several decades behind the trend. I'm fine with that.",
          "created_at": 1767115582000,
          "content_cn": "同感。我也是几个月前才开始使用智能体。今年早些时候这个生态系统还一团糟，我根本没时间去理清。现在情况相对规范简单了，甚至可以说是稳定了。我确实觉得自己落后了，但我也认为那些走在最前沿的人并没有获得那么多额外的实用价值，值得我投入极其有限的几十甚至几百个小时去理解。再说了，我是C语言程序员，永远都会比潮流落后几十年。我对此很坦然。"
        },
        {
          "hn_comment_id": 46426185,
          "parent_id": null,
          "author": "flumpcakes",
          "content": "> There's a new programmable layer of abstraction to master (in addition to the usual layers below) involving agents, subagents, their prompts, contexts, memory, modes, permissions, tools, plugins, skills, hooks, MCP, LSP, slash commands, workflows, IDE integrations, and ...This sounds unbearable. It doesn't sound like software development, it sounds like spending a thousand hours tinkering with your vim config. It reminds me of the insane patchwork of sprawl you often get in DevOps - but now brought to your local machine.I honestly don't see the upside, or how it's supposed to make any programmer worth their weight in salt 10x better.",
          "created_at": 1767045071000,
          "content_cn": "除了要掌握常规的基础层级外，现在又多了一个新的可编程抽象层需要精通，其中涉及智能体、子智能体、它们的提示词、上下文、记忆、模式、权限、工具、插件、技能、钩子、MCP、LSP、斜杠命令、工作流、IDE集成等等……这听起来简直难以忍受。这不像软件开发，倒像是花上千小时折腾你的vim配置。这让我想起了DevOps中常见的那种疯狂拼凑的臃肿体系——但现在这一切都搬到了你的本地机器上。老实说，我看不出这有什么好处，也不明白它怎么能让任何一个称职的程序员效率提升十倍。"
        },
        {
          "hn_comment_id": 46425398,
          "parent_id": null,
          "author": "reconnecting",
          "content": "> OpenAI's sales and marketing expenses increased to _$2 billion_ in the first half of 2025.Looks like AI companies spend enough on marketing budgets to create the illusion that AI makes development better.Let's wait one more year, and perhaps everyone who didn't fall victim to these \"slimming pills” for developers' brains will be glad about the choice they made.",
          "created_at": 1767041100000,
          "content_cn": "OpenAI在2025年上半年的销售和营销支出增至20亿美元。看来AI公司在营销预算上投入足够多，以制造AI能让开发变得更好的假象。让我们再等一年，或许那些没有成为开发者大脑“减肥药”受害者的人会为自己的选择感到庆幸。"
        },
        {
          "hn_comment_id": 46428121,
          "parent_id": null,
          "author": "BhavdeepSethi",
          "content": "Most of the folks that are talking about this are the ones who work independently and work on greenfield projects (especially tooling related). The cost of making a mistake there is so low. I've used it similarly and it's absolutely amazing. Though I still use a mix of agents and code myself in my regular 9-5 job.I've yet to see examples of folks using this in a team of 4+ folks working together in a production env with users, and just using AI for their regular development.Claude code creator only using claude code doesn't count. That's more like dog-fooding.",
          "created_at": 1767055797000,
          "content_cn": "大多数讨论这个话题的人都是独立工作、从事全新项目（尤其是工具类项目）的开发者。在这些项目中犯错的成本极低。我以类似方式使用过它，效果确实惊人。不过在我日常的朝九晚五工作中，仍然会混合使用智能助手和手动编码。目前我还没见过在四人以上团队、生产环境、有真实用户的项目中，开发者纯粹依靠人工智能进行常规开发的案例。仅使用Claude代码生成器的情况不算数，那更像是内部测试。"
        },
        {
          "hn_comment_id": 46408215,
          "parent_id": null,
          "author": "superze",
          "content": "As an Opus user, I genuinely don’t understand how someone can work for weeks or months without regularly opening an IDE. The output almost always fails.I repeatedly rewrite prompts, restate the same constraints, and write detailed acceptance criteria, yet still end up with broken or non-functional code.its very frustrating to say the least Yesterday alone I spent about $200 on generations that now require significant manual rewrites just to make them work.At that point, the gains are questionable. My biggest success is having the model take over the first Design in my app and I take it from there, but those hundred lines if not thousand lines of code it generates are so Messi, it's insanely painful to refactor the mess afterwards",
          "created_at": 1766893558000,
          "content_cn": "作为一名Opus用户，我实在无法理解有人能连续几周甚至几个月不打开集成开发环境工作。这样产生的代码几乎总是无法运行。我反复修改指令、重申相同的限制条件、编写详细的验收标准，却仍然得到残缺或无法运行的代码，这至少可以说令人非常沮丧。仅昨天一天，我就在生成代码上花费了约200美元，而现在还需要大量手动重写才能让这些代码正常工作。到了这个地步，其效益实在存疑。我最大的成功案例是让模型接手了我应用中的初始设计部分，然后由我继续推进，但它生成的那几百行甚至上千行代码如此混乱，后续重构这些烂摊子的过程简直痛苦到令人抓狂。"
        },
        {
          "hn_comment_id": 46430064,
          "parent_id": null,
          "author": "optician_owl",
          "content": "Oh. This is a pretty stereotypical character among data scientists. This character thinks software development is all about generating text, and because they know how to generate text, they're automatically considered an expert. But they know nothing about the software lifecycle. Working with them is a real pain, especially when they shift responsibility for their \"software\" to your engineers.",
          "created_at": 1767074662000,
          "content_cn": "哦，这真是数据科学家中一个相当典型的形象。这类人认为软件开发就是生成文本，并且因为他们知道如何生成文本，就自动被视为专家。但他们对于软件生命周期一无所知。与他们共事真是令人头疼，尤其是当他们把“软件”的责任推给你的工程师时。"
        },
        {
          "hn_comment_id": 46425365,
          "parent_id": null,
          "author": "Aldipower",
          "content": "I am a software developer and mainly a programmer for decades now. I love programming. I love to be \"once\" with the computer. I will never give this joy up. If I need to sell shoes at daytime, I will program real computer programs in the evenings. If it won't be possible with modern machinery anymore, I will take my Commodore 64. I am a free man.Edit: Corrected since/for. :-)",
          "created_at": 1767041001000,
          "content_cn": "我是一名软件开发人员，几十年来主要担任程序员。我热爱编程，享受与计算机“融为一体”的感觉。我永远不会放弃这份快乐。即使白天需要去卖鞋，晚上我也会编写真正的计算机程序。如果现代设备无法再满足这种可能，我会搬出我的Commodore 64。我是一个自由的人。编辑：更正了since/for的用法。:-)"
        },
        {
          "hn_comment_id": 46426261,
          "parent_id": null,
          "author": "xg15",
          "content": "And there it is again, the \"powerful alien tool\" that was just \"handed to us\".No decades of research and massive allocation of resources over the last few years as well as very intentional decision making by tech leadership to develop this specific technology.Nope, it just mysteriously dropped from the sky one day.",
          "created_at": 1767045476000,
          "content_cn": "又来了，那个\"强大的外星工具\"就这么\"送到我们手上\"了。没有数十年的研究，没有近年来大量的资源投入，也没有科技领导层为发展这项特定技术所做的深思熟虑的决策。不，它只是某天神秘地从天而降。"
        },
        {
          "hn_comment_id": 46425127,
          "parent_id": null,
          "author": "rambojohnson",
          "content": "What exhausts me isn’t “falling behind.” It’s watching the profession collectively decide that the solution to uncertainty is to pile abstraction on top of abstraction until no one can explain what’s actually happening anymore.This agentic arms race by C-suite know-nothings feels less like leverage and more like denial. We took a stochastic text generator, noticed it lies confidently, wipes entire databases and harddrives, and responded by wrapping it in managers, sub-agents, memories, tools, permissions, workflows, and orchestration layers so we don’t have to look directly at the fact that it still doesn’t understand anything.Now we’re expected to maintain a mental model not just of our system, but of a swarm of half-reliable interns talking to each other in a language that isn’t executable, reproducible, or stable.Work now feels duller than dishwater, enough to have forced me to career pivot for 2026.",
          "created_at": 1767039814000,
          "content_cn": "真正让我疲惫的并非“落后于人”，而是目睹整个行业集体认定：面对不确定性时，解决方案就是不断堆叠抽象层，直到再无人能解释实际发生的一切。这场由高管层无知者推动的智能体军备竞赛，与其说是杠杆效应，不如说是集体逃避。我们拿一个随机文本生成器，发现它会面不改色地撒谎、清空整个数据库和硬盘，却选择用管理层、子代理、记忆模块、工具集、权限系统、工作流和编排层将其层层包裹——只为不必直视它依然什么都不懂的事实。如今我们不仅要维护系统的思维模型，还得理解一群半吊子实习生用非可执行、不可复现且不稳定的语言互相沟通的混乱状态。工作变得比洗碗水更乏味，这足以迫使我在2026年彻底转换职业轨道。"
        },
        {
          "hn_comment_id": 46402969,
          "parent_id": null,
          "author": "gaigalas",
          "content": "> Clearly some powerful alien tool was handed around except it comes with no manualUsing tools before their manual exists is the oldest human trick, not the newest.",
          "created_at": 1766853434000,
          "content_cn": "显然某种强大的外星工具被传阅使用，只是没有附带说明书。在说明书出现前就使用工具是人类最古老的把戏，而非最新鲜的。"
        },
        {
          "hn_comment_id": 46429036,
          "parent_id": null,
          "author": "hamstergene",
          "content": "I feel like many people in the comments aren't aware that Karpathy is an ML scientist for whom programming is a complementary skill, not a profession. The only reason he came up with \"vibe coding\" is because maximum complexity of his hobby projects made it seem believable. Maybe take his opinions about fate of programming with a grain of salt.He is brilliant no doubt, but not in that field.",
          "created_at": 1767063480000,
          "content_cn": "我觉得评论区很多人似乎没意识到，卡帕西是一位机器学习科学家，编程对他而言只是辅助技能而非主业。他提出“氛围编程”这个概念，纯粹是因为他业余项目的复杂度上限让这个说法显得可信。或许我们该对他关于编程命运的见解持保留态度。他无疑才华横溢，但并非在这个领域。"
        },
        {
          "hn_comment_id": 46428830,
          "parent_id": null,
          "author": "justatdotin",
          "content": "I think it's mistaken to think in terms of 'falling behind' or 'catching up'I've seen that these tools have different uses for different devs. I know on my current team, each of us devs works very differently to one another, and we make significant allowances to accommodate for one another's different styles. Certain tasks always go to certain devs; one dev is like a steel trap, another is the chaos explorer, another's a beginner, another has great big-picture perspective, etc. (not sure why but there's even space for myself ;)In the same way, different devs use these powerful tools in very different ways. So don't imagine you're falling behind, because the only useful benchmark is yourself. And don't imagine you can wait for consensus: you'll still need to identify your personal relationship to the tools.Most of all, don't be discouraged. Even if you never embrace these tools, there will remain space for your skills and your style of approaching our shared work.Give it another 10 years and I'm sure this will all become clearer...",
          "created_at": 1767061811000,
          "content_cn": "I think it's mistaken to think in terms of 'falling behind' or 'catching up'I've seen that these tools have different uses for different devs. I know on my current team, each of us devs works very differently to one another, and we make significant allowances to accommodate for one another's different styles. Certain tasks always go to certain devs; one dev is like a steel trap, another is the chaos explorer, another's a beginner, another has great big-picture perspective, etc. (not sure why but there's even space for myself ;)In the same way, different devs use these powerful tools in very different ways. So don't imagine you're falling behind, because the only useful benchmark is yourself. And don't imagine you can wait for consensus: you'll still need to identify your personal relationship to the tools.Most of all, don't be discouraged. Even if you never embrace these tools, there will remain space for your skills and your style of approaching our shared work.Give it another 10 years and I'm sure this will all become clearer..."
        },
        {
          "hn_comment_id": 46425306,
          "parent_id": null,
          "author": "gghffguhvc",
          "content": "My company takes between Christmas and New Years off. I took a week before that off too. I have not used AI in that time. The slower pace of life is amazing. But when I get back to coding it will be back to running at 180%. It’s the new norm. However I’ve decided to take longer “no computer” breaks in my day. I have to adapt but I need to defend my “take it slow” times and find some analogue hobbies. The shift is real and you can’t wind it back.",
          "created_at": 1767040716000,
          "content_cn": "My company takes between Christmas and New Years off. I took a week before that off too. I have not used 人工智能 in that time. The slower pace of life is amazing. But when I get back to coding it will be back to running at 180%. It’s the new norm. However I’ve decided to take longer “no computer” breaks in my day. I have to adapt but I need to defend my “take it slow” times and find some analogue hobbies. The shift is real and you can’t wind it back."
        },
        {
          "hn_comment_id": 46438380,
          "parent_id": null,
          "author": "tired_and_awake",
          "content": "Early adopters will early adopt. They will toil,feedback, improve, repeat. Tools will over optimize then dramatically shift based on learnings.This chaps will continue until something moderately productive and easily adoptable comes out. FOMO will strike all of us from time to time. Some of us will even try out the latest and greatest and see if it sticks.Some companies will mandate arbitrary code generation standards because \"it's the basis of their success\", it will polarize their talent pool. Later, it will be impossible to determine if they were (not) successful \"inspite of\" or \"because of\" such wild decisions.",
          "created_at": 1767131018000,
          "content_cn": "Early adopters will early adopt. They will toil,feedback, improve, repeat. Tools will over optimize then dramatically shift based on learnings.This chaps will continue until something moderately productive and easily adoptable comes out. FOMO will strike all of us from time to time. Some of us will even try out the latest and greatest and see if it sticks.Some companies will mandate arbitrary code generation standards because \"it's the basis of their success\", it will polarize their talent pool. Later, it will be impossible to determine if they were (not) successful \"inspite of\" or \"because of\" such wild decisions."
        },
        {
          "hn_comment_id": 46395794,
          "parent_id": null,
          "author": "rishabhaiover",
          "content": "For the longest time, the joy of creation in programming came from solving hard problems. The pursuit of a challenge meant something. Now, that pursuit seems to be short-circuited by an animated being racing ahead under a different set of incentives. I see a tsunami at the beach, and I’m not sure whether I can run fast enough.",
          "created_at": 1766780453000,
          "content_cn": "For the longest time, the joy of creation in programming came from solving hard problems. The pursuit of a challenge meant something. Now, that pursuit seems to be short-circuited by an animated being racing ahead under a different set of incentives. I see a tsunami at the beach, and I’m not sure whether I can run fast enough."
        },
        {
          "hn_comment_id": 46429236,
          "parent_id": null,
          "author": "noosphr",
          "content": "The only time I've felt this much behind was in high school when everyone was talking about how much sex they were having.AI code is the Canadian girlfriend of programming.",
          "created_at": 1767065495000,
          "content_cn": "The only time I've felt this much behind was in high school when everyone was talking about how much sex they were having.人工智能 code is the Canadian girlfriend of programming."
        },
        {
          "hn_comment_id": 46431002,
          "parent_id": 46425598,
          "author": "zerr",
          "content": "And here I am partying (coding) like it's 90s (C++ desktop apps) and web never happened... :)",
          "created_at": 1767084429000,
          "content_cn": "And here I am partying (coding) like it's 90s (C++ desktop apps) and web never happened... :)"
        },
        {
          "hn_comment_id": 46429355,
          "parent_id": 46425598,
          "author": "SoftTalker",
          "content": "People did say that in the 90s. Hence the rush to put everything on the web, whether there was any real business case for it or not. And most of it went up in flames at the end of that decade.",
          "created_at": 1767066766000,
          "content_cn": "People did say that in the 90s. Hence the rush to put everything on the web, whether there was any real business case for it or not. And most of it went up in flames at the end of that decade."
        },
        {
          "hn_comment_id": 46428338,
          "parent_id": null,
          "author": "clejack",
          "content": "For the folks who have more positive outlooks how often do you change your code after it's been generated?I haven't used agents much for coding, but I noticed that when I do have something created with the slightest complexity, it's never perfect and I have to go back and change it. This is mostly fine, but when large chunks of code are created, I don't have much context for editing things manually.It's like waking up in a new house that you've never seen before. Sure I recognize the type of rooms, the furniture, the outlets, appliances, plumbing, and so on when I see them; but my sense of orientation is strained.This is my main issue at the moment.",
          "created_at": 1767057433000,
          "content_cn": "For the folks who have more positive outlooks how often do you change your code after it's been generated?I haven't used agents much for coding, but I noticed that when I do have something created with the slightest complexity, it's never perfect and I have to go back and change it. This is mostly fine, but when large chunks of code are created, I don't have much context for editing things manually.It's like waking up in a new house that you've never seen before. Sure I recognize the type of rooms, the furniture, the outlets, appliances, plumbing, and so on when I see them; but my sense of orientation is strained.This is my main issue at the moment."
        },
        {
          "hn_comment_id": 46427022,
          "parent_id": null,
          "author": "bmitch3020",
          "content": "https://xcancel.com/karpathy/status/2004607146781278521",
          "created_at": 1767049112000,
          "content_cn": "https://xcancel.com/karpathy/status/2004607146781278521"
        },
        {
          "hn_comment_id": 46403304,
          "parent_id": null,
          "author": "xzkll",
          "content": "Does any of you bother the fact that now you have to pay money in order to do your job? I mean AI model subscriptions. Somehow it feels wrong for me to pay for tools that are trying to replace me.",
          "created_at": 1766855860000,
          "content_cn": "Does any of you bother the fact that now you have to pay money in order to do your job? I mean 人工智能 model subscriptions. Somehow it feels wrong for me to pay for tools that are trying to replace me."
        },
        {
          "hn_comment_id": 46431206,
          "parent_id": 46426472,
          "author": "Ekaros",
          "content": "Doing small project for customer. They have explicit instructions that I can't even use some unapproved AI... So well they are paying. So until it is actually forced I see no pressure to move there.And rest of my field. Automated tools do part of work. AI probably some, but not enough of actually verifying findings and then properly explaining the context and implications.",
          "created_at": 1767086215000,
          "content_cn": "Doing small project for customer. They have explicit instructions that I can't even use some unapproved 人工智能... So well they are paying. So until it is actually forced I see no pressure to move there.And rest of my field. Automated tools do part of work. 人工智能 probably some, but not enough of actually verifying findings and then properly explaining the context and implications."
        },
        {
          "hn_comment_id": 46430719,
          "parent_id": 46426472,
          "author": "IshKebab",
          "content": "Yeah that's my view too. It's definitely fine to wait a couple of years (at least), and see what emerged as most effective and then just learn that, instead of dumping a ton of time now into keeping up with the hamster wheel.Unless you're in web dev because it seems like that's one of the few domains where AI actually works pretty well today.",
          "created_at": 1767081852000,
          "content_cn": "Yeah that's my view too. It's definitely fine to wait a couple of years (at least), and see what emerged as most effective and then just learn that, instead of dumping a ton of time now into keeping up with the hamster wheel.Unless you're in web dev because it seems like that's one of the few domains where 人工智能 actually works pretty well today."
        },
        {
          "hn_comment_id": 46430721,
          "parent_id": 46426472,
          "author": "jacquesm",
          "content": "> Unless your gunning for a top position as a vibe coder, this whole concept of \"falling behind\" is just pure FOMO.???",
          "created_at": 1767081862000,
          "content_cn": "> Unless your gunning for a top position as a vibe coder, this whole concept of \"falling behind\" is just pure FOMO.???"
        },
        {
          "hn_comment_id": 46427010,
          "parent_id": 46426185,
          "author": "globnomulous",
          "content": "> This sounds unbearable.I can't see the original post because my browser settings break Twitter (I also haven't liked much of Karpathy's output), but I agree. I call this style of software development 'meeting-based programming,' because that seems to be the mental model that the designers of the tools are pursuing. This probably explains, in part, why c-suite/MBA  types are so excited about the tools: meetings are how they think and work.In a way LLMs/chatbots and 'agents' are just the latest phase of a trend that the internet has been encouraging for decades: the elimination of mental privacy. I don't mean 'privacy' in an everyday sense -- i.e. things I keep to myself and don't share. I mean 'privacy' in a more basic sense: private experience -- sitting by oneself; having a mental space that doesn't include anybody else; simply spending time with one's own thoughts.The internet encourages us to direct our thoughts and questions outward: look things up; find out what others have said; go to wikipedia; etc. This is, I think, horribly corrosive to the very essence of being a thinking, sentient being. It's also unsurprising, I guess. Humans are social animals. We're going to find ourselves easily seduced by anything that lets us replace private experience with social experience. I suppose it was only a matter of time until someone did this with programming tools, too.",
          "created_at": 1767049046000,
          "content_cn": "> This sounds unbearable.I can't see the original post because my browser settings break Twitter (I also haven't liked much of Karpathy's output), but I agree. I call this style of software development 'meeting-based programming,' because that seems to be the mental model that the designers of the tools are pursuing. This probably explains, in part, why c-suite/MBA  types are so excited about the tools: meetings are how they think and work.In a way LLMs/chatbots and 'agents' are just the latest phase of a trend that the internet has been encouraging for decades: the elimination of mental privacy. I don't mean 'privacy' in an everyday sense -- i.e. things I keep to myself and don't share. I mean 'privacy' in a more basic sense: private experience -- sitting by oneself; having a mental space that doesn't include anybody else; simply spending time with one's own thoughts.The internet encourages us to direct our thoughts and questions outward: look things up; find out what others have said; go to wikipedia; etc. This is, I think, horribly corrosive to the very essence of being a thinking, sentient being. It's also unsurprising, I guess. Humans are social animals. We're going to find ourselves easily seduced by anything that lets us replace private experience with social experience. I suppose it was only a matter of time until someone did this with programming tools, too."
        },
        {
          "hn_comment_id": 46426481,
          "parent_id": 46425398,
          "author": "9dev",
          "content": "Well. I was a sceptic for a long time, but a friend recently convinced me to try Claude Code and showed me around. I revived an open source project I regularly get back to, code for a bit, have to wrestle with toil and dependency updates, and loose the joy before I really get a lot done, so I stop again.With Claude, all it took to fix all of that drudge was a single sentence. In the last two weeks, I implemented several big features, fixed long standing issues and did migrations to new major versions of library dependencies that I wouldn’t have tackled at all on my own—I do this for fun after all, and updating Zod isn’t fun. Claude just does it for me, while I focus on high-level feature descriptions.I’m still validating and tweaking my workflow, but if I can keep up that pace and transfer it to other projects, I just got several times more effective.",
          "created_at": 1767046822000,
          "content_cn": "Well. I was a sceptic for a long time, but a friend recently convinced me to try Claude Code and showed me around. I revived an open source project I regularly get back to, code for a bit, have to wrestle with toil and dependency updates, and loose the joy before I really get a lot done, so I stop again.With Claude, all it took to fix all of that drudge was a single sentence. In the last two weeks, I implemented several big features, fixed long standing issues and did migrations to new major versions of library dependencies that I wouldn’t have tackled at all on my own—I do this for fun after all, and updating Zod isn’t fun. Claude just does it for me, while I focus on high-level feature descriptions.I’m still validating and tweaking my workflow, but if I can keep up that pace and transfer it to other projects, I just got several times more effective."
        },
        {
          "hn_comment_id": 46426362,
          "parent_id": 46426185,
          "author": "wakeywakeywakey",
          "content": ">  ... or how it's supposed to make any programmer worth their weight in salt 10x better.It doesn't. The only people I've seen claim such speedups are either not generally fluent in programming or stand to benefit financially from reinforcing this meme.",
          "created_at": 1767046044000,
          "content_cn": ">  ... or how it's supposed to make any programmer worth their weight in salt 10x better.It doesn't. The only people I've seen claim such speedups are either not generally fluent in programming or stand to benefit financially from reinforcing this meme."
        },
        {
          "hn_comment_id": 46440458,
          "parent_id": 46428121,
          "author": "yeasku",
          "content": "I have seen it. And it is a mess.Is not only that the.code quality is bad, to be fair in most projects is.The biggest problem is every single component of the stack uses different conventions and names for everything.When nobody looks at the code naming things becomes harder until everything is <generic name>",
          "created_at": 1767146079000,
          "content_cn": "I have seen it. And it is a mess.Is not only that the.code quality is bad, to be fair in most projects is.The 最大的 problem is every single component of the stack uses different conventions and names for everything.When nobody looks at the code naming things becomes harder until everything is <generic name>"
        },
        {
          "hn_comment_id": 46427794,
          "parent_id": 46408215,
          "author": "throwatdem12311",
          "content": "I have a hell of a time just getting any LLM to write SQL queries that have things like window functions, aggregates and lateral left joins - even when shoving the entire database schema DDL into the context.It's so frustrating, it regularly makes me want to just quit the profession.  Which is why I still just write most code by hand.",
          "created_at": 1767053408000,
          "content_cn": "I have a hell of a time just getting any LLM to write SQL queries that have things like window functions, aggregates and lateral left joins - even when shoving the entire database schema DDL into the context.It's so frustrating, it regularly makes me want to just quit the profession.  Which is why I still just write most code by hand."
        },
        {
          "hn_comment_id": 46426973,
          "parent_id": 46426261,
          "author": "layer8",
          "content": "The point is that all that research mostly doesn’t help in mastering the tool. Unlike traditional tools, it doesn’t come with an instruction manual. It’s like an alien tool just handed to us in exactly that sense.",
          "created_at": 1767048864000,
          "content_cn": "The point is that all that research mostly doesn’t help in mastering the tool. Unlike traditional tools, it doesn’t come with an instruction manual. It’s like an alien tool just handed to us in exactly that sense."
        },
        {
          "hn_comment_id": 46427157,
          "parent_id": 46425365,
          "author": "computersuck",
          "content": "you mean \"one\" not \"once\" right?",
          "created_at": 1767049822000,
          "content_cn": "you mean \"one\" not \"once\" right?"
        },
        {
          "hn_comment_id": 46431398,
          "parent_id": 46429036,
          "author": "nl",
          "content": "He's a pretty decent programmer.It's interesting that some months ago when his nanochat project came out the HN Anti-AI crowd celebrated him saying \"I tried to use claude/codex agents a few times but they just didn't work well enough at all and net unhelpful, possibly the repo is too far off the data distribution\"But now it is working for him he's suddenly not an expert...[1] https://news.ycombinator.com/item?id=45573521",
          "created_at": 1767088184000,
          "content_cn": "He's a pretty decent programmer.It's interesting that some months ago when his nanochat project came out the HN Anti-人工智能 crowd celebrated him saying \"I tried to use claude/codex agents a few times but they just didn't work well enough at all and net unhelpful, possibly the repo is too far off the data distribution\"But now it is working for him he's suddenly not an expert...[1] https://news.ycombinator.com/item?id=45573521"
        },
        {
          "hn_comment_id": 46425975,
          "parent_id": 46425365,
          "author": "NooneAtAll3",
          "content": "(for decades)('since' takes time_point - 'for' takes time_duration)",
          "created_at": 1767043953000,
          "content_cn": "(for decades)('since' takes time_point - 'for' takes time_duration)"
        },
        {
          "hn_comment_id": 46425608,
          "parent_id": 46425127,
          "author": "simonw",
          "content": "I think AI-assisted programming may be having the opposite effect, at least for me.I'm now incentivized to use less abstractions.Why do we code with React? It's because synchronizing state between a UI and a data model is difficult and it's easy to make mistakes, so it's worth paying the React complexity/page-weight tax in order for a \"better developer experience\" that allows us to build working, reliable software with less typing of code into a text editor.If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.How often have you dropped in a big complex library like Moment.js just because you needed to convert a time from one format to another, and it would take too long to hand-write that one feature (and add tests for it to make sure it's robust)? With an LLM that's a single prompt and a couple of minutes of wait.Using LLMs to build black box abstraction layers is a choice. We can choose to have them build LESS abstraction layers for us instead.",
          "created_at": 1767042004000,
          "content_cn": "I think 人工智能-assisted programming may be having the opposite effect, at least for me.I'm now incentivized to use less abstractions.Why do we code with React? It's because synchronizing state between a UI and a data model is difficult and it's easy to make mistakes, so it's worth paying the React complexity/page-weight tax in order for a \"better developer experience\" that allows us to build working, reliable software with less typing of code into a text editor.If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.How often have you dropped in a big complex library like Moment.js just because you needed to convert a time from one format to another, and it would take too long to hand-write that one feature (and add tests for it to make sure it's robust)? With an LLM that's a single prompt and a couple of minutes of wait.Using LLMs to build black box abstraction layers is a choice. We can choose to have them build LESS abstraction layers for us instead."
        },
        {
          "hn_comment_id": 46430995,
          "parent_id": 46429036,
          "author": "viccis",
          "content": "Maybe that's true, but I will say that one of the reasons I recommend his Python ML videos to people is not just the ML content but also his Python is good and idiomatic. So I would not agree; I think his programming is a well practiced skill.FWIW though I think his predicted worldview will render it very difficult to acquire this skill, as people grow reliant on gen AI for programming rudiments.",
          "created_at": 1767084400000,
          "content_cn": "Maybe that's true, but I will say that one of the reasons I recommend his Python ML videos to people is not just the ML content but also his Python is good and idiomatic. So I would not agree; I think his programming is a well practiced skill.FWIW though I think his predicted worldview will render it very difficult to acquire this skill, as people grow reliant on gen 人工智能 for programming rudiments."
        },
        {
          "hn_comment_id": 46428862,
          "parent_id": 46428830,
          "author": "ChrisMarshallNY",
          "content": "I’ve become comfortable with using LLMs as “trusted advisors.”I am not [yet] ready to just let an agent write a whole app or server for me, but I am increasingly letting them write a whole function for me.They are also great “bug finders.” I can just feed some code, describe the symptoms, and ask for an observation. I often get great suggestions, including things like finding typos and copy/pasta problems.I find that just this limited application has significantly increased my development velocity, and, I believe, the quality of my work.",
          "created_at": 1767062065000,
          "content_cn": "I’ve become comfortable with using LLMs as “trusted advisors.”I am not [yet] ready to just let an agent write a whole app or 服务器 for me, but I am increasingly letting them write a whole function for me.They are also great “bug finders.” I can just feed some code, describe the symptoms, and ask for an observation. I often get great suggestions, including things like finding typos and copy/pasta problems.I find that just this limited application has significantly increased my development velocity, and, I believe, the quality of my work."
        },
        {
          "hn_comment_id": 46425677,
          "parent_id": 46425306,
          "author": "sshine",
          "content": "I’ve been taking my son for stroller walks more often over Christmas. I bring a headset for listening to music, podcasts, audiobooks, tech talks. “Be effective.” But I end up just walking and thinking, realising this is “free time”.It sounds ridiculous and easy to say spending time walking and thinking will improve your decisions and priorities that no productivity hack will.I only actually did slow down for a while because I had to for the well-being of my family. Sure feels important to not always be on top of everyone else’s business.",
          "created_at": 1767042330000,
          "content_cn": "I’ve been taking my son for stroller walks more often over Christmas. I bring a headset for listening to music, podcasts, audiobooks, tech talks. “Be effective.” But I end up just walking and thinking, realising this is “free time”.It sounds ridiculous and easy to say spending time walking and thinking will improve your decisions and priorities that no productivity hack will.I only actually did slow down for a while because I had to for the well-being of my family. Sure feels important to not always be on top of everyone else’s business."
        },
        {
          "hn_comment_id": 46435680,
          "parent_id": 46431002,
          "author": "estimator7292",
          "content": "It's pretty nice that C has garnered such hate because there's apparently very little focus on getting LLMs to write good C. It's all Rust and Python and whatever this month's fad language is. LLM fans mostly leave us alone apart from the \"C bad rewrite the world in rust\" crew.I'm very happy being decades behind the curve here. C's slowness is perfect for me.",
          "created_at": 1767115782000,
          "content_cn": "It's pretty nice that C has garnered such hate because there's apparently very little focus on getting LLMs to write good C. It's all Rust and Python and whatever this month's fad language is. LLM fans mostly leave us alone apart from the \"C bad rewrite the world in rust\" crew.I'm very happy being decades behind the curve here. C's slowness is perfect for me."
        },
        {
          "hn_comment_id": 46425223,
          "parent_id": 46395794,
          "author": "skybrian",
          "content": "I see it more like a playing a text adventure game. You give it commands and sometimes it works, and sometimes the results are unexpected.",
          "created_at": 1767040307000,
          "content_cn": "I see it more like a playing a text adventure game. You give it commands and sometimes it works, and sometimes the results are unexpected."
        },
        {
          "hn_comment_id": 46438474,
          "parent_id": 46426472,
          "author": "hruhbuikr",
          "content": "Yeah Karpathy is engaged here in more hype creation. Software engineers pretending they just smashed some particles together and there is a whole lot of new data to math out.It's high dose copium. Please keep the good times rolling! Buy my books! Sub to my stack!Meanwhile, with local models, local RAG, and shell scripts, I am wandering 3D immersive worlds via a GPU accelerated presentation layer I vibe coded with a single 24GB GPU. Natural language driven Unreal engines are viable outputs today given local only code gen.Karpathy and the SV VC world thought this would be the next big thing to pump for a decade plus; like web pages and SaaS. But the world is smarter, more adept at catching up that it is just state management in a typical machine. The semantics are well known and do not need re-invention.The hilarity at an entire industry unintentionally training their replacements.",
          "created_at": 1767131702000,
          "content_cn": "Yeah Karpathy is engaged here in more hype creation. Software engineers pretending they just smashed some particles together and there is a whole lot of new data to math out.It's high dose copium. Please keep the good times rolling! Buy my books! Sub to my stack!Meanwhile, with local models, local RAG, and shell scripts, I am wandering 3D immersive worlds via a GPU accelerated presentation layer I vibe coded with a single 24GB GPU. Natural language driven Unreal engines are viable outputs today given local only code gen.Karpathy and the SV VC world thought this would be the next big thing to pump for a decade plus; like web pages and SaaS. But the world is smarter, more adept at catching up that it is just state management in a typical machine. The semantics are well known and do not need re-invention.The hilarity at an entire industry unintentionally training their replacements."
        },
        {
          "hn_comment_id": 46430869,
          "parent_id": 46429236,
          "author": "kqr",
          "content": "Not being from the US, it took me a moment to realise that \"she's in Canada\" is a nice excuse for why nobody has met her.",
          "created_at": 1767083345000,
          "content_cn": "Not being from the US, it took me a moment to realise that \"she's in Canada\" is a nice excuse for why nobody has met her."
        },
        {
          "hn_comment_id": 46395951,
          "parent_id": 46395794,
          "author": "condensedcrab",
          "content": "Not to mention many companies speedrunning systems of strange and/or perverse incentives with AI adoption.That being said, Welch’s grape juice hasn’t put Napa valley out of business. Human taste is still the subjective filter that LLMs can only imitate, not replace.I view LLM assisted coding (on the sliding scale from vibe coding to fancy auto complete) similar to how  Ableton and other DAW software have empowered good musicians that might not have made it otherwise due to lack of connections or money, but the music industry hasn’t collapsed completely.",
          "created_at": 1766781339000,
          "content_cn": "Not to mention many companies speedrunning systems of strange and/or perverse incentives with 人工智能 adoption.That being said, Welch’s grape juice hasn’t put Napa valley out of business. Human taste is still the subjective filter that LLMs can only imitate, not replace.I view LLM assisted coding (on the sliding scale from vibe coding to fancy auto complete) similar to how  Ableton and other DAW software have empowered good musicians that might not have made it otherwise due to lack of connections or money, but the music industry hasn’t collapsed completely."
        },
        {
          "hn_comment_id": 46427419,
          "parent_id": 46425598,
          "author": "causal",
          "content": "If anything I'd expect all these tools to be easier for new engineers to adopt, unburdened by how things were before.",
          "created_at": 1767051230000,
          "content_cn": "If anything I'd expect all these tools to be easier for new engineers to adopt, unburdened by how things were before."
        },
        {
          "hn_comment_id": 46431266,
          "parent_id": 46425598,
          "author": "danw1979",
          "content": "Absolutely agree.I took this approach when the Kubernetes hype hit and it never limited my prospects.",
          "created_at": 1767086900000,
          "content_cn": "Absolutely agree.I took this approach when the Kubernetes hype hit and it never limited my prospects."
        },
        {
          "hn_comment_id": 46428402,
          "parent_id": 46428338,
          "author": "fragsworth",
          "content": "> For the folks who have more positive outlooks how often do you change your code after it's been generated?Every time, unless my initial request was perfectly outlined in unambiguous pseudocode. It's just too easy to write ambiguous requests.Unambiguous but human-readable pseudocode is what I strive for now, though I will often ask AI to help edit the pseudocode to remove ambiguities prior to generating code.",
          "created_at": 1767058045000,
          "content_cn": "> For the folks who have more positive outlooks how often do you change your code after it's been generated?Every time, unless my initial request was perfectly outlined in unambiguous pseudocode. It's just too easy to write ambiguous requests.Unambiguous but human-readable pseudocode is what I strive for now, though I will often ask 人工智能 to help edit the pseudocode to remove ambiguities prior to generating code."
        },
        {
          "hn_comment_id": 46425361,
          "parent_id": 46403304,
          "author": "threetonesun",
          "content": "Between subscription software and subscription AI and the rising prices of computer hardware, the idea of a \"personal computer\" is quickly dying.",
          "created_at": 1767040963000,
          "content_cn": "Between subscription software and subscription 人工智能 and the rising prices of computer hardware, the idea of a \"personal computer\" is quickly dying."
        },
        {
          "hn_comment_id": 46425845,
          "parent_id": 46403304,
          "author": "2sk21",
          "content": "IDEs used to be extremely expensive back in the 1990s. IDEs such as Microsoft Visual Studio and IBM's Visual age for Java were quite expensive subscription as I recall. subsequently, open source IDEs like Eclipse and VisualStudio seem to have become the norm.",
          "created_at": 1767043204000,
          "content_cn": "IDEs used to be extremely expensive back in the 1990s. IDEs such as Microsoft Visual Studio and IBM's Visual age for Java were quite expensive subscription as I recall. subsequently, open source IDEs like Eclipse and VisualStudio seem to have become the norm."
        },
        {
          "hn_comment_id": 46427190,
          "parent_id": 46403304,
          "author": "wild_egg",
          "content": "Your employer is not paying for these things?",
          "created_at": 1767049958000,
          "content_cn": "Your employer is not paying for these things?"
        },
        {
          "hn_comment_id": 46427902,
          "parent_id": 46427010,
          "author": "ewoodrich",
          "content": "https://xcancel.com/karpathy/status/2004607146781278521(FYI: you can easily bypass the awful logged out view by replacing x.com with xcancel.com, I use a URL Autoredirector rule to do it automatically in Chromium browsers)",
          "created_at": 1767054057000,
          "content_cn": "https://xcancel.com/karpathy/status/2004607146781278521(FYI: you can easily bypass the awful logged out view by 取代 x.com with xcancel.com, I use a URL Autoredirector rule to do it automatically in Chromium browsers)"
        },
        {
          "hn_comment_id": 46426806,
          "parent_id": 46426481,
          "author": "reconnecting",
          "content": "This sounds to me like a lack of resource management, as tasks that junior developers might perform don't match your skills, and are thus boring.As a creator of an open-source platform myself, I find trusting a semi-random word generator in front of users unreliable.Moreover, I believe it creates a bad habit. I've seen developers forget how to read documentation and instead trust AI, and of course, as a result AI makes mistakes that are hard to debug or provokes security issues that are easy to overlook.I know this sounds like a luddite talking, but I'm still not convinced that AI in its current state can be reliable in any way. However, because of engineers like you, AI is learning to make better choices, and that might change in the future.",
          "created_at": 1767048222000,
          "content_cn": "This sounds to me like a lack of resource management, as tasks that junior developers might perform don't match your skills, and are thus boring.As a creator of an open-source platform myself, I find trusting a semi-random word generator in front of users unreliable.Moreover, I believe it creates a bad habit. I've seen developers forget how to read documentation and instead trust 人工智能, and of course, as a result 人工智能 makes mistakes that are hard to debug or provokes security issues that are easy to overlook.I know this sounds like a luddite talking, but I'm still not convinced that 人工智能 in its current state can be reliable in any way. However, because of engineers like you, 人工智能 is learning to make better choices, and that might change in the future."
        },
        {
          "hn_comment_id": 46428070,
          "parent_id": 46427010,
          "author": "ctmnt",
          "content": "Use a Nitter mirror [1]. I find xcancel.com the easiest to get to:https://xcancel.com/karpathy/status/2004607146781278521[1] https://github.com/zedeus/nitter/wiki/Instances",
          "created_at": 1767055385000,
          "content_cn": "Use a Nitter mirror [1]. I find xcancel.com the easiest to get to:https://xcancel.com/karpathy/status/2004607146781278521[1] https://GitHub.com/zedeus/nitter/wiki/Instances"
        },
        {
          "hn_comment_id": 46426486,
          "parent_id": 46426362,
          "author": "alexjplant",
          "content": "For every conspicuous vibecoding influencer there are a bunch of experienced software engineers using them to get things done. The newest generation of models are actually pretty decent at following instructions and using existing code as a template. Building line-of-business apps is much quicker with Claude Code because once you've nicely scaffolded everything you can just tell it to build stuff and it'll do so the same way you would have in a fraction of the time. You can also use it to research alternatives to architectural approaches and tooling that you come up with so that you don't paint yourself into a corner by having not heard about some semi-niche tool that fits your use case perfectly.Of course I wouldn't use an LLM to #yolo some Next.js monstrosity with a flavor-of-the-week ORM and random Tailwind. I have, however, had it build numerous parts of my apps after telling it all about the mise targets and tests and architecture of the code that I came up with up front. In a way it vindicates my approach to software engineering because it's able to use the tools available to it to (reasonably) ensure correctness before it says it's done.",
          "created_at": 1767046840000,
          "content_cn": "For every conspicuous vibecoding influencer there are a bunch of experienced software engineers using them to get things done. The newest generation of models are actually pretty decent at following instructions and using existing code as a template. Building line-of-business apps is much quicker with Claude Code because once you've nicely scaffolded everything you can just tell it to build stuff and it'll do so the same way you would have in a fraction of the time. You can also use it to research alternatives to architectural approaches and tooling that you come up with so that you don't paint yourself into a corner by having not heard about some semi-niche tool that fits your use case perfectly.Of course I wouldn't use an LLM to #yolo some Next.js monstrosity with a flavor-of-the-week ORM and random Tailwind. I have, however, had it build numerous parts of my apps after telling it all about the mise targets and tests and architecture of the code that I came up with up front. In a way it vindicates my approach to software engineering because it's able to use the tools available to it to (reasonably) ensure correctness before it says it's done."
        },
        {
          "hn_comment_id": 46429067,
          "parent_id": 46427794,
          "author": "data-ottawa",
          "content": "I write a lot of SQL and I haven't had these issues for months, even with smaller models. Opus can one shot most of my queries faster than I could type them.Instead of stuffing the context with DDL I suggest:1. Reorganize your data warehouse. It needs to be easy to find the correct data. Make sure you use ELT clear layers, meaningful schemas, and have per-model documentation. This is a ton of work, but if done right the payoff is massive.2. I built a tool for myself to pull our warehouse into a graph for fuzzy search+dependency chain analysis. In the spring I made an MCP server for it and Claude uses that tool incredibly well for almost all queries. I haven't actually used the GUI or scripts since I built the MCP.Claude and Devstral are the best models I've used for SQL. I cannot get Gemini to write decent modern sql -- even the Gemini data science/engineer agents in Google Cloud. I occasionally try the paid models through the API and still haven't been impressed.",
          "created_at": 1767063742000,
          "content_cn": "I write a lot of SQL and I haven't had these issues for months, even with smaller models. Opus can one shot most of my queries faster than I could type them.Instead of stuffing the context with DDL I suggest:1. Reorganize your data warehouse. It needs to be easy to find the correct data. Make sure you use ELT clear layers, meaningful schemas, and have per-model documentation. This is a ton of work, but if done right the payoff is massive.2. I built a tool for myself to pull our warehouse into a graph for fuzzy search+dependency chain analysis. In the spring I made an MCP 服务器 for it and Claude uses that tool incredibly well for almost all queries. I haven't actually used the GUI or scripts since I built the MCP.Claude and Devstral are the best models I've used for SQL. I cannot get Gemini（双子座） to write decent modern sql -- even the Gemini（双子座） data science/engineer agents in Google Cloud. I occasionally try the paid models through the 应用程序接口 and still haven't been impressed."
        },
        {
          "hn_comment_id": 46426396,
          "parent_id": 46426362,
          "author": "johnfn",
          "content": "I am a professional engineer with around 10 years of experience and I use AI to work about 5x faster on a site I personally maintain (~100 DAU, so not huge, but also not nothing). I don’t work in AI so I get no financial benefit by “reinforcing this meme”.",
          "created_at": 1767046327000,
          "content_cn": "I am a professional engineer with around 10 years of experience and I use 人工智能 to work about 5x faster on a site I personally maintain (~100 DAU, so not huge, but also not nothing). I don’t work in 人工智能 so I get no financial benefit by “reinforcing this meme”."
        },
        {
          "hn_comment_id": 46430106,
          "parent_id": 46426362,
          "author": "zarzavat",
          "content": "The speedup from AI is in the exponent.Just the other day ChatGPT implemented something that would have taken me a week of research to figure out: in 10 minutes. What do you call that speedup? It's a lot more than 10x.On other days I barely touch AI because I can write easy code faster than I can write prompts for easy code, though the autocomplete definitely helps me type faster.The \"10x\" is just a placeholder for averaging over a series of stochastic exponents. It's a way of saying \"somewhere between 1 and infinity\"",
          "created_at": 1767075047000,
          "content_cn": "The speedup from 人工智能 is in the exponent.Just the other day ChatGPT implemented something that would have taken me a week of research to figure out: in 10 minutes. What do you call that speedup? It's a lot more than 10x.On other days I barely touch 人工智能 because I can write easy code faster than I can write prompts for easy code, though the autocomplete definitely helps me type faster.The \"10x\" is just a placeholder for averaging over a series of stochastic exponents. It's a way of saying \"somewhere between 1 and infinity\""
        },
        {
          "hn_comment_id": 46432175,
          "parent_id": 46431398,
          "author": "iLoveOncall",
          "content": "> But now it is working for him he's suddenly not an expert...Or maybe he didn't lie then but is lying now?",
          "created_at": 1767093968000,
          "content_cn": "> But now it is working for him he's suddenly not an expert...Or maybe he didn't lie then but is lying now?"
        },
        {
          "hn_comment_id": 46428907,
          "parent_id": 46427794,
          "author": "deadbabe",
          "content": "If you really know SQL, writing an SQL query basically just feels like writing a prompt for a database client anyway, except it does exactly what you ask for.",
          "created_at": 1767062466000,
          "content_cn": "If you really know SQL, writing an SQL query basically just feels like writing a prompt for a database client anyway, except it does exactly what you ask for."
        },
        {
          "hn_comment_id": 46428203,
          "parent_id": 46427157,
          "author": "PessimalDecimal",
          "content": "Just once. Just for a night.",
          "created_at": 1767056378000,
          "content_cn": "Just once. Just for a night."
        },
        {
          "hn_comment_id": 46432053,
          "parent_id": 46431398,
          "author": "latexr",
          "content": "What you’re calling the “crowd” was not the same people. Every time someone makes a claim like yours, I go and check and don’t see the same usernames in the conversation. “Different people have different opinions and different ways to express them” isn’t really an insight; it tells us nothing nor does it make anyone worthy of criticism.You can’t, in an honest argument, lump different strangers into a group you invented to accuse them of duplicity or hypocrisy.",
          "created_at": 1767093198000,
          "content_cn": "What you’re calling the “crowd” was not the same people. Every time someone makes a claim like yours, I go and check and don’t see the same usernames in the conversation. “Different people have different opinions and different ways to express them” isn’t really an insight; it tells us nothing nor does it make anyone worthy of criticism.You can’t, in an honest argument, lump different strangers into a group you invented to accuse them of duplicity or hypocrisy."
        },
        {
          "hn_comment_id": 46432392,
          "parent_id": 46430995,
          "author": "59nadir",
          "content": "As far as \"programming skill\" goes, writing \"good and idiomatic\" Python is pretty bottom of the barrel. I don't think the GP is all that off, most people who are famous for some programming-adjacent skill (or even programming) aren't good at programming.",
          "created_at": 1767095611000,
          "content_cn": "As far as \"programming skill\" goes, writing \"good and idiomatic\" Python is pretty bottom of the barrel. I don't think the GP is all that off, most people who are famous for some programming-adjacent skill (or even programming) aren't good at programming."
        },
        {
          "hn_comment_id": 46426497,
          "parent_id": 46425608,
          "author": "roadside_picnic",
          "content": "> If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.I've had plenty of junior devs justify massive code bases of random scripts and 100+ line functions with the same logic. There's a reason senior devs almost always push back on this when it's encountered.Everything hinges on that \"if\". But you're baking a tautology into your reasoning: \"if LLMs can do everything we need them to, we can use LLMs for everything we need\".The reason we stop junior devs from going down this path is because experience teaches us that things will break and when they do, it will incur a world of pain.So \"LLM as abstraction\" might be a possible future, but it assumes LLMs are significantly more capable than a junior dev at managing a growing mess of complex code.This is clearly not the case with simplistic LLM usage today. \"Ah! But you need agents and memory and context management, etc!\" But all of these are abstractions. This is what I believe the parent comment is really pointing out.If AI could do what we originally hoped it could: follow simple instructions to solve complex tasks. We'd be great, and I would agree with your argument. But we are very clearly not in that world. Especially since Karpathy can't even keep up with the sophisticated machinery necessary to properly orchestrate these tools. All of the people decrying \"you're not doing it right!\" are emphatically proving that LLMs cannot perform these tasks at the level we need them to.",
          "created_at": 1767046911000,
          "content_cn": "> If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.I've had plenty of 初级开发者 justify massive code bases of random scripts and 100+ line functions with the same logic. There's a reason senior devs almost always push back on this when it's encountered.Everything hinges on that \"if\". But you're baking a tautology into your reasoning: \"if LLMs can do everything we need them to, we can use LLMs for everything we need\".The reason we stop 初级开发者 from going down this path is because experience teaches us that things will break and when they do, it will incur a world of pain.So \"LLM as abstraction\" might be a possible future, but it assumes LLMs are significantly more capable than a junior dev at managing a growing mess of complex code.This is clearly not the case with simplistic LLM usage today. \"Ah! But you need agents and memory and context management, etc!\" But all of these are abstractions. This is what I believe the parent comment is really pointing out.If 人工智能 could do what we originally hoped it could: follow simple instructions to solve complex tasks. We'd be great, and I would agree with your argument. But we are very clearly not in that world. Especially since Karpathy can't even keep up with the sophisticated machinery necessary to properly orchestrate these tools. All of the people decrying \"you're not doing it right!\" are emphatically proving that LLMs cannot perform these tasks at the level we need them to."
        },
        {
          "hn_comment_id": 46426365,
          "parent_id": 46425608,
          "author": "sshine",
          "content": "> I'm now incentivized to use less abstractions.I'm incentivised to use abstractions that are harder to learn, but execute faster or more safely once compiled. E.g. more Rust, Lean.> If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.LLMs benefit from abstractions the same way as we do.LLMs currently copy our approaches to solving problems and copy all the problems those approaches bring.Letting LLMs skip all the abstractions is about as likely to succeed as genetic programming is efficient.For example, writing more vanilla JS instead of React, you're just reinventing the necessary abstractions more verbosely and with a higher risk of duplicate code or mismatching abstractions.In a recent interview with Bret Weinstein, a former professor of evolutionary biology, he proposed that one property of evolution that makes the story of one species evolving into another more likely is that it's not just random permutations of single genes; it's also permutations to counter variables encoded as telomeres and possibly microsatellites.https://podcasts.happyscribe.com/the-joe-rogan-experience/24...Bret compares this to flipping random bits in a program to make it work better vs. tweaking variables randomly in a high-level language. Mutating parameters at a high-level for something that already works is more likely to result in something else that works than mutating parameters at a low level.So I believe LLMs benefit from high abstractions, like us.We just need good ones; and good ones for us might not be the same as good ones for LLMs.",
          "created_at": 1767046054000,
          "content_cn": "> I'm now incentivized to use less abstractions.I'm incentivised to use abstractions that are harder to learn, but execute faster or more safely once compiled. E.g. more Rust, Lean.> If an LLM is typing that code - and it can maintain a test suite that shows everything works correctly - maybe we don't need that abstraction after all.LLMs benefit from abstractions the same way as we do.LLMs currently copy our approaches to solving problems and copy all the problems those approaches bring.Letting LLMs skip all the abstractions is about as likely to succeed as genetic programming is efficient.For example, writing more vanilla JS instead of React, you're just reinventing the necessary abstractions more verbosely and with a higher risk of duplicate code or mismatching abstractions.In a recent interview with Bret Weinstein, a former professor of evolutionary biology, he proposed that one property of evolution that makes the story of one species evolving into another more likely is that it's not just random permutations of single genes; it's also permutations to counter variables encoded as telomeres and possibly microsatellites.https://podcasts.happyscribe.com/the-joe-rogan-experience/24...Bret compares this to flipping random bits in a program to make it work better vs. tweaking variables randomly in a high-level language. Mutating parameters at a high-level for something that already works is more likely to result in something else that works than mutating parameters at a low level.So I believe LLMs benefit from high abstractions, like us.We just need good ones; and good ones for us might not be the same as good ones for LLMs."
        },
        {
          "hn_comment_id": 46429080,
          "parent_id": 46428862,
          "author": "wmoxam",
          "content": "IMO LLMs make for a great rubber duck https://en.wikipedia.org/wiki/Rubber_duck_debugging",
          "created_at": 1767063923000,
          "content_cn": "IMO LLMs make for a great rubber duck https://en.wikipedia.org/wiki/Rubber_duck_debugging"
        },
        {
          "hn_comment_id": 46429293,
          "parent_id": 46425223,
          "author": "zephen",
          "content": "Personally, I've never been interested in being a character in someone else's story.But now you've got me thinking.  Has anyone studied whether the programmers who are more enamored of AI are also into RPGs?",
          "created_at": 1767066081000,
          "content_cn": "Personally, I've never been interested in being a character in someone else's story.But now you've got me thinking.  Has anyone studied whether the programmers who are more enamored of 人工智能 are also into RPGs?"
        },
        {
          "hn_comment_id": 46396052,
          "parent_id": 46395951,
          "author": "tjr",
          "content": "In the music world, I would say that, rather than DAWs, LLM-assisted coding is more like LLM-assisted music creation.",
          "created_at": 1766781928000,
          "content_cn": "In the music world, I would say that, rather than DAWs, LLM-assisted coding is more like LLM-assisted music creation."
        },
        {
          "hn_comment_id": 46430985,
          "parent_id": 46427419,
          "author": "reidrac",
          "content": "> unburdened by how things were before.What burden are you talking about? Using LLMs isn't that hard, we have done harder things before.Sure, there will be people that refuses to \"let go\" and want to keep doing things the way the like them, but hey! I've been productive with vim (now neovim) for 25 years and I work with engineers that haven't mastered their IDEs at the same level. Not even close!Sure, they have have never been \"burdened\" by knowing other editors before those IDEs existed, but claiming that I would have it harder to use any of those because I've mastered other tools before is ridiculous.",
          "created_at": 1767084334000,
          "content_cn": "> unburdened by how things were before.What burden are you talking about? Using LLMs isn't that hard, we have done harder things before.Sure, there will be people that refuses to \"let go\" and want to keep doing things the way the like them, but hey! I've been productive with vim (now neovim) for 25 years and I work with engineers that haven't mastered their IDEs at the same level. Not even close!Sure, they have have never been \"burdened\" by knowing other editors before those IDEs existed, but claiming that I would have it harder to use any of those because I've mastered other tools before is ridiculous."
        },
        {
          "hn_comment_id": 46425418,
          "parent_id": 46425361,
          "author": "Aldipower",
          "content": "Not for me.",
          "created_at": 1767041173000,
          "content_cn": "Not for me."
        },
        {
          "hn_comment_id": 46430506,
          "parent_id": 46425845,
          "author": "qingcharles",
          "content": "I used to pay a fortune for a full Visual Studio + full MSDN experience every year until I eventually earned a free ride.Wild how much you can get for free now. Amazing free IDEs. Every LLM offers excellent free plans if you are on a zero budget.$10/mo GitHub Copilot is an absurd deal that has to be a loss in terms of pure compute cost.",
          "created_at": 1767079638000,
          "content_cn": "I used to pay a fortune for a full Visual Studio + full MSDN experience every year until I eventually earned a free ride.Wild how much you can get for free now. Amazing free IDEs. Every LLM offers excellent free plans if you are on a zero budget.$10/mo GitHub Copilot is an absurd deal that has to be a loss in terms of pure compute cost."
        },
        {
          "hn_comment_id": 46427977,
          "parent_id": 46425845,
          "author": "aeonik",
          "content": "Compilers and programming languages themselves used to be hideously expensive as well.",
          "created_at": 1767054687000,
          "content_cn": "Compilers and programming languages themselves used to be hideously expensive as well."
        },
        {
          "hn_comment_id": 46425981,
          "parent_id": 46425845,
          "author": "abeyer",
          "content": "Visual Studio has never been open source, though some of the underlying build tools and compilers are.Visual Studio Code is a different thing... and claims to be open source, but by intent and approach really is closer to source available.",
          "created_at": 1767043971000,
          "content_cn": "Visual Studio has never been open source, though some of the underlying build tools and compilers are.Visual Studio Code is a different thing... and claims to be open source, but by intent and approach really is closer to source available."
        },
        {
          "hn_comment_id": 46425517,
          "parent_id": null,
          "author": "sureglymop",
          "content": "> strengths and pitfalls of fundamentally stochastic, fallible, unintelligible and changing entities suddenly intermingled with what used to be good old fashioned engineeringSounds fever dreamish. Thank you sincerely (not) for creating it!",
          "created_at": 1767041611000,
          "content_cn": "> strengths and pitfalls of fundamentally stochastic, fallible, unintelligible and changing entities suddenly intermingled with what used to be good old fashioned engineeringSounds fever dreamish. Thank you sincerely (not) for creating it!"
        },
        {
          "hn_comment_id": 46427675,
          "parent_id": 46408215,
          "author": "nowittyusername",
          "content": "Most people have not fully grasped how LLM's work and how to properly utilize agentic coding solutions. That is the reason for issues when it comes to vibe coders having low quality code. But that is not the limitation of technology but the user (at this stage). Basically think of it this way everyone is the grandma that has been handed a palm pilot to use to get things done. Grandma needs an iPhone not a palm pilot but the problem is that we are not in that territory yet. So now consider the people who were able to use the palm pilot very successfully and well, they were few and they were the exception, but they existed. Same here. I have been using coding agent for over 7 months now and have written zero lines of code, in fact I don't know how to code at all. But i have been able to architect very complex software projects from scratch. Text to speech , automated llm benchmarking systems for testing all possible llama.cpp sampling parameters and more, and now im building my own agentic framework from scratch. All of these things are possible and more without writing one line of code yourself. But it does require understanding how to use the technology well to get this done.",
          "created_at": 1767052731000,
          "content_cn": "Most people have not fully grasped how LLM's work and how to properly utilize agentic coding solutions. That is the reason for issues when it comes to vibe coders having low quality code. But that is not the limitation of technology but the user (at this stage). Basically think of it this way everyone is the grandma that has been handed a palm pilot to use to get things done. Grandma needs an iPhone not a palm pilot but the problem is that we are not in that territory yet. So now consider the people who were able to use the palm pilot very successfully and well, they were few and they were the exception, but they existed. Same here. I have been using coding agent for over 7 months now and have written zero lines of code, in fact I don't know how to code at all. But i have been able to architect very complex software projects from scratch. Text to speech , automated llm benchmarking systems for testing all possible llama.cpp sampling parameters and more, and now im building my own agentic framework from scratch. All of these things are possible and more without writing one line of code yourself. But it does require understanding how to use the technology well to get this done."
        },
        {
          "hn_comment_id": 46428075,
          "parent_id": 46425127,
          "author": "teleforce",
          "content": "This whole things of AI assisted and vibe coding phenomena including the other comments remind me of this very popular post on HN that keep appearing almost every year on HN [1],[2].[1] Don't Call Yourself A Programmer, And Other Career Advice:https://www.kalzumeus.com/2011/10/28/dont-call-yourself-a-pr...[2] Don't Call Yourself A Programmer, And Other Career Advice (2011):https://news.ycombinator.com/item?id=34095775",
          "created_at": 1767055432000,
          "content_cn": "This whole things of 人工智能 assisted and vibe coding phenomena including the other comments remind me of this very popular post on HN that keep appearing almost every year on HN [1],[2].[1] Don't Call Yourself A Programmer, And Other Career Advice:https://www.kalzumeus.com/2011/10/28/dont-call-yourself-a-pr...[2] Don't Call Yourself A Programmer, And Other Career Advice (2011):https://news.ycombinator.com/item?id=34095775"
        },
        {
          "hn_comment_id": 46428002,
          "parent_id": 46425127,
          "author": "exssss",
          "content": "Out of curiosity, what did you pivot to?It sounds crazy to say this, but I've been thinking about this myself. Not for the immediate future (eg 2026), but somewhere later.",
          "created_at": 1767054788000,
          "content_cn": "Out of curiosity, what did you pivot to?It sounds crazy to say this, but I've been thinking about this myself. Not for the immediate future (eg 2026), but somewhere later."
        },
        {
          "hn_comment_id": 46426342,
          "parent_id": 46426261,
          "author": "Kuinox",
          "content": "Do you know who is the author ?",
          "created_at": 1767045916000,
          "content_cn": "Do you know who is the author ?"
        },
        {
          "hn_comment_id": 46398164,
          "parent_id": 46395794,
          "author": "nextworddev",
          "content": "(Inception scene) here a minute is seven hours",
          "created_at": 1766797768000,
          "content_cn": "(Inception scene) here a minute is seven hours"
        },
        {
          "hn_comment_id": 46399475,
          "parent_id": 46395794,
          "author": "m463",
          "content": "> I can run fast enough.Can you do some code reviews while you're running?",
          "created_at": 1766814375000,
          "content_cn": "> I can run fast enough.Can you do some code reviews while you're running?"
        },
        {
          "hn_comment_id": 46431166,
          "parent_id": 46429236,
          "author": "symbogra",
          "content": "Time to shell out the $200 my friend.",
          "created_at": 1767085816000,
          "content_cn": "Time to shell out the $200 my friend."
        },
        {
          "hn_comment_id": 46428703,
          "parent_id": 46426185,
          "author": "timcobb",
          "content": "> This sounds unbearable. It doesn't sound like software development, it sounds like spending a thousand hours tinkering with your vim configBefore LLM programming, this was at least 30-50% of my time spent programming, fixing one config and build issue after another. Now I can spend way more time thinking about more interesting things.",
          "created_at": 1767060727000,
          "content_cn": "> This sounds unbearable. It doesn't sound like software development, it sounds like spending a thousand hours tinkering with your vim configBefore LLM programming, this was at least 30-50% of my time spent programming, fixing one config and build issue after another. Now I can spend way more time thinking about more interesting things."
        },
        {
          "hn_comment_id": 46426094,
          "parent_id": 46408215,
          "author": "SkyPuncher",
          "content": "My trick is to explicitly roll play that we’re doing a spike. This gets all of the models to ignore all of the details they normally get hung up on.  Once I have the basics in place, I can tell it to fix details.It’s _always_ easier to add more code than it is to fix broken code.",
          "created_at": 1767044620000,
          "content_cn": "My trick is to explicitly roll play that we’re doing a spike. This gets all of the models to ignore all of the details they normally get hung up on.  Once I have the basics in place, I can tell it to fix details.It’s _always_ easier to add more code than it is to fix broken code."
        },
        {
          "hn_comment_id": 46425088,
          "parent_id": 46408215,
          "author": "miguel_martin",
          "content": "This is what an AGENTS.md - https://agents.md/ (or CLAUDE.md) file is for. Put common constraints to correct model mistakes/issues with respect to the codebase, e.g. in a “code style” section.",
          "created_at": 1767039591000,
          "content_cn": "This is what an AGENTS.md - https://agents.md/ (or CLAUDE.md) file is for. Put common constraints to correct model mistakes/issues with respect to the codebase, e.g. in a “code style” section."
        },
        {
          "hn_comment_id": 46429921,
          "parent_id": 46429236,
          "author": "YouWhy",
          "content": "Touché! That's a good one.",
          "created_at": 1767073168000,
          "content_cn": "Touché! That's a good one."
        },
        {
          "hn_comment_id": 46425714,
          "parent_id": 46408215,
          "author": "shepherdjerred",
          "content": "I hardly ever open an IDE anymore.I use Claude Code and Cursor. What I do:- use statically typed languages: TypeScript, Go, Rust, Python w/ types- Setup linters. For TS I have a bunch of custom lint rules (authored by AI) for common feedback that I've given. (https://github.com/shepherdjerred/monorepo/tree/main/package...)- For Cursor, lots of feedback on my desired style. https://github.com/shepherdjerred/scout-for-lol/tree/main/.c...- Heavy usage of plan mode. Tell AI something like \"make at least 20 searches to online documentation\", support every claim with a reference, etc. Tell AI \"make a task for every little thing you'll implement\"- Have the AI write tests, particularly the more expensive ones like integration and end-to-end, so you have an easy way to verify functionality.- Setup Claude Code GHA to automatically review PRs. Give the review feedback to the agent that implemented it, either via copy-pasting or tell the agent \"fetch review comments and fix them\".Some examples of what I've made:- Many features for https://scout-for-lol.com/, a League of Legends bot for Discord- A program to generate TypeScript types for Helm charts (https://github.com/shepherdjerred/homelab/tree/main/src/helm...)- A program to summarize all of the dependency updates for my Homelab (https://github.com/shepherdjerred/homelab/tree/main/src/deps...)- A program to manage multiple instances of CLI agents like Claude Code (https://github.com/shepherdjerred/monorepo/tree/main/package...)- A Discord AI bot in the style of my friends (https://github.com/shepherdjerred/monorepo/tree/main/package...)",
          "created_at": 1767042511000,
          "content_cn": "I hardly ever open an IDE anymore.I use Claude Code and Cursor. What I do:- use statically typed languages: TypeScript, Go, Rust, Python w/ types- Setup linters. For TS I have a bunch of custom lint rules (authored by 人工智能) for common feedback that I've given. (https://GitHub.com/shepherdjerred/monorepo/tree/main/package...)- For Cursor, lots of feedback on my desired style. https://GitHub.com/shepherdjerred/scout-for-lol/tree/main/.c...- Heavy usage of plan mode. Tell 人工智能 something like \"make at least 20 searches to online documentation\", support every claim with a reference, etc. Tell 人工智能 \"make a task for every little thing you'll implement\"- Have the 人工智能 write tests, particularly the more expensive ones like integration and end-to-end, so you have an easy way to verify functionality.- Setup Claude Code GHA to automatically review PRs. Give the review feedback to the agent that implemented it, either via copy-pasting or tell the agent \"fetch review comments and fix them\".Some examples of what I've made:- Many features for https://scout-for-lol.com/, a League of Legends bot for Discord- A program to generate TypeScript types for Helm charts (https://GitHub.com/shepherdjerred/homelab/tree/main/src/helm...)- A program to summarize all of the dependency updates for my Homelab (https://GitHub.com/shepherdjerred/homelab/tree/main/src/deps...)- A program to manage multiple instances of CLI agents like Claude Code (https://GitHub.com/shepherdjerred/monorepo/tree/main/package...)- A Discord 人工智能 bot in the style of my friends (https://GitHub.com/shepherdjerred/monorepo/tree/main/package...)"
        },
        {
          "hn_comment_id": 46432262,
          "parent_id": 46431002,
          "author": "atonse",
          "content": "You’re the real unicorn!",
          "created_at": 1767094566000,
          "content_cn": "You’re the real unicorn!"
        },
        {
          "hn_comment_id": 46440631,
          "parent_id": 46403304,
          "author": "lostmsu",
          "content": "You can use open models for free. They work at the last year level+.",
          "created_at": 1767147725000,
          "content_cn": "You can use open models for free. They work at the last year level+."
        },
        {
          "hn_comment_id": 46432318,
          "parent_id": 46403304,
          "author": "Aozora7",
          "content": "I'm not paying for an AI subscription to do my job in the same way I don't pay for the IDE I use. My employer does.",
          "created_at": 1767095038000,
          "content_cn": "I'm not paying for an 人工智能 subscription to do my job in the same way I don't pay for the IDE I use. My employer does."
        },
        {
          "hn_comment_id": 46425603,
          "parent_id": 46425127,
          "author": "kace91",
          "content": "Our industry wants disruption, speed, delivery! Automatic code generation does that wonderfully.If we wanted safety, stability, performance, and polish, the impact of LLMs would be more limited. They have a tendency to pile up code on top of code.I think the new tech is just accelerating an already existing problem. Most tech products are already rotting, take a look at windows or iOS.I wonder what will it take for a significant turning point in this mentality.",
          "created_at": 1767041969000,
          "content_cn": "Our industry wants disruption, speed, delivery! Automatic code generation does that wonderfully.If we wanted safety, stability, performance, and polish, the impact of LLMs would be more limited. They have a tendency to pile up code on top of code.I think the new tech is just accelerating an already existing problem. Most tech products are already rotting, take a look at windows or iOS.I wonder what will it take for a significant turning point in this mentality."
        },
        {
          "hn_comment_id": 46426716,
          "parent_id": 46426185,
          "author": "qudat",
          "content": "As far as I can tell as a heavy coding agent user: you don’t need to know any of this and that’s a testament to how good code agent TUIs have become. All I do to be productive with a coding agent is tell it to break a problem down into tasks, store it inside beads, and then make sure each step is approved by me. I also add in a TDD requirement where it needs to build tests that fail then eventually pass.Everything else I’ve used has been over engineered and far less impactful. What I just said above is already what many of us do anyway.",
          "created_at": 1767047865000,
          "content_cn": "As far as I can tell as a heavy coding agent user: you don’t need to know any of this and that’s a testament to how good code agent TUIs have become. All I do to be productive with a coding agent is tell it to break a problem down into tasks, store it inside beads, and then make sure each step is approved by me. I also add in a TDD requirement where it needs to build tests that fail then eventually pass.Everything else I’ve used has been over engineered and far less impactful. What I just said above is already what many of us do anyway."
        },
        {
          "hn_comment_id": 46429760,
          "parent_id": 46429036,
          "author": "ActionHank",
          "content": "This is such a great way to frame all his comments.",
          "created_at": 1767071507000,
          "content_cn": "This is such a great way to frame all his comments."
        },
        {
          "hn_comment_id": 46431470,
          "parent_id": 46425398,
          "author": "nl",
          "content": "> OpenAI's sales and marketing expenses increased to _$2 billion_ in the first half of 2025.I believe they include the costs of free ChatGPT user's in that $2B. Worth it considering the conversion rate they are getting (5-6% in Oct 2024[1]).[1] https://www.cnet.com/tech/services-and-software/openai-cfo-p...",
          "created_at": 1767088784000,
          "content_cn": "> OpenAI's sales and marketing expenses increased to _$2 billion_ in the first half of 2025.I believe they include the costs of free ChatGPT user's in that $2B. Worth it considering the conversion rate they are getting (5-6% in Oct 2024[1]).[1] https://www.cnet.com/tech/services-and-software/openai-cfo-p..."
        },
        {
          "hn_comment_id": 46425205,
          "parent_id": 46425127,
          "author": "Q6T46nT668w6i3m",
          "content": "It’s wild that programmers are willing to accept less determinism.",
          "created_at": 1767040211000,
          "content_cn": "It’s wild that programmers are willing to accept less determinism."
        },
        {
          "hn_comment_id": 46431260,
          "parent_id": 46427675,
          "author": "mirsadm",
          "content": "If you don't know how to code then you are not able to judge what your producing accurately.",
          "created_at": 1767086782000,
          "content_cn": "If you don't know how to code then you are not able to judge what your producing accurately."
        },
        {
          "hn_comment_id": 46426379,
          "parent_id": 46426342,
          "author": "xg15",
          "content": "Yes, and I'm disappointed he seems to have joined the AI mysticism crowd.",
          "created_at": 1767046193000,
          "content_cn": "Yes, and I'm disappointed he seems to have joined the 人工智能 mysticism crowd."
        },
        {
          "hn_comment_id": 46426688,
          "parent_id": 46426342,
          "author": "techblueberry",
          "content": "It’s written in the title of the post “Andrew Karpathy” he’s fairly well known in AI circles, he was head of autopilot at Tesla, and co-founded OpenAI.  If you’re curious to learn more about him, the Wikipedia page has a short summary: https://en.wikipedia.org/wiki/Andrej_Karpathy",
          "created_at": 1767047733000,
          "content_cn": "It’s written in the title of the post “Andrew Karpathy” he’s fairly well known in 人工智能 circles, he was head of autopilot at Tesla, and co-founded OpenAI.  If you’re curious to learn more about him, the Wikipedia page has a short summary: https://en.wikipedia.org/wiki/Andrej_Karpathy"
        },
        {
          "hn_comment_id": 46426761,
          "parent_id": 46426342,
          "author": "jeltz",
          "content": "It is even worse coming from him.",
          "created_at": 1767048054000,
          "content_cn": "It is even worse coming from him."
        },
        {
          "hn_comment_id": 46431394,
          "parent_id": 46431166,
          "author": "noosphr",
          "content": "You need a lot more money than $200 if your code base is more than 100,000 lines.If only more people understood what quadratic attention means in the real world.",
          "created_at": 1767088135000,
          "content_cn": "You need a lot more money than $200 if your code base is more than 100,000 lines.If only more people understood what quadratic attention means in the real world."
        },
        {
          "hn_comment_id": 46431714,
          "parent_id": 46427675,
          "author": "krior",
          "content": "All of the applications you mention could be scoped as beginner projects. I don't think they represent good proofs of capability.",
          "created_at": 1767090547000,
          "content_cn": "All of the applications you mention could be scoped as beginner projects. I don't think they represent good proofs of capability."
        },
        {
          "hn_comment_id": 46425666,
          "parent_id": 46425608,
          "author": "tyre",
          "content": "For moment you  an use `date-fns` and tree shake.I'd rather have LLMs build on top of proven, battle-tested production libraries than keep writing their own from scratch. You're going to fill up context with all of its re-invented wheels when it already knows how to use common options.Not to mention that testing things like this is hard. And why waste time (and context and complexity) for humans and LLMs trying to do something hard like state syncing when you can focus on something else?",
          "created_at": 1767042292000,
          "content_cn": "For moment you  an use `date-fns` and tree shake.I'd rather have LLMs build on top of proven, battle-tested production libraries than keep writing their own from scratch. You're going to fill up context with all of its re-invented wheels when it already knows how to use common options.Not to mention that testing things like this is hard. And why waste time (and context and complexity) for humans and LLMs trying to do something hard like state syncing when you can focus on something else?"
        },
        {
          "hn_comment_id": 46428358,
          "parent_id": 46425608,
          "author": "rdhatt",
          "content": "I find it interesting for your example you chose Moment.js -- a time library instead of something utilitarian like Lodash.  For years I've following Jon Skeet's blog about implementing his time library NodaTime (a port of JodaTime). There are a crazy number of edge cases and many unintuitive things about modeling time within a computer.If I just wanted the equivalent of Lodash's _.intersection() method, I get it.  The requirements are pretty straightforward and I can verify the LLM code & tests myself.  One less dependency is great. But with time, I know I don't know enough to verify the LLM's output.Similar to encryption libraries, it's a common recommendation to leave time-based code to developers who live and breathe those black boxes. I trust the community verify the correctness of those concepts, something I can't do myself with LLM output.",
          "created_at": 1767057614000,
          "content_cn": "I find it interesting for your example you chose Moment.js -- a time library instead of something utilitarian like Lodash.  For years I've following Jon Skeet's blog about implementing his time library NodaTime (a port of JodaTime). There are a crazy number of edge cases and many unintuitive things about modeling time within a computer.If I just wanted the equivalent of Lodash's _.intersection() method, I get it.  The requirements are pretty straightforward and I can verify the LLM code & tests myself.  One less dependency is great. But with time, I know I don't know enough to verify the LLM's output.Similar to encryption libraries, it's a common recommendation to leave time-based code to developers who live and breathe those black boxes. I trust the community verify the correctness of those concepts, something I can't do myself with LLM output."
        },
        {
          "hn_comment_id": 46428082,
          "parent_id": 46425714,
          "author": "BhavdeepSethi",
          "content": "Cursor is an IDE.",
          "created_at": 1767055469000,
          "content_cn": "Cursor is an IDE."
        },
        {
          "hn_comment_id": 46426783,
          "parent_id": 46425714,
          "author": "moffkalast",
          "content": "> make at least 20 searches to online documentationLol sometimes I have to spend two turns convincing Claude to use its goddamn search and look up the damn doc instead of trying to shoot from the hip for the fifth time. ChatGPT at least has forced search mode.",
          "created_at": 1767048143000,
          "content_cn": "> make at least 20 searches to online documentationLol sometimes I have to spend two turns convincing Claude to use its goddamn search and look up the damn doc instead of trying to shoot from the hip for the fifth time. ChatGPT at least has forced search mode."
        },
        {
          "hn_comment_id": 46429414,
          "parent_id": 46425714,
          "author": "throw2312321",
          "content": "Thanks for sharing. So the dumb question - do you feel like Claude Code & Cursor have made you significantly more productive? You have an impressive list of personal projects, and I can see how a power user of AI tools can be very effective with green field projects. Does the productivity boost translate as well to your day job?",
          "created_at": 1767067307000,
          "content_cn": "Thanks for sharing. So the dumb question - do you feel like Claude Code & Cursor have made you significantly more productive? You have an impressive list of personal projects, and I can see how a power user of 人工智能 tools can be very effective with green field projects. Does the productivity boost translate as well to your day job?"
        },
        {
          "hn_comment_id": 46426905,
          "parent_id": 46425398,
          "author": "CamperBob2",
          "content": "Let's wait one more year, and perhaps everyone who didn't fall victim to these \"slimming pills” for developers' brains will be glad about the choice they made.In that year, AI will get better.  Will you?",
          "created_at": 1767048572000,
          "content_cn": "Let's wait one more year, and perhaps everyone who didn't fall victim to these \"slimming pills” for developers' brains will be glad about the choice they made.In that year, 人工智能 will get better.  Will you?"
        },
        {
          "hn_comment_id": 46430379,
          "parent_id": 46429036,
          "author": "ex-aws-dude",
          "content": "Exactly, I would put more weight on this if it were coming from someone who actually works as a regular programmer in the industry",
          "created_at": 1767078416000,
          "content_cn": "Exactly, I would put more weight on this if it were coming from someone who actually works as a regular programmer in the industry"
        },
        {
          "hn_comment_id": 46431293,
          "parent_id": 46428121,
          "author": "William_BB",
          "content": "Yeah. It's pretty telling to look at profiles of people who replied to his tweet.",
          "created_at": 1767087070000,
          "content_cn": "Yeah. It's pretty telling to look at profiles of people who replied to his tweet."
        },
        {
          "hn_comment_id": 46425866,
          "parent_id": 46425603,
          "author": "rgreeko42",
          "content": "disruption is a code word for deregulation, and deregulation is bad for everyone except execs and investors",
          "created_at": 1767043339000,
          "content_cn": "disruption is a code word for deregulation, and deregulation is bad for everyone except execs and investors"
        },
        {
          "hn_comment_id": 46428649,
          "parent_id": 46425603,
          "author": "ip26",
          "content": "One possible positive outcome of all this could be sending LLMs to clean up oceans of low value tech debt. Let the humans move fast, let the machines straighten out and tidy up.The ROI of doing this is weak because of how long it takes an expensive human. But if you could clean it up more cheaply, the ROI strengthens considerably- and there’s a lot of it.",
          "created_at": 1767060144000,
          "content_cn": "One possible positive outcome of all this could be sending LLMs to clean up oceans of low value tech debt. Let the humans move fast, let the machines straighten out and tidy up.The ROI of doing this is weak because of how long it takes an expensive human. But if you could clean it up more cheaply, the ROI strengthens considerably- and there’s a lot of it."
        },
        {
          "hn_comment_id": 46429208,
          "parent_id": 46426716,
          "author": "tehnub",
          "content": "I predict by the end of next year we will have our AIs write TPS reports.",
          "created_at": 1767065235000,
          "content_cn": "I predict by the end of next year we will have our AIs write TPS reports."
        },
        {
          "hn_comment_id": 46430457,
          "parent_id": 46426362,
          "author": "qingcharles",
          "content": "Practically every post on HN that mentions AI now ends up with a thread that is \"I get 100X speed-up using LLMs\" vs. \"It made me slower and I've never met a single person in real life who has worked faster with AI.\"I'm a half-decent developer with 40 years experience. AI regularly gives me somewhere in the range of 10-100X speed-up of development. I don't benefit from a meme, I do benefit from better code delivered faster.Sometimes AI is a piece of crap and I work at 0.5X for an hour flogging a dead horse. But those are rarer these days.",
          "created_at": 1767079160000,
          "content_cn": "Practically every post on HN that mentions 人工智能 now ends up with a thread that is \"I get 100X speed-up using LLMs\" vs. \"It made me slower and I've never met a single person in real life who has worked faster with 人工智能.\"I'm a half-decent developer with 40 years experience. 人工智能 regularly gives me somewhere in the range of 10-100X speed-up of development. I don't benefit from a meme, I do benefit from better code delivered faster.Sometimes 人工智能 is a piece of crap and I work at 0.5X for an hour flogging a dead horse. But those are rarer these days."
        },
        {
          "hn_comment_id": 46426770,
          "parent_id": 46426716,
          "author": "halfmatthalfcat",
          "content": "This sounds like my complete and utter nightmare. No art or finesse in building the thing - only an exercise in torturing language to someone who at a fundamental level doesn't understand a thing.",
          "created_at": 1767048067000,
          "content_cn": "This sounds like my complete and utter nightmare. No art or finesse in building the thing - only an exercise in torturing language to someone who at a fundamental level doesn't understand a thing."
        },
        {
          "hn_comment_id": 46426847,
          "parent_id": 46426362,
          "author": "packetlost",
          "content": "Our ops guy has thrown together several buggy dashboards using AI tools. They're passable but impossible to maintain.",
          "created_at": 1767048381000,
          "content_cn": "Our ops guy has thrown together several buggy dashboards using 人工智能 tools. They're passable but impossible to maintain."
        },
        {
          "hn_comment_id": 46427538,
          "parent_id": 46426716,
          "author": "tehnub",
          "content": "Beads?",
          "created_at": 1767051900000,
          "content_cn": "Beads?"
        },
        {
          "hn_comment_id": 46425417,
          "parent_id": 46425205,
          "author": "bryanrasmussen",
          "content": "It's wild that management would be willing to accept it.I think that for some people it is harder to reason about determinism because it is similar to correctness, and correctness can, in many scenarios be something you trade off - for example in relation to scaling and speed you will often trade off correctness.If you do not think clearly about the difference with determinism and other similar properties like (real-time) correctness which you might be willing to trade off, you might think that trading off determinism is just more of the same.Note: I'm against trading off determinism, but I am willing to think there might be a reason to trade it off, just I worry that people are not actually thinking through what it is they're trading when they do it.",
          "created_at": 1767041170000,
          "content_cn": "It's wild that management would be willing to accept it.I think that for some people it is harder to reason about determinism because it is similar to correctness, and correctness can, in many scenarios be something you trade off - for example in relation to scaling and speed you will often trade off correctness.If you do not think clearly about the difference with determinism and other similar properties like (real-time) correctness which you might be willing to trade off, you might think that trading off determinism is just more of the same.Note: I'm against trading off determinism, but I am willing to think there might be a reason to trade it off, just I worry that people are not actually thinking through what it is they're trading when they do it."
        },
        {
          "hn_comment_id": 46426225,
          "parent_id": 46425205,
          "author": "tmaly",
          "content": "I think those that are most successful at creating maintainable code with AI are those that spend more time upfront limiting the nondeterminism aspect using design and context.",
          "created_at": 1767045293000,
          "content_cn": "I think those that are most successful at creating maintainable code with 人工智能 are those that spend more time upfront limiting the nondeterminism aspect using design and context."
        },
        {
          "hn_comment_id": 46425408,
          "parent_id": 46425205,
          "author": "givemeethekeys",
          "content": "Mortgages don't pay for themselves.",
          "created_at": 1767041131000,
          "content_cn": "Mortgages don't pay for themselves."
        },
        {
          "hn_comment_id": 46427298,
          "parent_id": 46425205,
          "author": "whstl",
          "content": "Why would the average programmer have a problem with it?The average programmer is already being pushed into doing a lot of things they're unhappy about in their day jobs.Crappy designs, stupid products, tracking, privacy violation, security issues, slowness on customer machines, terrible tooling, crappy dependencies, horrible culture, pointless nitpicks in code reviews.Half of HN is gonna defend one thing above or the other because $$$.What's one more thing?",
          "created_at": 1767050490000,
          "content_cn": "Why would the average programmer have a problem with it?The average programmer is already being pushed into doing a lot of things they're unhappy about in their day jobs.Crappy designs, stupid products, tracking, privacy violation, security issues, slowness on customer machines, terrible tooling, crappy dependencies, horrible culture, pointless nitpicks in code reviews.Half of HN is gonna defend one thing above or the other because $$$.What's one more thing?"
        },
        {
          "hn_comment_id": 46425496,
          "parent_id": 46425205,
          "author": "viraptor",
          "content": "It's not something that suddenly changed. \"I'll generate some code\" is as nondeterministic as \"I'll look for a library that does it\", \"I'll assign John to code this feature\", or \"I'll outsource this code to a consulting company\". Even if you write yourself, you're pretty nondeterministic in your results - you're not going to write exactly the same code to solve a problem, even if you explicitly try.",
          "created_at": 1767041550000,
          "content_cn": "It's not something that suddenly changed. \"I'll generate some code\" is as nondeterministic as \"I'll look for a library that does it\", \"I'll assign John to code this feature\", or \"I'll outsource this code to a consulting company\". Even if you write yourself, you're pretty nondeterministic in your results - you're not going to write exactly the same code to solve a problem, even if you explicitly try."
        },
        {
          "hn_comment_id": 46430426,
          "parent_id": 46425608,
          "author": "qingcharles",
          "content": "LLMs also have encyclopedic knowledge. Several times LLMs have found some huge block of code I wrote and reduced it down to a few lines. The other day they removed several thousand lines of brittle code I wrote previously for some API calls with a well-tested package I didn't know about. Literally thousands down to dozens.My code is constantly shrinking, becoming better quality, more performant, more best-practice on a daily basis. And I'm learning like crazy. I'm constantly looking up changes it recommends to see why and what the reasons are behind them.It can be a big damned dummy too, though. Just today it was proposing a massive server-side script to workaround an issue with my app I was deploying, when the actual solution was to just make a simple one-line change to the app. (\"You're absolutely right!\")",
          "created_at": 1767078827000,
          "content_cn": "LLMs also have encyclopedic knowledge. Several times LLMs have found some huge block of code I wrote and reduced it down to a few lines. The other day they removed several thousand lines of brittle code I wrote previously for some 应用程序接口 calls with a well-tested package I didn't know about. Literally thousands down to dozens.My code is constantly shrinking, becoming better quality, more performant, more best-practice on a daily basis. And I'm learning like crazy. I'm constantly looking up 变更 it recommends to see why and what the reasons are behind them.It can be a big damned dummy too, though. Just today it was proposing a massive 服务器-side script to workaround an issue with my app I was deploying, when the actual solution was to just make a simple one-line change to the app. (\"You're absolutely right!\")"
        },
        {
          "hn_comment_id": 46427101,
          "parent_id": 46426905,
          "author": "reconnecting",
          "content": "AI is only getting better at consuming energy and wasting people's time communicating with this T9. However, if talented engineers continue to use it, it might eventually provide more accurate replies as a result.Answering your question, no matter how much I personally degrade or improve, I will not be able to produce anything even remotely comparable in terms of negative impact that AI brings to humanity these days.",
          "created_at": 1767049500000,
          "content_cn": "人工智能 is only getting better at consuming energy and wasting people's time communicating with this T9. However, if talented engineers continue to use it, it might eventually provide more accurate replies as a result.Answering your question, no matter how much I personally degrade or improve, I will not be able to produce anything even remotely comparable in terms of negative impact that 人工智能 brings to humanity these days."
        }
      ]
    },
    {
      "hn_id": 46422412,
      "title": "GOG is getting acquired by its original co-founder",
      "url": "https://www.gog.com/blog/gog-is-getting-acquired-by-its-original-co-founder-what-it-means-for-you/",
      "content": null,
      "points": 843,
      "comment_count": 526,
      "author": "haunter",
      "created_at": 1767026594000,
      "title_cn": "GOG被其联合创始人收购",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46424233,
      "title": "The future of software development is software developers",
      "url": "https://codemanship.wordpress.com/2025/11/25/the-future-of-software-development-is-software-developers/",
      "content": null,
      "points": 392,
      "comment_count": 513,
      "author": "cdrnsf",
      "created_at": 1767035657000,
      "title_cn": "软件开发的未来是软件开发者",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46438390,
      "title": "OpenAI's cash burn will be one of the big bubble questions of 2026",
      "url": "https://www.economist.com/leaders/2025/12/30/openais-cash-burn-will-be-one-of-the-big-bubble-questions-of-2026",
      "content": null,
      "points": 292,
      "comment_count": 394,
      "author": "1vuio0pswjnm7",
      "created_at": 1767131047000,
      "title_cn": "OpenAI的烧钱速度将成为2026年重大泡沫问题之一",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46432057,
      "title": "Nicolas Guillou, French ICC judge sanctioned by the US and “debanked”",
      "url": "https://www.lemonde.fr/en/international/article/2025/11/19/nicolas-guillou-french-icc-judge-sanctioned-by-the-us-you-are-effectively-blacklisted-by-much-of-the-world-s-banking-system_6747628_4.html",
      "content": null,
      "points": 374,
      "comment_count": 392,
      "author": "lifeisstillgood",
      "created_at": 1767093210000,
      "title_cn": "法国国际刑事法院法官尼古拉·吉卢遭美国制裁并被“去银行化”",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46431028,
      "title": "Go away Python",
      "url": "https://lorentz.app/blog-item.html?id=go-shebang",
      "content": null,
      "points": 379,
      "comment_count": 345,
      "author": "baalimago",
      "created_at": 1767084644000,
      "title_cn": "走开，Python",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46415225,
      "title": "What an unprocessed photo looks like",
      "url": "https://maurycyz.com/misc/raw_photo/",
      "content": null,
      "points": 2409,
      "comment_count": 399,
      "author": "zdw",
      "created_at": 1766961302000,
      "title_cn": "未经处理的照片原貌",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46424173,
      "title": "Loss32: Let's Build a Win32/Linux",
      "url": "https://loss32.org/",
      "content": null,
      "points": 254,
      "comment_count": 335,
      "author": "akka47",
      "created_at": 1767035348000,
      "title_cn": "\"Loss32：让我们构建一个Win32/Linux系统\"",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46427582,
      "title": "I migrated to an almost all-EU stack and saved 500€ per year",
      "url": "https://www.zeitgeistofbytes.com/p/bye-bye-big-tech-how-i-migrated-to",
      "content": null,
      "points": 331,
      "comment_count": 240,
      "author": "alexcos",
      "created_at": 1767052206000,
      "title_cn": "\"我迁移到几乎全欧盟技术栈，每年节省500欧元\"",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46426624,
      "title": "Show HN: Stop Claude Code from forgetting everything",
      "url": "https://github.com/mutable-state-inc/ensue-skill",
      "content": "I got tired of Claude Code forgetting all my context every time I open a new session: set-up decisions, how I like my margins, decision history. etc.We built a shared memory layer you can drop in as a Claude Code Skill. It’s basically a tiny memory DB with recall that remembers your sessions. Not magic. Not AGI. Just state.Install in Claude Code:  /plugin marketplace add https://github.com/mutable-state-inc/ensue-skill\n  /plugin install ensue-memory\n  # restart Claude Code\n\nWhat it does: (1) persists context between sessions (2) semantic & temportal search (not just string grep). Basically git for your Claude brainWhat it doesn’t do: - it won’t read your mind - it’s alpha; it might break if you throw a couch at itRepo: https://github.com/mutable-state-inc/ensue-skillIf you try it and it sucks, tell me why so I can fix it. Don't be kind, tia",
      "points": 184,
      "comment_count": 218,
      "author": "austinbaggio",
      "created_at": 1767047425000,
      "title_cn": "\"Show HN: 阻止Claude代码遗忘一切\"",
      "content_cn": "我厌倦了Claude Code每次开启新会话就忘记所有上下文：设置决策、我偏好的边距、决策历史等等。我们构建了一个共享记忆层，你可以将其作为Claude Code技能插件直接使用。这本质上是一个带有记忆功能的小型记忆数据库，能记住你的会话记录。不是魔法，不是通用人工智能，只是状态存储。\n\n在Claude Code中安装：\n  /plugin marketplace add https://github.com/mutable-state-inc/ensue-skill\n  /plugin install ensue-memory\n  # 重启Claude Code\n\n功能说明：(1) 在会话间保持上下文连续性 (2) 支持语义与时间线检索（不仅是字符串匹配）。相当于为你Claude大脑配备的git系统\n\n限制说明：- 无法读取你的思维 - 目前是测试版；如果暴力使用可能导致故障\n代码库：https://github.com/mutable-state-inc/ensue-skill\n\n如果你试用后觉得不好用，请告诉我具体原因以便改进。不必客气，先谢过",
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46432311,
      "title": "Non-Zero-Sum Games",
      "url": "https://nonzerosum.games/",
      "content": null,
      "points": 359,
      "comment_count": 178,
      "author": "8organicbits",
      "created_at": 1767094975000,
      "title_cn": "非零和博弈",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46437381,
      "title": "Everything as code: How we manage our company in one monorepo",
      "url": "https://www.kasava.dev/blog/everything-as-code-monorepo",
      "content": null,
      "points": 197,
      "comment_count": 178,
      "author": "benbeingbin",
      "created_at": 1767125142000,
      "title_cn": "一切皆代码：我们如何在一个单体仓库中管理公司",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46424200,
      "title": "AI is forcing us to write good code",
      "url": "https://bits.logic.inc/p/ai-is-forcing-us-to-write-good-code",
      "content": null,
      "points": 290,
      "comment_count": 212,
      "author": "sgk284",
      "created_at": 1767035486000,
      "title_cn": "AI正迫使我们编写优质代码",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46437391,
      "title": "Professional software developers don't vibe, they control",
      "url": "https://arxiv.org/abs/2512.14012",
      "content": null,
      "points": 151,
      "comment_count": 176,
      "author": "dpflan",
      "created_at": 1767125206000,
      "title_cn": "专业开发者不凭感觉，他们掌控一切。",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46438828,
      "title": "NYC Mayoral Inauguration bans Raspberry Pi and Flipper Zero alongside explosives",
      "url": "https://blog.adafruit.com/2025/12/30/nyc-mayoral-inauguration-bans-raspberry-pi-and-flipper-zero-alongside-explosives/",
      "content": null,
      "points": 209,
      "comment_count": 174,
      "author": "ptorrone",
      "created_at": 1767133696000,
      "title_cn": "纽约市长就职典礼禁止携带树莓派和Flipper Zero设备及爆炸物",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46426534,
      "title": "ManusAI Joins Meta",
      "url": "https://manus.im/blog/manus-joins-meta-for-next-era-of-innovation",
      "content": null,
      "points": 307,
      "comment_count": 201,
      "author": "gniting",
      "created_at": 1767047062000,
      "title_cn": "ManusAI加入Meta",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46435308,
      "title": "Show HN: 22 GB of Hacker News in SQLite",
      "url": "https://hackerbook.dosaygo.com",
      "content": "Community, All the HN belong to you. This is an archive of hacker news that fits in your browser. When I made HN Made of Primes I realized I could probably do this offline sqlite/wasm thing with the whole GBs of archive. The whole dataset. So I tried it, and this is it. Have Hacker News on your device.Go to this repo (https://github.com/DOSAYGO-STUDIO/HackerBook): you can download it. Big Query -> ETL -> npx serve docs - that's it. 20 years of HN arguments and beauty, can be yours forever. So they'll never die. Ever. It's the unkillable static archive of HN and it's your hands. That's my Year End gift to you all. Thank you for a wonderful year, have happy and wonderful 2026. make something of it.",
      "points": 438,
      "comment_count": 150,
      "author": "keepamovin",
      "created_at": 1767114119000,
      "title_cn": "\"Show HN: 22 GB 的 Hacker News 数据存入 SQLite\"",
      "content_cn": "社区，所有的HN都属于你。这是一个能装进你浏览器的黑客新闻存档。当我制作“素数构成的HN”时，我意识到或许可以用整个GB级别的存档来实现这个离线SQLite/WASM方案。整个数据集。于是我尝试了，这就是成果。在你的设备上拥有黑客新闻。前往这个仓库（https://github.com/DOSAYGO-STUDIO/HackerBook）：你可以下载它。Big Query -> ETL -> npx serve docs——就这样。20年的HN争论与美好，可以永远属于你。所以它们永远不会消失。永远不会。这是无法被摧毁的HN静态存档，就在你手中。这是我送给各位的年终礼物。感谢这美好的一年，祝大家2026年快乐精彩。用它创造些什么吧。",
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46436409,
      "title": "A faster heart for F-Droid",
      "url": "https://f-droid.org/2025/12/30/a-faster-heart-for-f-droid.html",
      "content": null,
      "points": 344,
      "comment_count": 146,
      "author": "kasabali",
      "created_at": 1767119797000,
      "title_cn": "为F-Droid加速的心跳",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46432862,
      "title": "Times New American: A Tale of Two Fonts",
      "url": "https://hsu.cy/2025/12/times-new-american/",
      "content": null,
      "points": 241,
      "comment_count": 141,
      "author": "firexcy",
      "created_at": 1767099367000,
      "title_cn": "《时代新美国体：两种字体的故事》",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46423566,
      "title": "List of domains censored by German ISPs",
      "url": "https://cuiiliste.de/domains",
      "content": null,
      "points": 408,
      "comment_count": 166,
      "author": "elcapitan",
      "created_at": 1767032490000,
      "title_cn": "德国ISP屏蔽域名列表",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46433649,
      "title": "The 70% AI productivity myth: why most companies aren't seeing the gains",
      "url": "https://sderosiaux.substack.com/p/the-70-ai-productivity-myth-why-most",
      "content": null,
      "points": 77,
      "comment_count": 129,
      "author": "chtefi",
      "created_at": 1767104962000,
      "title_cn": "“70%人工智能生产力神话：为何多数企业未见成效”",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46431560,
      "title": "Netflix Open Content",
      "url": "https://opencontent.netflix.com/",
      "content": null,
      "points": 624,
      "comment_count": 122,
      "author": "tosh",
      "created_at": 1767089517000,
      "title_cn": "Netflix 开放内容",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46424262,
      "title": "All Delisted Steam Games",
      "url": "https://delistedgames.com/all-delisted-steam-games/",
      "content": null,
      "points": 263,
      "comment_count": 132,
      "author": "Bondi_Blue",
      "created_at": 1767035792000,
      "title_cn": "所有已下架的Steam游戏",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46435418,
      "title": "Toro: Deploy Applications as Unikernels",
      "url": "https://github.com/torokernel/torokernel",
      "content": null,
      "points": 127,
      "comment_count": 108,
      "author": "ignoramous",
      "created_at": 1767114597000,
      "title_cn": "Toro：以单内核形式部署应用程序",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46424460,
      "title": "When someone says they hate your product",
      "url": "https://www.getflack.com/p/responding-to-negative-feedback",
      "content": null,
      "points": 177,
      "comment_count": 124,
      "author": "jger15",
      "created_at": 1767036640000,
      "title_cn": "当有人说他们讨厌你的产品时",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46433029,
      "title": "No strcpy either",
      "url": "https://daniel.haxx.se/blog/2025/12/29/no-strcpy-either/",
      "content": null,
      "points": 183,
      "comment_count": 103,
      "author": "firesteelrain",
      "created_at": 1767100480000,
      "title_cn": "\"也不要使用strcpy\"",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46439769,
      "title": "Quality of drinking water varies significantly by airline",
      "url": "https://foodmedcenter.org/2026-center-for-food-as-medicine-longevity-airline-water-study/",
      "content": null,
      "points": 134,
      "comment_count": 103,
      "author": "azinman2",
      "created_at": 1767139430000,
      "title_cn": "不同航空公司饮用水质量差异显著",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46417791,
      "title": "Huge Binaries",
      "url": "https://fzakaria.com/2025/12/28/huge-binaries",
      "content": null,
      "points": 207,
      "comment_count": 112,
      "author": "todsacerdoti",
      "created_at": 1766986517000,
      "title_cn": "巨型二进制文件",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46436889,
      "title": "FediMeteo: A €4 FreeBSD VPS Became a Global Weather Service",
      "url": "https://it-notes.dragas.net/2025/02/26/fedimeteo-how-a-tiny-freebsd-vps-became-a-global-weather-service-for-thousands/",
      "content": null,
      "points": 261,
      "comment_count": 63,
      "author": "birdculture",
      "created_at": 1767122508000,
      "title_cn": "FediMeteo：一台4欧元的FreeBSD VPS如何成为全球气象服务",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46435614,
      "title": "A Vulnerability in Libsodium",
      "url": "https://00f.net/2025/12/30/libsodium-vulnerability/",
      "content": null,
      "points": 251,
      "comment_count": 34,
      "author": "raggi",
      "created_at": 1767115497000,
      "title_cn": "\"Libsodium 中的一个漏洞\"",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46439027,
      "title": "Project ideas to appreciate the art of programming",
      "url": "https://codecrafters.io/blog/programming-project-ideas",
      "content": null,
      "points": 192,
      "comment_count": 59,
      "author": "vitaelabitur",
      "created_at": 1767134856000,
      "title_cn": "领略编程艺术的项目构想",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46420672,
      "title": "Libgodc: Write Go Programs for Sega Dreamcast",
      "url": "https://github.com/drpaneas/libgodc",
      "content": null,
      "points": 230,
      "comment_count": 56,
      "author": "drpaneas",
      "created_at": 1767015809000,
      "title_cn": "Libgodc：为世嘉Dreamcast编写Go程序",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46432999,
      "title": "The British empire's resilient subsea telegraph network",
      "url": "https://subseacables.blogspot.com/2025/12/the-british-empires-resilient-subsea.html",
      "content": null,
      "points": 186,
      "comment_count": 45,
      "author": "giuliomagnifico",
      "created_at": 1767100256000,
      "title_cn": "大英帝国坚韧的海底电报网络",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46438522,
      "title": "Honey's Dieselgate: Detecting and tricking testers",
      "url": "https://vptdigital.com/blog/honey-detecting-testers/",
      "content": null,
      "points": 178,
      "comment_count": 52,
      "author": "AkshatJ27",
      "created_at": 1767131975000,
      "title_cn": "蜂蜜的柴油门：检测与欺骗测试者",
      "content_cn": null,
      "abstract": null,
      "comments": []
    },
    {
      "hn_id": 46422757,
      "title": "Five Years of Tinygrad",
      "url": "https://geohot.github.io//blog/jekyll/update/2025/12/29/five-years-of-tinygrad.html",
      "content": null,
      "points": 212,
      "comment_count": 101,
      "author": "iyaja",
      "created_at": 1767028340000,
      "title_cn": "Tinygrad的五年历程",
      "content_cn": null,
      "abstract": null,
      "comments": []
    }
  ]
}